org/fgem.org
#+TITLE: Functional Enrichment by Expectation Maximization Project
#+SETUPFILE: setup.org
#+OPTIONS: toc:2

* TODO find immune genes
* TODO FGEM Project [0%]
** TODO Write Paper [0%]
   DEADLINE: <2020-05-13 Wed>
+ Target submission to Bioinformatics
*** TODO figures
**** TODO figure for workflow
**** TODO figure for validation
**** TODO figure for specific genes
**** DONE table of full results
***** DONE each feature and beta, univariate p value and beta
***** DONE each gene BF functional and uniform prior (and pathways) and evidence of the gene
*** TODO Introduction 
*** TODO Statistical Method 
*** Application to Cancer
*** TODO Software
*** TODO Results 
*** TODO Discussion
** TODO Analyses [53%]
   DEADLINE: <2020-05-04 Mon>
*** DONE Run FGEM on driverMAPS TCGA
*** TODO make plots 
*** DONE compare to univariate results
*** DONE plot of fisher exact test
*** TODO check against siming's results
*** TODO find (top) innate immune response
*** DONE do cross validation of FGEM
*** DONE show performance as a function of lambda
*** TODO double check with Siming
**** Multivariate enrichment
*** DONE number of (significant) genes per cancer
*** DONE find out what the outliers are
*** TODO filter to 20 genes for gene ontology
*** TODO choose a cancer to present


* Analysis


*** HNSC
*** UCEC 
*** BRCA

* TODO Display items [33%]
** TODO overall workflow
*** Input/output
*** univariate test
*** feature selection
*** enrichment and posterior
** DONE Univariate Enrichment features
*** biplot
*** FET results side by side with FGEM
**** for discrepant result show how fgem did better
**** highlight pathways where we show difference
** TODO Posterior figures [50%]
*** DONE UCEC and BRCA
*** TODO get rid of low functional posterior labels
** Genes
*** Heatmap
*** BRCA and UCEC
*** new genes that aren't characterized in this cancer type
*** new genes that aren't characterized in any cancer type

** Which cancer types are we going to look at ?

Some cancer types have weird bayes factors, so we're going to ignore those. That leaves us with these:

#+NAME: cancerlist
| cancer |
|--------|
| BLCA   |
| BRCA   |
| CESC   |
| ESCA   |
| GBM    |
| HNSC   |
| KIRC   |
| KIRP   |
| LIHC   |
| LUAD   |
| LUSC   |
| PAAD   |
| PRAD   |
| SARC   |
| SKCM   |
| TGCT   |
| UCEC   |
| UCS    |

#+PROPERTY: header-args:R  :var cancerlist=cancerlist
#+PROPERTY: header-args:R  :colnames yes

