docs/fgem.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-07-30 Thu 11:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Functional Enrichment by Expectation Maximization Project</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Nicholas Knoblauch">
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Functional Enrichment by Expectation Maximization Project</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org82c9f9c"><span class="todo TODO">TODO</span> find immune genes</a></li>
<li><a href="#org054bbb5"><span class="todo TODO">TODO</span> FGEM Project <code>[0%]</code></a>
<ul>
<li><a href="#orga6c2f62"><span class="todo TODO">TODO</span> Write Paper <code>[0%]</code></a></li>
<li><a href="#orgaaa11c6"><span class="todo TODO">TODO</span> Analyses <code>[53%]</code></a></li>
</ul>
</li>
<li><a href="#org628ddd9">Analysis</a></li>
<li><a href="#org7ae18b7"><span class="todo TODO">TODO</span> Display items <code>[33%]</code></a>
<ul>
<li><a href="#orgd9f9ef1"><span class="todo TODO">TODO</span> overall workflow</a></li>
<li><a href="#org50b795b"><span class="done DONE">DONE</span> Univariate Enrichment features</a></li>
<li><a href="#org23db01a"><span class="todo TODO">TODO</span> Posterior figures <code>[50%]</code></a></li>
<li><a href="#orgd528e7f">Genes</a></li>
<li><a href="#orgb6b81f5">Which cancer types are we going to look at ?</a></li>
<li><a href="#orgb5db8fb">COSMIC census</a></li>
<li><a href="#orga962dfe">cross-validation</a></li>
<li><a href="#orgb79c3ee">IntOGen validation</a></li>
<li><a href="#orgfd2863e">The case of GBM</a></li>
<li><a href="#orgdfc34c1">IntOGen validation</a></li>
<li><a href="#org3ccbfaa"><span class="todo TODO">TODO</span> Code <code>[66%]</code></a></li>
</ul>
</li>
<li><a href="#org392c63b">Extras</a>
<ul>
<li><a href="#orgd8520f9">Trying GLM family function</a></li>
<li><a href="#org0b1890b">FGEM analyses</a></li>
<li><a href="#org592b59f">Cancer and ExAC</a></li>
</ul>
</li>
<li><a href="#org1206012">Trying Stan</a>
<ul>
<li><a href="#orgf41693e">The Finnish Horseshoe</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org82c9f9c" class="outline-2">
<h2 id="org82c9f9c"><span class="todo TODO">TODO</span> find immune genes</h2>
</div>
<div id="outline-container-org054bbb5" class="outline-2">
<h2 id="org054bbb5"><span class="todo TODO">TODO</span> FGEM Project <code>[0%]</code></h2>
<div class="outline-text-2" id="text-org054bbb5">
</div>
<div id="outline-container-orga6c2f62" class="outline-3">
<h3 id="orga6c2f62"><span class="todo TODO">TODO</span> Write Paper <code>[0%]</code></h3>
<div class="outline-text-3" id="text-orga6c2f62">
<ul class="org-ul">
<li>Target submission to Bioinformatics</li>
</ul>
</div>
<div id="outline-container-org9e3728a" class="outline-4">
<h4 id="org9e3728a"><span class="todo TODO">TODO</span> figures</h4>
<div class="outline-text-4" id="text-org9e3728a">
</div>
<ul class="org-ul">
<li><a id="org1a2dda0"></a><span class="todo TODO">TODO</span> figure for workflow<br></li>
<li><a id="org61accb2"></a><span class="todo TODO">TODO</span> figure for validation<br></li>
<li><a id="org61ad383"></a><span class="todo TODO">TODO</span> figure for specific genes<br></li>
<li><a id="org6eb24b1"></a><span class="done DONE">DONE</span> table of full results<br>
<ul class="org-ul">
<li><a id="org2e4cbbc"></a><span class="done DONE">DONE</span> each feature and beta, univariate p value and beta<br></li>
<li><a id="org000e3ca"></a><span class="done DONE">DONE</span> each gene BF functional and uniform prior (and pathways) and evidence of the gene<br></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org67ff873" class="outline-4">
<h4 id="org67ff873"><span class="todo TODO">TODO</span> Introduction</h4>
</div>
<div id="outline-container-org61e6980" class="outline-4">
<h4 id="org61e6980"><span class="todo TODO">TODO</span> Statistical Method</h4>
</div>
<div id="outline-container-org4748acf" class="outline-4">
<h4 id="org4748acf">Application to Cancer</h4>
</div>
<div id="outline-container-org85395db" class="outline-4">
<h4 id="org85395db"><span class="todo TODO">TODO</span> Software</h4>
</div>
<div id="outline-container-org2bd4a5d" class="outline-4">
<h4 id="org2bd4a5d"><span class="todo TODO">TODO</span> Results</h4>
</div>
<div id="outline-container-orgaa3f2ba" class="outline-4">
<h4 id="orgaa3f2ba"><span class="todo TODO">TODO</span> Discussion</h4>
</div>
</div>
<div id="outline-container-orgaaa11c6" class="outline-3">
<h3 id="orgaaa11c6"><span class="todo TODO">TODO</span> Analyses <code>[53%]</code></h3>
<div class="outline-text-3" id="text-orgaaa11c6">
</div>
<div id="outline-container-orgc20e030" class="outline-4">
<h4 id="orgc20e030"><span class="done DONE">DONE</span> Run FGEM on driverMAPS TCGA</h4>
</div>
<div id="outline-container-org66be9d4" class="outline-4">
<h4 id="org66be9d4"><span class="todo TODO">TODO</span> make plots</h4>
</div>
<div id="outline-container-orgc744723" class="outline-4">
<h4 id="orgc744723"><span class="done DONE">DONE</span> compare to univariate results</h4>
</div>
<div id="outline-container-org277e635" class="outline-4">
<h4 id="org277e635"><span class="done DONE">DONE</span> plot of fisher exact test</h4>
</div>
<div id="outline-container-org83431d0" class="outline-4">
<h4 id="org83431d0"><span class="todo TODO">TODO</span> check against siming's results</h4>
</div>
<div id="outline-container-org2a327ea" class="outline-4">
<h4 id="org2a327ea"><span class="todo TODO">TODO</span> find (top) innate immune response</h4>
</div>
<div id="outline-container-org7f0e26e" class="outline-4">
<h4 id="org7f0e26e"><span class="done DONE">DONE</span> do cross validation of FGEM</h4>
</div>
<div id="outline-container-org49cd5e1" class="outline-4">
<h4 id="org49cd5e1"><span class="done DONE">DONE</span> show performance as a function of lambda</h4>
</div>
<div id="outline-container-org215dd23" class="outline-4">
<h4 id="org215dd23"><span class="todo TODO">TODO</span> double check with Siming</h4>
<div class="outline-text-4" id="text-org215dd23">
</div>
<ul class="org-ul">
<li><a id="org5af62e6"></a>Multivariate enrichment<br></li>
</ul>
</div>
<div id="outline-container-org2ca763e" class="outline-4">
<h4 id="org2ca763e"><span class="done DONE">DONE</span> number of (significant) genes per cancer</h4>
</div>
<div id="outline-container-org6fec02a" class="outline-4">
<h4 id="org6fec02a"><span class="done DONE">DONE</span> find out what the outliers are</h4>
</div>
<div id="outline-container-org3f4ea16" class="outline-4">
<h4 id="org3f4ea16"><span class="todo TODO">TODO</span> filter to 20 genes for gene ontology</h4>
</div>
<div id="outline-container-org18917d3" class="outline-4">
<h4 id="org18917d3"><span class="todo TODO">TODO</span> choose a cancer to present</h4>
</div>
</div>
</div>


<div id="outline-container-org628ddd9" class="outline-2">
<h2 id="org628ddd9">Analysis</h2>
<div class="outline-text-2" id="text-org628ddd9">
</div>
<div id="outline-container-orgd34fa2c" class="outline-4">
<h4 id="orgd34fa2c">HNSC</h4>
</div>
<div id="outline-container-org1232ac6" class="outline-4">
<h4 id="org1232ac6">UCEC</h4>
</div>
<div id="outline-container-orgb419e55" class="outline-4">
<h4 id="orgb419e55">BRCA</h4>
</div>
</div>

<div id="outline-container-org7ae18b7" class="outline-2">
<h2 id="org7ae18b7"><span class="todo TODO">TODO</span> Display items <code>[33%]</code></h2>
<div class="outline-text-2" id="text-org7ae18b7">
</div>
<div id="outline-container-orgd9f9ef1" class="outline-3">
<h3 id="orgd9f9ef1"><span class="todo TODO">TODO</span> overall workflow</h3>
<div class="outline-text-3" id="text-orgd9f9ef1">
</div>
<div id="outline-container-org9e02987" class="outline-4">
<h4 id="org9e02987">Input/output</h4>
</div>
<div id="outline-container-org9906686" class="outline-4">
<h4 id="org9906686">univariate test</h4>
</div>
<div id="outline-container-org3f66231" class="outline-4">
<h4 id="org3f66231">feature selection</h4>
</div>
<div id="outline-container-orgb6cac07" class="outline-4">
<h4 id="orgb6cac07">enrichment and posterior</h4>
</div>
</div>
<div id="outline-container-org50b795b" class="outline-3">
<h3 id="org50b795b"><span class="done DONE">DONE</span> Univariate Enrichment features</h3>
<div class="outline-text-3" id="text-org50b795b">
</div>
<div id="outline-container-orgd3643aa" class="outline-4">
<h4 id="orgd3643aa">biplot</h4>
</div>
<div id="outline-container-org16b54fd" class="outline-4">
<h4 id="org16b54fd">FET results side by side with FGEM</h4>
<div class="outline-text-4" id="text-org16b54fd">
</div>
<ul class="org-ul">
<li><a id="org22a427d"></a>for discrepant result show how fgem did better<br></li>
<li><a id="orgae5733a"></a>highlight pathways where we show difference<br></li>
</ul>
</div>
</div>
<div id="outline-container-org23db01a" class="outline-3">
<h3 id="org23db01a"><span class="todo TODO">TODO</span> Posterior figures <code>[50%]</code></h3>
<div class="outline-text-3" id="text-org23db01a">
</div>
<div id="outline-container-org37284cb" class="outline-4">
<h4 id="org37284cb"><span class="done DONE">DONE</span> UCEC and BRCA</h4>
</div>
<div id="outline-container-orge3c98ad" class="outline-4">
<h4 id="orge3c98ad"><span class="todo TODO">TODO</span> get rid of low functional posterior labels</h4>
</div>
</div>
<div id="outline-container-orgd528e7f" class="outline-3">
<h3 id="orgd528e7f">Genes</h3>
<div class="outline-text-3" id="text-orgd528e7f">
</div>
<div id="outline-container-orgf0fd76f" class="outline-4">
<h4 id="orgf0fd76f">Heatmap</h4>
</div>
<div id="outline-container-orga248148" class="outline-4">
<h4 id="orga248148">BRCA and UCEC</h4>
</div>
<div id="outline-container-orgbaa65ef" class="outline-4">
<h4 id="orgbaa65ef">new genes that aren't characterized in this cancer type</h4>
</div>
<div id="outline-container-orgf347d6c" class="outline-4">
<h4 id="orgf347d6c">new genes that aren't characterized in any cancer type</h4>
</div>
</div>

<div id="outline-container-orgb6b81f5" class="outline-3">
<h3 id="orgb6b81f5">Which cancer types are we going to look at ?</h3>
<div class="outline-text-3" id="text-orgb6b81f5">
<p>
Some cancer types have weird bayes factors, so we're going to ignore those. That leaves us with these:
</p>

<table id="orgcbfc827">


<colgroup>
<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">cancer</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">BLCA</td>
</tr>

<tr>
<td class="org-left">BRCA</td>
</tr>

<tr>
<td class="org-left">CESC</td>
</tr>

<tr>
<td class="org-left">ESCA</td>
</tr>

<tr>
<td class="org-left">GBM</td>
</tr>

<tr>
<td class="org-left">HNSC</td>
</tr>

<tr>
<td class="org-left">KIRC</td>
</tr>

<tr>
<td class="org-left">KIRP</td>
</tr>

<tr>
<td class="org-left">LIHC</td>
</tr>

<tr>
<td class="org-left">LUAD</td>
</tr>

<tr>
<td class="org-left">LUSC</td>
</tr>

<tr>
<td class="org-left">PAAD</td>
</tr>

<tr>
<td class="org-left">PRAD</td>
</tr>

<tr>
<td class="org-left">SARC</td>
</tr>

<tr>
<td class="org-left">SKCM</td>
</tr>

<tr>
<td class="org-left">TGCT</td>
</tr>

<tr>
<td class="org-left">UCEC</td>
</tr>

<tr>
<td class="org-left">UCS</td>
</tr>
</tbody>
</table>
</div>

<ul class="org-ul">
