org/fgem.org
**** Looking at the data
We'll start by reading the data, pulling out the info we'll use, and saving it back in a nicer format.  We'll
also remove the olfactory receptor genes and siming's blacklisted genes
#+BEGIN_SRC R :session drivermaps :dir /home/nwknoblauch/Dropbox/Repos/dissertation/  :results none

  library(tidyverse)
  library(fgem)
  library(qs)

  data_f <- fs::dir_ls("data/driverMAPS_results_20TumorTypes",glob="*txt")
  cancer_t <- str_replace(data_f, ".+/([A-Z]+)_BayesFactorFDR.txt", "\\1")
  blacklist_url <- "https://szhao06.bitbucket.io/driverMAPS-documentation/data/Blacklist_combined.txt"
  blacklist_df <- read_tsv(blacklist_url,col_names=c("cancer","Gene"))
  go_df <- select(BPGOdf, Gene, feature_name = feature)

  olfactory_df <- filter(go_df,feature_name=="GO:0050911") %>%
    select(Gene) %>%
    mutate(ina=NA) %>% 
    inner_join(tibble(cancer=cancer_t,ina=NA)) %>% select(-ina)
  blacklist_df <- bind_rows(olfactory_df,go_df) %>% distinct()
#+END_SRC

#+BEGIN_SRC R :session drivermaps :dir /home/nwknoblauch/Dropbox/Repos/dissertation/  :results none

#+END_SRC

#+BEGIN_SRC R :session drivermaps :dir /home/nwknoblauch/Dropbox/Repos/dissertation/  :results none
  vc <- readr::cols(
                 Gene = col_character(),
                 No_nonsyn = col_skip(),
                 functypecode8 = col_skip(),
                 mycons = col_skip(),
                 sift = col_skip(),
                 phylop100 = col_skip(),
                 MA = col_skip(),
                 No_unique_mutation = col_skip(),
                 TSG_BF = col_double(),
                 OG_BF = col_double(),
                 Expected_syn = col_skip(),
                 No_syn = col_skip(),
                 BF = col_double(),
                 predtag = col_skip(),
                 Posterior = col_skip(),
                 FDR = col_double()
               )

  cancer_df <- map2_df(data_f,
                       cancer_t,
                       ~vroom::vroom(.x,
                                     col_names = names(vc$cols),
                                     col_types = vc,
                                     skip = 1L) %>% mutate(cancer = .y))
  good_cancer_df <- anti_join(cancer_df,blacklist_df)
#+END_SRC

#+BEGIN_SRC R :session drivermaps :dir /home/nwknoblauch/Dropbox/Repos/dissertation/  :results none

saveRDS(good_cancer_df,"data/cleanest_driverMAPS_results_20TumorTypes.RDS")
qs::qsave(good_cancer_df,"data/cleanest_driverMAPS_results_20TumorTypes.qs")

#+END_SRC

**** Check for negative intercept

We want to make sure that the intercept is negative.  We'll focus on cancers where that's the case

#+BEGIN_SRC R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

    library(fgem)
    library(dplyr)

    cancer_df <- qs::qread("data/cleanest_driverMAPS_results_20TumorTypes.qs")  
    cancer_null <-  group_by(cancer_df,cancer) %>% 
    summarise(null_lik=fgem:::fgem_null_lik(BF, log_BF = TRUE),
              Intercept=fgem:::fgem_null(BF, log_BF = TRUE))

  filter(cancer_null,Intercept<0) %>% pull(cancer)
#+END_SRC

#+BEGIN_SRC R :session drivermaps :dir /home/nwknoblauch/Dropbox/Repos/dissertation/  :results none

  saveRDS(cancer_df,"data/driverMAPS_results_20TumorTypes.RDS")
  qs::qsave(cancer_df,"data/driverMAPS_results_20TumorTypes.qs")
#+END_SRC


#+BEGIN_SRC R :colnames yes :session drivermaps :dir /home/nwknoblauch/Dropbox/Repos/dissertation/
head(cancer_df)
#+END_SRC

#+RESULTS:
| Gene   |            TSG_BF |             OG_BF |               BF | FDR | cancer |
|--------+-------------------+-------------------+------------------+-----+--------|
| PIK3CA | -1.77971729131923 |  322.833185837287 | 322.140038656727 |   0 | BLCA   |
| FGFR3  |  28.0895429320585 |  246.567548311336 | 245.874401130776 |   0 | BLCA   |
| TP53   |  191.788256479794 |  70.7692247503828 | 191.095109299234 |   0 | BLCA   |
| ERBB2  |  2.30809843606858 |  111.697583835288 | 111.004436654728 |   0 | BLCA   |
| ERCC2  |  14.6298592310469 |   80.657307268368 | 79.9641600878081 |   0 | BLCA   |
| ARID1A |  71.9813145469098 | -11.8163792581274 | 71.2881673663499 |   0 | BLCA   |


driverMAPS reports the $\text{BF}$'s as $log(\text{BF})$.  I haven't figured out a way to work with these values without 
exponentiating them and some of them are really big(small).  I'm going to have to "clamp" them between the minimum and maximum representable values
(using double precision floating point).  

**** GO terms

I'm going to pull the GO annotations from the ~GO.db~ package.



#+BEGIN_SRC R :session bioc :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :results none :var cancerlist=cancerlist
  library(tidyverse)
  library(fgem)
  library(GO.db)
  library(qs)
  cancerf <- c("BLCA", "BRCA", "CESC", "ESCA", "GBM", "HNSC", "KICH", 
                   "KIRC", "KIRP", "LIHC", "LUAD", "LUSC", "PAAD", "PRAD", "SARC", 
                   "SKCM", "UCEC", "UCS")

#+END_SRC

#+BEGIN_SRC R :session bioc :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :results none

  cancer_df <- qread("data/cleanest_driverMAPS_results_20TumorTypes.qs")
  tbp <- topGO::annFUN.org("BP",feasibleGenes=unique(cancer_df$Gene),mapping="org.Hs.eg.db",ID="symbol")
  tbp_df <- imap_dfr(tbp,function(Genes,GO)tibble(Gene=Genes,feature_name=GO))
  qs::qsave(tbp_df,"data/GO_df.qs")

#+END_SRC


#+BEGIN_SRC R :session bioc :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :results none
  term_list <- as.list(GOTERM)    
  fn_df <- distinct(tbp_df,feature_name) %>% 
    pull(feature_name) %>% map_dfr(function(x){
      tx <- term_list[[x]]
      tibble(feature_name=x,
             Term=Term(tx),
             Definition=Definition(tx),
             Synonyms=list(Synonym(tx)))
    })
  qs::qsave(fn_df,"data/GO_Definitions.qs")
#+END_SRC

