docs/fgem.html
<li><a id="org3168402"></a>Looking at the data<br>
<div class="outline-text-5" id="text-org3168402">
<p>
We'll start by reading the data, pulling out the info we'll use, and saving it back in a nicer format.  We'll
also remove the olfactory receptor genes and siming's blacklisted genes
</p>
<div class="org-src-container">
<pre class="src src-R">
<span style="color: #C04040;">library</span>(tidyverse)
<span style="color: #C04040;">library</span>(fgem)
<span style="color: #C04040;">library</span>(qs)

data_f <span style="color: #C04040;">&lt;-</span> fs::dir_ls(<span style="color: #FFABAB;">"data/driverMAPS_results_20TumorTypes"</span>,glob=<span style="color: #FFABAB;">"*txt"</span>)
cancer_t <span style="color: #C04040;">&lt;-</span> str_replace(data_f, <span style="color: #FFABAB;">".+/([A-Z]+)_BayesFactorFDR.txt"</span>, <span style="color: #FFABAB;">"\\1"</span>)
blacklist_url <span style="color: #C04040;">&lt;-</span> <span style="color: #FFABAB;">"https://szhao06.bitbucket.io/driverMAPS-documentation/data/Blacklist_combined.txt"</span>
blacklist_df <span style="color: #C04040;">&lt;-</span> read_tsv(blacklist_url,col_names=c(<span style="color: #FFABAB;">"cancer"</span>,<span style="color: #FFABAB;">"Gene"</span>))
go_df <span style="color: #C04040;">&lt;-</span> select(BPGOdf, Gene, feature_name = feature)

olfactory_df <span style="color: #C04040;">&lt;-</span> filter(go_df,feature_name==<span style="color: #FFABAB;">"GO:0050911"</span>) <span style="color: #C04040;">%&gt;%</span>
  select(Gene) <span style="color: #C04040;">%&gt;%</span>
  mutate(ina=<span style="color: #99D6FF;">NA</span>) <span style="color: #C04040;">%&gt;%</span> 
  inner_join(tibble(cancer=cancer_t,ina=<span style="color: #99D6FF;">NA</span>)) <span style="color: #C04040;">%&gt;%</span> select(-ina)
blacklist_df <span style="color: #C04040;">&lt;-</span> bind_rows(olfactory_df,go_df) <span style="color: #C04040;">%&gt;%</span> distinct()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">vc <span style="color: #C04040;">&lt;-</span> readr::cols(
               Gene = col_character(),
               No_nonsyn = col_skip(),
               functypecode8 = col_skip(),
               mycons = col_skip(),
               sift = col_skip(),
               phylop100 = col_skip(),
               MA = col_skip(),
               No_unique_mutation = col_skip(),
               TSG_BF = col_double(),
               OG_BF = col_double(),
               Expected_syn = col_skip(),
               No_syn = col_skip(),
               BF = col_double(),
               predtag = col_skip(),
               Posterior = col_skip(),
               FDR = col_double()
             )

cancer_df <span style="color: #C04040;">&lt;-</span> map2_df(data_f,
                     cancer_t,
                     ~vroom::vroom(.x,
                                   col_names = names(vc$cols),
                                   col_types = vc,
                                   skip = 1L) <span style="color: #C04040;">%&gt;%</span> mutate(cancer = .y))
good_cancer_df <span style="color: #C04040;">&lt;-</span> anti_join(cancer_df,blacklist_df)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
saveRDS(good_cancer_df,<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.RDS"</span>)
qs::qsave(good_cancer_df,<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>)

</pre>
</div>
</div>
</li>

<li><a id="orgadf1024"></a>Check for negative intercept<br>
<div class="outline-text-5" id="text-orgadf1024">
<p>
We want to make sure that the intercept is negative.  We'll focus on cancers where that's the case
</p>

<div class="org-src-container">
<pre class="src src-R">
  <span style="color: #C04040;">library</span>(fgem)
  <span style="color: #C04040;">library</span>(dplyr)

  cancer_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>)  
  cancer_null <span style="color: #C04040;">&lt;-</span>  group_by(cancer_df,cancer) <span style="color: #C04040;">%&gt;%</span> 
  summarise(null_lik=fgem:::fgem_null_lik(BF, log_BF = <span style="color: #99D6FF;">TRUE</span>),
            Intercept=fgem:::fgem_null(BF, log_BF = <span style="color: #99D6FF;">TRUE</span>))

filter(cancer_null,Intercept&lt;0) <span style="color: #C04040;">%&gt;%</span> pull(cancer)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
saveRDS(cancer_df,<span style="color: #FFABAB;">"data/driverMAPS_results_20TumorTypes.RDS"</span>)
qs::qsave(cancer_df,<span style="color: #FFABAB;">"data/driverMAPS_results_20TumorTypes.qs"</span>)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-R">head(cancer_df)
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Gene</th>
<th scope="col" class="org-right">TSG<sub>BF</sub></th>
<th scope="col" class="org-right">OG<sub>BF</sub></th>
<th scope="col" class="org-right">BF</th>
<th scope="col" class="org-right">FDR</th>
<th scope="col" class="org-left">cancer</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PIK3CA</td>
<td class="org-right">-1.77971729131923</td>
<td class="org-right">322.833185837287</td>
<td class="org-right">322.140038656727</td>
<td class="org-right">0</td>
<td class="org-left">BLCA</td>
</tr>

<tr>
<td class="org-left">FGFR3</td>
<td class="org-right">28.0895429320585</td>
<td class="org-right">246.567548311336</td>
<td class="org-right">245.874401130776</td>
<td class="org-right">0</td>
<td class="org-left">BLCA</td>
</tr>

<tr>
<td class="org-left">TP53</td>
<td class="org-right">191.788256479794</td>
<td class="org-right">70.7692247503828</td>
<td class="org-right">191.095109299234</td>
<td class="org-right">0</td>
<td class="org-left">BLCA</td>
</tr>

<tr>
<td class="org-left">ERBB2</td>
<td class="org-right">2.30809843606858</td>
<td class="org-right">111.697583835288</td>
<td class="org-right">111.004436654728</td>
<td class="org-right">0</td>
<td class="org-left">BLCA</td>
</tr>

<tr>
<td class="org-left">ERCC2</td>
<td class="org-right">14.6298592310469</td>
<td class="org-right">80.657307268368</td>
<td class="org-right">79.9641600878081</td>
<td class="org-right">0</td>
<td class="org-left">BLCA</td>
</tr>

<tr>
<td class="org-left">ARID1A</td>
<td class="org-right">71.9813145469098</td>
<td class="org-right">-11.8163792581274</td>
<td class="org-right">71.2881673663499</td>
<td class="org-right">0</td>
<td class="org-left">BLCA</td>
</tr>
</tbody>
</table>


<p>
driverMAPS reports the \(\text{BF}\)'s as \(log(\text{BF})\).  I haven't figured out a way to work with these values without 
exponentiating them and some of them are really big(small).  I'm going to have to "clamp" them between the minimum and maximum representable values
(using double precision floating point).  
</p>
</div>
</li>

<li><a id="orgdcc4085"></a>GO terms<br>
<div class="outline-text-5" id="text-orgdcc4085">
<p>
I'm going to pull the GO annotations from the <code>GO.db</code> package.
</p>



<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(tidyverse)
<span style="color: #C04040;">library</span>(fgem)
<span style="color: #C04040;">library</span>(GO.db)
<span style="color: #C04040;">library</span>(qs)
cancerf <span style="color: #C04040;">&lt;-</span> c(<span style="color: #FFABAB;">"BLCA"</span>, <span style="color: #FFABAB;">"BRCA"</span>, <span style="color: #FFABAB;">"CESC"</span>, <span style="color: #FFABAB;">"ESCA"</span>, <span style="color: #FFABAB;">"GBM"</span>, <span style="color: #FFABAB;">"HNSC"</span>, <span style="color: #FFABAB;">"KICH"</span>, 
                 <span style="color: #FFABAB;">"KIRC"</span>, <span style="color: #FFABAB;">"KIRP"</span>, <span style="color: #FFABAB;">"LIHC"</span>, <span style="color: #FFABAB;">"LUAD"</span>, <span style="color: #FFABAB;">"LUSC"</span>, <span style="color: #FFABAB;">"PAAD"</span>, <span style="color: #FFABAB;">"PRAD"</span>, <span style="color: #FFABAB;">"SARC"</span>, 
                 <span style="color: #FFABAB;">"SKCM"</span>, <span style="color: #FFABAB;">"UCEC"</span>, <span style="color: #FFABAB;">"UCS"</span>)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
cancer_df <span style="color: #C04040;">&lt;-</span> qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>)
tbp <span style="color: #C04040;">&lt;-</span> topGO::annFUN.org(<span style="color: #FFABAB;">"BP"</span>,feasibleGenes=unique(cancer_df$Gene),mapping=<span style="color: #FFABAB;">"org.Hs.eg.db"</span>,ID=<span style="color: #FFABAB;">"symbol"</span>)
tbp_df <span style="color: #C04040;">&lt;-</span> imap_dfr(tbp,<span style="color: #C8FF03;">function</span>(Genes,GO)tibble(Gene=Genes,feature_name=GO))
qs::qsave(tbp_df,<span style="color: #FFABAB;">"data/GO_df.qs"</span>)

</pre>
</div>


<div class="org-src-container">
<pre class="src src-R">term_list <span style="color: #C04040;">&lt;-</span> as.list(GOTERM)    
fn_df <span style="color: #C04040;">&lt;-</span> distinct(tbp_df,feature_name) <span style="color: #C04040;">%&gt;%</span> 
  pull(feature_name) <span style="color: #C04040;">%&gt;%</span> map_dfr(<span style="color: #C8FF03;">function</span>(x){
    tx <span style="color: #C04040;">&lt;-</span> term_list[[x]]
    tibble(feature_name=x,
           Term=Term(tx),
           Definition=Definition(tx),
           Synonyms=list(Synonym(tx)))
  })
qs::qsave(fn_df,<span style="color: #FFABAB;">"data/GO_Definitions.qs"</span>)
</pre>
</div>
</div>
</li>
