org/fgem.org
**** Fitting  Fisher's Exact test

#+BEGIN_SRC R :session fisher :dir /home/nwknoblauch/Dropbox/Repos/dissertation/
  library(tidyverse)
  library(fgem)
  library(progressr)
  library(furrr)
  library(qs)
  plan(multisession)

  cancer_df <- qs::qread("data/cleanest_driverMAPS_results_20TumorTypes.qs") 
  BPGOdf <- qs::qread("data/GO_df.qs")
  min_cancer_df <- cancer_df %>%
  select(Gene, FDR, cancer)

  go_df <- mutate(BPGOdf,Gene=as.character(Gene)) %>%
  semi_join(distinct(cancer_df,Gene))

  go_df <- group_by(go_df,feature_name) %>%
    summarise(n_gt=n()) %>%
    filter(n_gt>=10) %>%
    select(feature_name) %>%
    inner_join(go_df)

  go_dfl <- nest(go_df,data=Gene) %>% mutate(isa=NA)
  cancer_dfl <- nest(min_cancer_df,fdr_data=c(Gene,FDR)) %>% mutate(isa=NA)

  fisher_inp <- inner_join(go_dfl,cancer_dfl,by="isa") %>% select(-isa) %>% mutate(ix=1:n())  %>% filter(cancer!="CHOL")
  with_progress({
    p <- progressor(along = fisher_inp$ix)
    fisher_df <- future_pmap_dfr(fisher_inp,function(cancer,feature_name,fdr_data,data,ix){
      p(sprintf("x=%g",ix))


      sig_gene <- fdr_data$FDR<0.2
      sig_feat <- fdr_data$Gene %in% data$Gene
ret_2 <- dplyr::mutate(broom::tidy(fisher.test(sig_gene,sig_feat)),feature_name=feature_name,cancer=cancer,cutoff=0.2)

      sig_gene <- fdr_data$FDR<0.1

ret_1 <- dplyr::mutate(broom::tidy(fisher.test(sig_gene,sig_feat)),feature_name=feature_name,cancer=cancer,cutoff=0.1)
      sig_gene <- fdr_data$FDR<0.05
ret_05 <- dplyr::mutate(broom::tidy(fisher.test(sig_gene,sig_feat)),feature_name=feature_name,cancer=cancer,cutoff=0.05)
      sig_gene <- fdr_data$FDR<0.01
ret_01 <- dplyr::mutate(broom::tidy(fisher.test(sig_gene,sig_feat)),feature_name=feature_name,cancer=cancer,cutoff=0.01)
return(bind_rows(ret_2,ret_1,ret_05,ret_01))
})
  })

  qs::qsave(fisher_df,"data/cleanest_single_fisher_cutoffs.qs")
#+END_SRC

#+RESULTS:

**** Fitting univariate models

     

#+BEGIN_SRC R :session univ :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
library(tidyverse)
library(fgem)
library(progressr)
library(stringr)
cancer_df <- qs::qread("data/cleanest_driverMAPS_results_20TumorTypes.qs")
#+END_SRC

#+BEGIN_SRC R :session remote_univ  :dir /ssh:rcc2|ssh:gardner:/home/t.cri.nknoblauch/data/
  library(future.batchtools)
   plan(list(
          tweak(batchtools_torque,
                template  = "/home/t.cri.nknoblauch/torque_batchtools.tmpl",
                resources = list(ncpus=10,mem=29000L,walltime=3600L*3)),multiprocess))
    #  plan(list(
    #    tweak(batchtools_slurm,
    #          template  = "/home/nwknoblauch/slurm_batchtools.tmpl",
    #          resources = list(ncpus=8,mem=19000L,walltime=3600L)),multiprocess))

#+END_SRC

#+BEGIN_SRC R :session univ :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :var cancerlist=cancerlist

  library(fgem)
  library(progressr)
  library(furrr)
  library(qs)
  cancerf <- dplyr::pull(cancerlist,cancer)
  plan(list(multisession))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session univ :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :var cancerlist=cancerlist


#+END_SRC

#+RESULTS:



#+BEGIN_SRC R :session univ :dir /home/nwknoblauch/Dropbox/Repos/dissertation/
  BPGOdf <- qs::qread("data/GO_df.qs")
  nidf <-   nest(cancer_df,cdf=-cancer) %>% mutate(ix=1:n()) %>% 
  filter(cancer %in% cancerf)
  go_df <- mutate(BPGOdf,Gene=as.character(Gene)) %>%
    semi_join(distinct(cancer_df,Gene))

  go_df <- group_by(go_df,feature_name) %>%
    summarise(n_gt=n()) %>%
    filter(n_gt>=10) %>%
    select(feature_name) %>%
    inner_join(go_df)
  go_df <- mutate(go_df,value=1.0)
 
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session univ :dir /home/nwknoblauch/Dropbox/Repos/dissertation/
      fs::dir_create("data/fgem_cm_results/")
      fs::dir_create("data/fgem_cm_results_OG/")
      fs::dir_create("data/fgem_cm_results_TSG/")
      


  marg_fun <- function(cancer,cdf,ix){


        X <- fgem::trip2sparseMatrix(rowname_vals = as.character(go_df$Gene),
                                     colname_vals = go_df$feature_name,
                                     values = go_df$value,
                                     total_rownames = cdf$Gene,
                                     total_colnames = unique(go_df$feature_name),
                                     add_intercept = FALSE)



        fgmr_a <- dplyr::mutate(fgem:::fgem_marginal(X,cdf$BF,log_BF=TRUE,parallel=FALSE,grad=TRUE,hess=TRUE),cancer=cancer,cat="overall")
        qs::qsave(fgmr_a,fs::path("data/fgem_m_results/",cancer,ext="qs"))
        p(sprintf("x=%g",ix))
        return(fgmr_a)
        ## fgmr_og <- dplyr::mutate(fgem:::fgem_marginal(X,cdf$OG_BF,log_BF=TRUE,parallel=FALSE,grad=TRUE,hess=TRUE),cancer=cancer,cat="OG")
        ## qs::qsave(fgmr_og,fs::path("data/fgem_m_results_OG/",cancer,ext="qs"))

        ## fgmr_tsg <- dplyr::mutate(fgem:::fgem_marginal(X,cdf$TSG_BF,log_BF=TRUE,parallel=FALSE,grad=TRUE,hess=TRUE),cancer=cancer,cat="TSG")
        ## qs::qsave(fgmr_tsg,fs::path("data/fgem_m_results_TSG/",cancer,ext="qs"))
  #      return(dplyr::bind_rows(fgmr_a,fgmr_og,fgmr_tsg))
        }
    with_progress({
      p <- progressor(along = seq_len(nrow(nidf)))
      nidf %>% furrr::future_pmap_dfr(marg_fun) %>% 
      qs::qsave("data/alt_newest_fgem_marginal_results.qs")
    })


#+END_SRC

#+RESULTS:


**** Analyzing univariate models

