docs/fgem.html

<li><a id="orgf372ec1"></a>Fitting  Fisher's Exact test<br>
<div class="outline-text-5" id="text-orgf372ec1">
<div class="org-src-container">
<pre class="src src-R">  <span style="color: #C04040;">library</span>(tidyverse)
  <span style="color: #C04040;">library</span>(fgem)
  <span style="color: #C04040;">library</span>(progressr)
  <span style="color: #C04040;">library</span>(furrr)
  <span style="color: #C04040;">library</span>(qs)
  plan(multisession)

  cancer_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>) 
  BPGOdf <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/GO_df.qs"</span>)
  min_cancer_df <span style="color: #C04040;">&lt;-</span> cancer_df <span style="color: #C04040;">%&gt;%</span>
  select(Gene, FDR, cancer)

  go_df <span style="color: #C04040;">&lt;-</span> mutate(BPGOdf,Gene=as.character(Gene)) <span style="color: #C04040;">%&gt;%</span>
  semi_join(distinct(cancer_df,Gene))

  go_df <span style="color: #C04040;">&lt;-</span> group_by(go_df,feature_name) <span style="color: #C04040;">%&gt;%</span>
    summarise(n_gt=n()) <span style="color: #C04040;">%&gt;%</span>
    filter(n_gt&gt;=10) <span style="color: #C04040;">%&gt;%</span>
    select(feature_name) <span style="color: #C04040;">%&gt;%</span>
    inner_join(go_df)

  go_dfl <span style="color: #C04040;">&lt;-</span> nest(go_df,data=Gene) <span style="color: #C04040;">%&gt;%</span> mutate(isa=<span style="color: #99D6FF;">NA</span>)
  cancer_dfl <span style="color: #C04040;">&lt;-</span> nest(min_cancer_df,fdr_data=c(Gene,FDR)) <span style="color: #C04040;">%&gt;%</span> mutate(isa=<span style="color: #99D6FF;">NA</span>)

  fisher_inp <span style="color: #C04040;">&lt;-</span> inner_join(go_dfl,cancer_dfl,by=<span style="color: #FFABAB;">"isa"</span>) <span style="color: #C04040;">%&gt;%</span> select(-isa) <span style="color: #C04040;">%&gt;%</span> mutate(ix=1:n())  <span style="color: #C04040;">%&gt;%</span> filter(cancer!=<span style="color: #FFABAB;">"CHOL"</span>)
  with_progress({
    p <span style="color: #C04040;">&lt;-</span> progressor(along = fisher_inp$ix)
    fisher_df <span style="color: #C04040;">&lt;-</span> future_pmap_dfr(fisher_inp,<span style="color: #C8FF03;">function</span>(cancer,feature_name,fdr_data,data,ix){
      p(sprintf(<span style="color: #FFABAB;">"x=%g"</span>,ix))


      sig_gene <span style="color: #C04040;">&lt;-</span> fdr_data$FDR&lt;0.2
      sig_feat <span style="color: #C04040;">&lt;-</span> fdr_data$Gene <span style="color: #C04040;">%in%</span> data$Gene
ret_2 <span style="color: #C04040;">&lt;-</span> dplyr::mutate(broom::tidy(fisher.test(sig_gene,sig_feat)),feature_name=feature_name,cancer=cancer,cutoff=0.2)

      sig_gene <span style="color: #C04040;">&lt;-</span> fdr_data$FDR&lt;0.1

ret_1 <span style="color: #C04040;">&lt;-</span> dplyr::mutate(broom::tidy(fisher.test(sig_gene,sig_feat)),feature_name=feature_name,cancer=cancer,cutoff=0.1)
      sig_gene <span style="color: #C04040;">&lt;-</span> fdr_data$FDR&lt;0.05
ret_05 <span style="color: #C04040;">&lt;-</span> dplyr::mutate(broom::tidy(fisher.test(sig_gene,sig_feat)),feature_name=feature_name,cancer=cancer,cutoff=0.05)
      sig_gene <span style="color: #C04040;">&lt;-</span> fdr_data$FDR&lt;0.01
ret_01 <span style="color: #C04040;">&lt;-</span> dplyr::mutate(broom::tidy(fisher.test(sig_gene,sig_feat)),feature_name=feature_name,cancer=cancer,cutoff=0.01)
<span style="color: #C8FF03;">return</span>(bind_rows(ret_2,ret_1,ret_05,ret_01))
})
  })

  qs::qsave(fisher_df,<span style="color: #FFABAB;">"data/cleanest_single_fisher_cutoffs.qs"</span>)
</pre>
</div>
</div>
</li>

<li><a id="org3aa3677"></a>Fitting univariate models<br>
<div class="outline-text-5" id="text-org3aa3677">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(tidyverse)
<span style="color: #C04040;">library</span>(fgem)
<span style="color: #C04040;">library</span>(progressr)
<span style="color: #C04040;">library</span>(stringr)
cancer_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(future.batchtools)
 plan(list(
        tweak(batchtools_torque,
              template  = <span style="color: #FFABAB;">"/home/t.cri.nknoblauch/torque_batchtools.tmpl"</span>,
              resources = list(ncpus=10,mem=29000L,walltime=3600L*3)),multiprocess))
  <span style="color: #5D6A70;">#  </span><span style="color: #5D6A70;">plan(list(</span>
  <span style="color: #5D6A70;">#    </span><span style="color: #5D6A70;">tweak(batchtools_slurm,</span>
  <span style="color: #5D6A70;">#          </span><span style="color: #5D6A70;">template  = "/home/nwknoblauch/slurm_batchtools.tmpl",</span>
  <span style="color: #5D6A70;">#          </span><span style="color: #5D6A70;">resources = list(ncpus=8,mem=19000L,walltime=3600L)),multiprocess))</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
<span style="color: #C04040;">library</span>(fgem)
<span style="color: #C04040;">library</span>(progressr)
<span style="color: #C04040;">library</span>(furrr)
<span style="color: #C04040;">library</span>(qs)
cancerf <span style="color: #C04040;">&lt;-</span> dplyr::pull(cancerlist,cancer)
plan(list(multisession))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">BPGOdf <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/GO_df.qs"</span>)
nidf <span style="color: #C04040;">&lt;-</span>   nest(cancer_df,cdf=-cancer) <span style="color: #C04040;">%&gt;%</span> mutate(ix=1:n()) <span style="color: #C04040;">%&gt;%</span> 
filter(cancer <span style="color: #C04040;">%in%</span> cancerf)
go_df <span style="color: #C04040;">&lt;-</span> mutate(BPGOdf,Gene=as.character(Gene)) <span style="color: #C04040;">%&gt;%</span>
  semi_join(distinct(cancer_df,Gene))

go_df <span style="color: #C04040;">&lt;-</span> group_by(go_df,feature_name) <span style="color: #C04040;">%&gt;%</span>
  summarise(n_gt=n()) <span style="color: #C04040;">%&gt;%</span>
  filter(n_gt&gt;=10) <span style="color: #C04040;">%&gt;%</span>
  select(feature_name) <span style="color: #C04040;">%&gt;%</span>
  inner_join(go_df)
go_df <span style="color: #C04040;">&lt;-</span> mutate(go_df,value=1.0)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">    fs::dir_create(<span style="color: #FFABAB;">"data/fgem_cm_results/"</span>)
    fs::dir_create(<span style="color: #FFABAB;">"data/fgem_cm_results_OG/"</span>)
    fs::dir_create(<span style="color: #FFABAB;">"data/fgem_cm_results_TSG/"</span>)



<span style="color: #FFE203;">marg_fun</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(cancer,cdf,ix){


      X <span style="color: #C04040;">&lt;-</span> fgem::trip2sparseMatrix(rowname_vals = as.character(go_df$Gene),
                                   colname_vals = go_df$feature_name,
                                   values = go_df$value,
                                   total_rownames = cdf$Gene,
                                   total_colnames = unique(go_df$feature_name),
                                   add_intercept = <span style="color: #99D6FF;">FALSE</span>)



      fgmr_a <span style="color: #C04040;">&lt;-</span> dplyr::mutate(fgem:::fgem_marginal(X,cdf$BF,log_BF=<span style="color: #99D6FF;">TRUE</span>,parallel=<span style="color: #99D6FF;">FALSE</span>,grad=<span style="color: #99D6FF;">TRUE</span>,hess=<span style="color: #99D6FF;">TRUE</span>),cancer=cancer,cat=<span style="color: #FFABAB;">"overall"</span>)
      qs::qsave(fgmr_a,fs::path(<span style="color: #FFABAB;">"data/fgem_m_results/"</span>,cancer,ext=<span style="color: #FFABAB;">"qs"</span>))
      p(sprintf(<span style="color: #FFABAB;">"x=%g"</span>,ix))
      <span style="color: #C8FF03;">return</span>(fgmr_a)
      <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">fgmr_og &lt;- dplyr::mutate(fgem:::fgem_marginal(X,cdf$OG_BF,log_BF=TRUE,parallel=FALSE,grad=TRUE,hess=TRUE),cancer=cancer,cat="OG")</span>
      <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">qs::qsave(fgmr_og,fs::path("data/fgem_m_results_OG/",cancer,ext="qs"))</span>

      <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">fgmr_tsg &lt;- dplyr::mutate(fgem:::fgem_marginal(X,cdf$TSG_BF,log_BF=TRUE,parallel=FALSE,grad=TRUE,hess=TRUE),cancer=cancer,cat="TSG")</span>
      <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">qs::qsave(fgmr_tsg,fs::path("data/fgem_m_results_TSG/",cancer,ext="qs"))</span>
<span style="color: #5D6A70;">#      </span><span style="color: #5D6A70;">return(dplyr::bind_rows(fgmr_a,fgmr_og,fgmr_tsg))</span>
      }
  with_progress({
    p <span style="color: #C04040;">&lt;-</span> progressor(along = seq_len(nrow(nidf)))
    nidf <span style="color: #C04040;">%&gt;%</span> furrr::future_pmap_dfr(marg_fun) <span style="color: #C04040;">%&gt;%</span> 
    qs::qsave(<span style="color: #FFABAB;">"data/alt_newest_fgem_marginal_results.qs"</span>)
  })


</pre>
</div>
</div>
</li>


<li><a id="org017eddb"></a>Analyzing univariate models<br>
<ul class="org-ul">
