org/fgem.org
***** GO


#+BEGIN_SRC R :session jacc  :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :var cancerlist=cancerlist
  library(fgem)
  library(dplyr)
  library(tidyr)
  library(purrr)
  library(Matrix)
  library(ggplot2)
  cancer_df <- qs::qread("data/cleanest_driverMAPS_results_20TumorTypes.qs")   %>% semi_join(cancerlist)
  cancer_null <-  group_by(cancer_df,cancer) %>% summarise(null_lik=fgem:::fgem_null_lik(BF,log_BF=TRUE),Intercept=fgem:::fgem_null(BF,log_BF=TRUE))
#+END_SRC


#+BEGIN_SRC R :session jacc  :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  fgem_df <- qs::qread("data/alt_newest_fgem_marginal_results.qs") %>%
    group_by(cancer) %>%
    mutate(qval = p.adjust(dplyr::if_else(convergence == 0, pval, 1), method = "fdr")) %>%
    ungroup() %>%
    mutate(hess_det=map_dbl(Beta,~det(.x$hessian)))


  sig_feat_df <- filter(fgem_df, qval < 0.2)
  sig_feat_df <- mutate(sig_feat_df,
                        term = map_chr(Beta,~.x$feature_name[2]),
                        Beta = map(Beta, ~mutate(.x, fisher = solve(hessian)))) %>%
    unnest(Beta)  %>%
    select(Beta, feature_name, fisher, hess_det, term, pval, qval, cancer) 


  curv_df <- sig_feat_df %>%
    group_by(term,cancer) %>%
    summarise(sd_intercept = fisher[1,1],
              sd_beta = fisher[2,2],
              Intercept = Beta[1],
              Beta = Beta[2],
              hess_det = hess_det[1],
              pval = pval[1],
              qval = qval[1]) %>%
    mutate(l_beta = qnorm(0.01, mean = Beta, sd = sqrt(sd_beta)),
           h_beta = qnorm(0.99, mean = Beta, sd = sqrt(sd_beta))) %>%
    ungroup()

  nsig_df <- filter(curv_df, sign(l_beta)==sign(Beta)) %>%
    mutate(gene_prior = plogis(Beta + Intercept)) %>%
    arrange(desc(gene_prior))


    GO_def <- readRDS("data/GO_Definitions.RDS") %>% select(feature_name,Term)
  high_prior_features <- filter(nsig_df,gene_prior>0.4) %>% arrange(Beta) %>% rename(feature_name=term)

  qs::qsave(high_prior_features,"data/high_prior_features.qs")


  low_prior_sig_features <- filter(nsig_df,gene_prior<=0.4) 
  notsig_df <- filter(curv_df, l_beta < 0) %>%
    arrange(desc(Beta))

#+END_SRC



#+BEGIN_SRC R :session jacc  :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

  ody <- fs::path("data/new_conservative_y_models")
  fs::dir_create(ody)
  odx <- fs::path("data/new_conservative_x_models")

  go_df <- select(BPGOdf, Gene, feature_name = feature) %>% 
    mutate(Gene=as.character(Gene))
  genelist_go <- nest(go_df, gene_l = Gene) %>% 
    mutate(gene_l = map(gene_l, "Gene"))  %>%
    inner_join(select(low_prior_sig_features, feature_name= term, cancer))
  cancer_df <- qs::qread("data/cleanest_driverMAPS_results_20TumorTypes.qs") %>%
    select(Gene, BF, cancer)

  cancer_genes <- cancer_df %>% select(Gene,cancer) %>%
    nest(cancer_genes=Gene) %>% mutate(cancer_genes=map(cancer_genes,"Gene"))

  go_list_dfl <- genelist_go %>% 
    inner_join(cancer_genes,by="cancer") %>%
    mutate(gene_l = map2(gene_l, cancer_genes, ~factor(.x[.x %in% .y], levels = .y)),
                         n_genes = lengths(gene_l)) %>%
    select(-cancer_genes)

  x_mats <- split(go_list_dfl,go_list_dfl$cancer) %>% purrr::map(function(x){
    tdf <- unnest(x,gene_l)
    trip2sparseMatrix(as.character(tdf$gene_l),tdf$feature_name,total_rownames=levels(tdf$gene_l),add_intercept=FALSE)
  })
  x_mats <- x_mats[order(map_int(x_mats,NCOL))]
  yl <- split(cancer_df,cancer_df$cancer)
  yl <- yl[names(x_mats)]


  fs::dir_create(odx)
  iwalk(x_mats,function(x,y){
  qs::qsave(x,fs::path(odx,y,ext="qs"))
  })
  iwalk(yl,function(x,y){
  qs::qsave(x,fs::path(ody,y,ext="qs"))
  })
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session jacc  :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
rsync::rsynccli(odx,"gardner2:xm/data")
rsync::rsynccli(ody,"gardner2:xm/data")
#+END_SRC

#+RESULTS:
| x |
|---|
| 0 |





***** GO Only


