docs/fgem.html
<li><a id="orgc9d82e8"></a>GO<br>
<div class="outline-text-6" id="text-orgc9d82e8">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(fgem)
<span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(tidyr)
<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(Matrix)
<span style="color: #C04040;">library</span>(ggplot2)
cancer_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>)   <span style="color: #C04040;">%&gt;%</span> semi_join(cancerlist)
cancer_null <span style="color: #C04040;">&lt;-</span>  group_by(cancer_df,cancer) <span style="color: #C04040;">%&gt;%</span> summarise(null_lik=fgem:::fgem_null_lik(BF,log_BF=<span style="color: #99D6FF;">TRUE</span>),Intercept=fgem:::fgem_null(BF,log_BF=<span style="color: #99D6FF;">TRUE</span>))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-R">fgem_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/alt_newest_fgem_marginal_results.qs"</span>) <span style="color: #C04040;">%&gt;%</span>
  group_by(cancer) <span style="color: #C04040;">%&gt;%</span>
  mutate(qval = p.adjust(dplyr::if_else(convergence == 0, pval, 1), method = <span style="color: #FFABAB;">"fdr"</span>)) <span style="color: #C04040;">%&gt;%</span>
  ungroup() <span style="color: #C04040;">%&gt;%</span>
  mutate(hess_det=map_dbl(Beta,~det(.x$hessian)))


sig_feat_df <span style="color: #C04040;">&lt;-</span> filter(fgem_df, qval &lt; 0.2)
sig_feat_df <span style="color: #C04040;">&lt;-</span> mutate(sig_feat_df,
                      term = map_chr(Beta,~.x$feature_name[2]),
                      Beta = map(Beta, ~mutate(.x, fisher = solve(hessian)))) <span style="color: #C04040;">%&gt;%</span>
  unnest(Beta)  <span style="color: #C04040;">%&gt;%</span>
  select(Beta, feature_name, fisher, hess_det, term, pval, qval, cancer) 


curv_df <span style="color: #C04040;">&lt;-</span> sig_feat_df <span style="color: #C04040;">%&gt;%</span>
  group_by(term,cancer) <span style="color: #C04040;">%&gt;%</span>
  summarise(sd_intercept = fisher[1,1],
            sd_beta = fisher[2,2],
            Intercept = Beta[1],
            Beta = Beta[2],
            hess_det = hess_det[1],
            pval = pval[1],
            qval = qval[1]) <span style="color: #C04040;">%&gt;%</span>
  mutate(l_beta = qnorm(0.01, mean = Beta, sd = sqrt(sd_beta)),
         h_beta = qnorm(0.99, mean = Beta, sd = sqrt(sd_beta))) <span style="color: #C04040;">%&gt;%</span>
  ungroup()

nsig_df <span style="color: #C04040;">&lt;-</span> filter(curv_df, sign(l_beta)==sign(Beta)) <span style="color: #C04040;">%&gt;%</span>
  mutate(gene_prior = plogis(Beta + Intercept)) <span style="color: #C04040;">%&gt;%</span>
  arrange(desc(gene_prior))


  GO_def <span style="color: #C04040;">&lt;-</span> readRDS(<span style="color: #FFABAB;">"data/GO_Definitions.RDS"</span>) <span style="color: #C04040;">%&gt;%</span> select(feature_name,Term)
high_prior_features <span style="color: #C04040;">&lt;-</span> filter(nsig_df,gene_prior&gt;0.4) <span style="color: #C04040;">%&gt;%</span> arrange(Beta) <span style="color: #C04040;">%&gt;%</span> rename(feature_name=term)

qs::qsave(high_prior_features,<span style="color: #FFABAB;">"data/high_prior_features.qs"</span>)


low_prior_sig_features <span style="color: #C04040;">&lt;-</span> filter(nsig_df,gene_prior&lt;=0.4) 
notsig_df <span style="color: #C04040;">&lt;-</span> filter(curv_df, l_beta &lt; 0) <span style="color: #C04040;">%&gt;%</span>
  arrange(desc(Beta))

</pre>
</div>



<div class="org-src-container">
<pre class="src src-R">
ody <span style="color: #C04040;">&lt;-</span> fs::path(<span style="color: #FFABAB;">"data/new_conservative_y_models"</span>)
fs::dir_create(ody)
odx <span style="color: #C04040;">&lt;-</span> fs::path(<span style="color: #FFABAB;">"data/new_conservative_x_models"</span>)

go_df <span style="color: #C04040;">&lt;-</span> select(BPGOdf, Gene, feature_name = feature) <span style="color: #C04040;">%&gt;%</span> 
  mutate(Gene=as.character(Gene))
genelist_go <span style="color: #C04040;">&lt;-</span> nest(go_df, gene_l = Gene) <span style="color: #C04040;">%&gt;%</span> 
  mutate(gene_l = map(gene_l, <span style="color: #FFABAB;">"Gene"</span>))  <span style="color: #C04040;">%&gt;%</span>
  inner_join(select(low_prior_sig_features, feature_name= term, cancer))
cancer_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>) <span style="color: #C04040;">%&gt;%</span>
  select(Gene, BF, cancer)

cancer_genes <span style="color: #C04040;">&lt;-</span> cancer_df <span style="color: #C04040;">%&gt;%</span> select(Gene,cancer) <span style="color: #C04040;">%&gt;%</span>
  nest(cancer_genes=Gene) <span style="color: #C04040;">%&gt;%</span> mutate(cancer_genes=map(cancer_genes,<span style="color: #FFABAB;">"Gene"</span>))

go_list_dfl <span style="color: #C04040;">&lt;-</span> genelist_go <span style="color: #C04040;">%&gt;%</span> 
  inner_join(cancer_genes,by=<span style="color: #FFABAB;">"cancer"</span>) <span style="color: #C04040;">%&gt;%</span>
  mutate(gene_l = map2(gene_l, cancer_genes, ~factor(.x[.x <span style="color: #C04040;">%in%</span> .y], levels = .y)),
                       n_genes = lengths(gene_l)) <span style="color: #C04040;">%&gt;%</span>
  select(-cancer_genes)

x_mats <span style="color: #C04040;">&lt;-</span> split(go_list_dfl,go_list_dfl$cancer) <span style="color: #C04040;">%&gt;%</span> purrr::map(<span style="color: #C8FF03;">function</span>(x){
  tdf <span style="color: #C04040;">&lt;-</span> unnest(x,gene_l)
  trip2sparseMatrix(as.character(tdf$gene_l),tdf$feature_name,total_rownames=levels(tdf$gene_l),add_intercept=<span style="color: #99D6FF;">FALSE</span>)
})
x_mats <span style="color: #C04040;">&lt;-</span> x_mats[order(map_int(x_mats,NCOL))]
yl <span style="color: #C04040;">&lt;-</span> split(cancer_df,cancer_df$cancer)
yl <span style="color: #C04040;">&lt;-</span> yl[names(x_mats)]


fs::dir_create(odx)
iwalk(x_mats,<span style="color: #C8FF03;">function</span>(x,y){
qs::qsave(x,fs::path(odx,y,ext=<span style="color: #FFABAB;">"qs"</span>))
})
iwalk(yl,<span style="color: #C8FF03;">function</span>(x,y){
qs::qsave(x,fs::path(ody,y,ext=<span style="color: #FFABAB;">"qs"</span>))
})
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">rsync::rsynccli(odx,<span style="color: #FFABAB;">"gardner2:xm/data"</span>)
rsync::rsynccli(ody,<span style="color: #FFABAB;">"gardner2:xm/data"</span>)
</pre>
</div>

<table>


<colgroup>
<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">x</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
</tr>
</tbody>
</table>
</div>
</li>
