org/fgem.org
**** Comparing univariate models to Fisher's Exact results

#+BEGIN_SRC R :session jacc :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

    library(dplyr)
    library(purrr)
    library(fgem)
    library(ggplot2)
    library(tidyr)

    cancer_df <- qs::qread("data/cleanest_driverMAPS_results_20TumorTypes.qs")
    bp_name <- readRDS("data/GO_Definitions.RDS") 
    cancer_df <- qs::qread("data/cleanest_driverMAPS_results_20TumorTypes.qs")   %>% semi_join(cancerlist)
    cancer_null <-  group_by(cancer_df,cancer) %>% summarise(null_lik=fgem:::fgem_null_lik(BF,log_BF=TRUE),Intercept=fgem:::fgem_null(BF,log_BF=TRUE))
#+END_SRC

#+RESULTS:




#+BEGIN_SRC R :session jacc :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

  fgem_results <- qs::qread("data/alt_newest_fgem_marginal_results.qs") %>%
    group_by(cancer) %>%
    mutate(qval = p.adjust(dplyr::if_else(convergence == 0, pval, 1), method = "fdr")) %>%
    select(Beta,pval,qval,cancer)
    ## ungroup() %>%
    ## mutate(hess_det=map_dbl(Beta,~det(.x$hessian)))



    ## fgem_results <- map_df(fs::dir_ls("data/fgem_m_results"), qs::qread) %>%


    ##     inner_join(select(cancer_null,-Intercept)) %>%
    ##     mutate(pval=stats::pchisq(-2 * (null_lik - (lik)), df=1, lower.tail=F)) %>%
    ##     group_by(cancer) %>%
    ##   mutate(qval = p.adjust(dplyr::if_else(convergence == 0, pval, 1), method = "fdr")) %>%
    ##   select(Beta,pval,qval,cancer)


    fgem_results_df <- fgem_results %>%
      mutate(Beta=map(Beta,~dplyr::select(.x,Beta,feature_name))) %>%
      ungroup() %>% 
      mutate(tid = 1:n()) %>%
      unnest(Beta) %>%
      group_by(tid) %>%
      mutate(trait=feature_name[feature_name!="Intercept"]) %>%
      ungroup() %>% 
      mutate(feature_name = dplyr::if_else(feature_name == "Intercept", "Intercept", "estimate_fgem")) %>%
      spread(key = "feature_name", value = "Beta") %>%
      select(feature_name=trait,pval_fgem = pval, qval_fgem = qval,cancer,estimate_fgem,Intercept)
  

    fisher_df <- qs::qread("data/cleanest_single_fisher_cutoffs.qs") %>%
        dplyr::select(cancer,
                      feature_name,
                      pval = p.value,cutoff) %>%
      mutate(cutoff=paste0("pval_fisher_",stringr::str_replace(cutoff,"\\.","_")))%>% spread(key="cutoff",value="pval")

    single_df <- inner_join(fisher_df, fgem_results_df, by = c("cancer", "feature_name"))
    qs::qsave(single_df,"data/single_df.qs")
#+END_SRC

#+BEGIN_SRC R :session jacc :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  library(forcats)
  library(ggsci)
  library(tidyverse)

  go_df <- select(BPGOdf, Gene, feature_name = feature) %>% 
    mutate(Gene=as.character(Gene))

  intogen_df <- qs::qread("data/intogen_df.qs") %>%
    unnest(intogen_l) %>% mutate(is_intogen=TRUE)

  single_df <-     qs::qread("data/single_df.qs")
  GO_def <- readRDS("data/GO_Definitions.RDS") %>%
        select(feature_name,description=Term)
  sdf <- select(single_df,
                -qval_fgem,
                -estimate_fgem,
                -Intercept) %>%
    gather(key = "method",
           value = "pval",
           -cancer,
           -feature_name) %>%
    mutate(method = stringr::str_remove(method, "pval_"),
           is_fisher = dplyr::if_else(stringr::str_starts(method, "fisher"),
                                      "fisher",
                                      "fgem")) %>%
    group_by(cancer, method) %>%
    mutate(qval = p.adjust(pval, method = "fdr")) %>%
    ungroup() %>%
    filter((is_fisher == "fisher" & (method == "fisher_0_1")) | is_fisher == "fgem")


  weird_fishers <- select(single_df,cancer,feature_name,fisher=pval_fisher_0_05,fgem=qval_fgem) %>% group_by(cancer) %>% mutate(fisher=p.adjust(fisher,method="fdr")) %>% ungroup() %>% filter(fisher<0.05) %>% arrange(desc(fgem)) %>% head() %>% inner_join(GO_def)

  weird_fgem <- select(single_df,cancer,feature_name,fisher=pval_fisher_0_05,fgem=qval_fgem) %>%
    group_by(cancer) %>%
    mutate(fisher=p.adjust(fisher,method="fdr")) %>%
    ungroup() %>%
    filter(fgem<0.05) %>%
    arrange(desc(fisher)) %>%
    inner_join(GO_def)

  wf_fisher <- slice(weird_fishers,2)
  wf_fgem <- filter(weird_fgem, fisher<1) %>%
    slice(2)
  gsea_df <- qs::qread("data/gsea.qs")
  single_gsea_df <- inner_join(gsea_df, single_df)

  gene_sets <- split(go_df$Gene,go_df$feature_name)

  ## tcancer <- filter(cancer_df,cancer==cancer[1])

  ## library(furrr)
  ## library(progressr)

  ## interruptor = function(FUN,args, time.limit, ALTFUN){
  ##   results <- NULL
  ##   results <- evalWithTimeout({FUN(args)},timeout=time.limit,onTimeout="silent")
  ##   if(is.null(results)){
  ##     results <- ALTFUN(args)
  ##   }
  ##   return(results)
  ## }
  ## plan(multiprocess)
  ## sub_fun <- function(cancer,data){
  ##     cancer_rank <- set_names(data$BF,data$Gene)
  ##     fgr <- fgsea::fgsea(gene_sets,cancer_rank,nproc=1)
  ##     progress(amount=1)
  ## as_tibble(fgr) %>% select(feature_name=pathway,pval_gsea=pval,qval_gsea=padj,gsea_estimate=ES) %>% mutate(cancer=cancer)
  ##   }

  #cdfl <- nest(cancer_df,data=-cancer)
  ## with_progress({
  ##   progress <- progressor(steps=nrow(cdfl))
  ##   fgr_f  <- pmap(cdfl,function(cancer,data){
  ##     future(sub_fun(cancer,data))
  ##   })
  ## })

  ## fgr_f <- fgr_f[map_lgl(fgr_f,resolved)]
  ## fgr_df <- map_df(fgr_f,value)
  ## qs::qsave(fgr_df,"data/gsea.qs")

  ## cdfl_l <- pmap(cdfl, function(cancer, data) {
  ##   set_names(data$BF, data$Gene)
  ## })

  ## cdfl_l <- set_names(cdfl_l,cdfl$cancer)

  generate_dist_plot <- function(wf,nc=1){
    plotdf <- left_join(
      semi_join(cancer_df, wf),
      (left_join(wf, go_df))) %>%
      arrange(BF) %>%
      mutate(feature = if_else(is.na(feature_name), "Background", feature_name),
             is_sig_gene = if_else(FDR<0.05, "FDR<0.05", "FDR>=0.05"),
             idx = 1:n(),
             category = factor(interaction(feature,is_sig_gene)),
             sig_cat=gl(nc,ceiling(n()/nc),n())) %>%
      mutate(is_sig_gene = fct_reorder(factor(is_sig_gene),BF),
             category = fct_reorder2(category,feature!="Background",-BF),
             feature=factor(feature))
    isp_df <- filter(plotdf, feature != "Background") #%>% mutate(sh=124)
  
    plt <- plotdf %>%
      ggplot(aes(x=idx, y=BF, col=category, size=feature)) + geom_point() +
      xlab("Index") +
      ylab("LBF") +
      ggtitle(glue::glue_data(wf,"{cancer} {feature_name}: {description}"),
              glue::glue_data(wf,"fisher q-value: {fisher}\nFGEM q-value: {fgem}")) +
      scale_size_manual(values=c(1,2)) +
      geom_point(data=isp_df,aes(x=idx,y=BF),shape=124,size=9)+scale_color_uchicago()
    if(nc>1)
      plt <- plt+facet_wrap(~sig_cat,scales="free",nrow=1)
    return(plt)
  }

  swfg <- semi_join(single_df,wf_fgem) %>% as.data.frame()
  new_prior <- rep(stats::plogis(swfg$Intercept+swfg$estimate_fgem,log.p=TRUE),nrow(plotdf))

  trng <- range(plotdf$BF)
  rangesq <- seq(trng[1],trng[2],length.out=nrow(plotdf))
  all_with_model <- mutate(plotdf,
                           post_feature = c(fgem::BF2posterior(BF, Gene, new_prior, log_BF = TRUE)),
                           post_nf = c(fgem::BF2posterior(BF, Gene, fgem:::predict_uniform_prior(BF, log_BF = TRUE), log_BF = TRUE))) %>%
    select(Gene, BF, functional=post_feature,uniform=post_nf,idx,is_sig_gene,feature) %>%
    gather("model","posterior",functional,uniform)
  awm <- filter(all_with_model,feature!="Background")
  ggplot(all_with_model,aes(x=idx,y=posterior,col=model))+geom_point()+geom_point(data=awm,aes(x=idx,y=posterior,col=model),shape=124,size=9)

  plot_fisher <- generate_dist_plot(wf_fisher,3)
  plot_fgem <- generate_dist_plot(wf_fgem,5)


  sdf_sig <- group_by(sdf, cancer, feature_name, method) %>%
    summarise(sig = all(qval < 0.05)) %>%
    spread(key = method, value = sig) %>%
    ungroup() %>%
    rename(fisher = fisher_0_1) %>%
    filter(fgem | fisher) %>%
    inner_join(GO_def)

  sdf_b  <- select(sdf, -is_fisher, -qval)
  sdfc <-  sdf %>%
    summarise(proportion_significant=mean(qval<0.05)) %>%
    ungroup()


  group_by(sdf_sig,feature_name,method) %>%
    summarise(p_shared=mean(sig),n=n()) %>%
    arrange(desc(p_shared)) %>%
    group_by(method) %>%
    summarise(p_share=sum(p_shared>0),n=n())
    ggplot(aes(x=method,y=p_shared,fill=method)) + geom_boxplot()+scale_y_log10()

  cancer_it <- left_join(cancer_df,intogen_df) %>%
    replace_na(list(is_TCGA=FALSE,is_intogen=FALSE))
  sovdf <- inner_join(filter(sdf_sig,sig),go_df) %>% inner_join(cancer_it)
  ## fgem_not_fisher <- filter(sdf_sig,fgem,!fisher) %>%
  ##   inner_join(go_df) %>%
  ##   left_join(cancer_it)
  ## fisher_not_fgem <- filter(sdf_sig,!fgem,fisher) %>% inner_join(go_df) %>% left_join(cancer_it)
  sovdf <- group_by(ovdf,cancer,feature_name) %>% filter(sum(sig)<2) %>% ungroup() 

  group_by(sovdf,cancer,feature_name,method) %>%
    summarise(p_intogen=mean(is_intogen),
              p_tcga=mean(is_TCGA),
              p_external=mean((is_intogen & !is_TCGA)),
              mean_LBF=mean(BF)) %>% mutate(cancer = fct_reorder(cancer, -mean_LBF)) %>% 
    ggplot(aes(x=cancer,y=mean_LBF,index=method,fill=method)) + geom_boxplot()+scale_fill_uchicago() 

  fgem_not_fisher_v <- group_by(sdf_sig,
                                cancer,
                                feature_name) %>%

    ungroup() %>%
    mutate(class="fgem_not_fisher")

  fisher_not_fgem_v <- group_by(fisher_not_fgem,
                                cancer,
                                feature_name) %>%
    summarise(p_intogen=mean(is_intogen),
              p_tcga=mean(is_TCGA),
              p_external=mean((is_intogen & !is_TCGA)),
              mean_LBF=mean(BF)) %>%
    ungroup()  %>%
    mutate(class="fisher_not_fgem")

  ovdf <- bind_rows(fgem_not_fisher_v,fisher_not_fgem_v) #%>% group_by(cancer,feature_name,
  group_by(ovdf,class) %>%
    summarise(pt_intogen=mean(p_intogen>0),
              pt_tcga=mean(p_tcga>0),
              pt_external=mean(p_external>0),
              tot_feat=n()) %>%
    ungroup() 
            
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session jacc :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  fisher_fgem_dat <- select(single_df,cancer,feature_name,contains("pval")) %>% 
    gather(key="method",value="pval",contains("pval"))  %>% distinct()  %>%  group_by(cancer,method) %>%
    mutate(qval=p.adjust(pval,method="fdr")) %>% summarise(n_sig=sum(qval<0.01))  %>% group_by(cancer) %>%
    filter(all(n_sig>0)) %>%
    ungroup() %>% mutate(is_fgem=stringr::str_detect(method,"fgem"),method=stringr::str_remove(method,"pval_"))
  fisher_plt <-  fisher_fgem_dat%>%
    ggplot(aes(x=cancer,y=n_sig,fill=method))+geom_bar(stat="identity",position="dodge")+ggtitle("Number of significant (qval<0.01) features","Fisher at various FDR thresholds") 
  ggsave("org/fgem_fisher.png",plot=fisher_plt)

  wgdf <- select(single_df,cancer,feature_name,fisher=pval_fisher,fgem=pval_fgem) %>% 
    gather(key="method",value="pval",fisher,fgem)  %>% distinct() %>% group_by(cancer,method) %>%
    mutate(qval=p.adjust(pval,method="fdr")) %>% filter(cancer=="LIHC") %>%
    ungroup() %>% select(-pval) %>% 
    spread(method,qval) %>%
    filter(fisher<0.01,fgem>=0.01)


  filter(bp_name,feature_name== "GO:0000122") %>% unnest(Synonyms)


  BPGOdf <- qs::qread("data/GO_df.qs")
  min_cancer_df <- cancer_df %>%
    select(Gene, BF, cancer) %>%
    mutate(BF = exp(BF))

    go_df <- mutate(BPGOdf,Gene=as.character(Gene)) %>%
      semi_join(distinct(cancer_df,Gene))

    go_df <- group_by(go_df,feature_name) %>%
      summarise(n_gt=n()) %>%
      filter(n_gt>=10) %>%
      select(feature_name) %>%
      inner_join(go_df)
  go_df <- mutate(go_df,value=1.0)

  wcdf <- filter(cancer_df,cancer=="LIHC")
                         
  ixdf <- semi_join(go_df, wgdf)

  cX <- fgem::trip2sparseMatrix(rowname_vals = as.character(ixdf$Gene),
                                     colname_vals = ixdf$feature_name,
                                     values = ixdf$value,
                                     total_rownames = wcdf$Gene,
                                     total_colnames = unique(ixdf$feature_name),
                                add_intercept = FALSE)
  BF <- wcdf$BF
  fgmr <- fgem_marginal(cX,BF,log_BF=TRUE)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session jacc :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :results graphics :file org/fisher_fgem.png
ggplot(single_df,aes(x=pval_fisher,y=pval_fgem))+geom_point()+geom_abline(slope=1)+facet_wrap(~cancer)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session jacc :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
ggs <- filter(single_df,1-pval_fisher>.Machine$double.eps) %>% ggplot(aes(x=pval_fisher,y=pval_fgem))+geom_point()+facet_wrap(~cancer,scales="free")+scale_x_log10()+scale_y_log10()+geom_smooth(method="lm")+geom_abline(slope=1)+ggtitle("Fisher's Exact Test vs FGEM p-values")
ggsave("org/fisher_fgem.png",plot=ggs)
#+END_SRC

