docs/fgem.html





<li><a id="org79ea5e3"></a>GO Only<br></li>
</ul>
</li>


<li><a id="org84ef8c4"></a>Comparing univariate models to Fisher's Exact results<br>
<div class="outline-text-5" id="text-org84ef8c4">
<div class="org-src-container">
<pre class="src src-R">
<span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(fgem)
<span style="color: #C04040;">library</span>(ggplot2)
<span style="color: #C04040;">library</span>(tidyr)

cancer_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>)
bp_name <span style="color: #C04040;">&lt;-</span> readRDS(<span style="color: #FFABAB;">"data/GO_Definitions.RDS"</span>) 
cancer_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>)   <span style="color: #C04040;">%&gt;%</span> semi_join(cancerlist)
cancer_null <span style="color: #C04040;">&lt;-</span>  group_by(cancer_df,cancer) <span style="color: #C04040;">%&gt;%</span> summarise(null_lik=fgem:::fgem_null_lik(BF,log_BF=<span style="color: #99D6FF;">TRUE</span>),Intercept=fgem:::fgem_null(BF,log_BF=<span style="color: #99D6FF;">TRUE</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
fgem_results <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/alt_newest_fgem_marginal_results.qs"</span>) <span style="color: #C04040;">%&gt;%</span>
  group_by(cancer) <span style="color: #C04040;">%&gt;%</span>
  mutate(qval = p.adjust(dplyr::if_else(convergence == 0, pval, 1), method = <span style="color: #FFABAB;">"fdr"</span>)) <span style="color: #C04040;">%&gt;%</span>
  select(Beta,pval,qval,cancer)
  <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">ungroup() %&gt;%</span>
  <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">mutate(hess_det=map_dbl(Beta,~det(.x$hessian)))</span>



  <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">fgem_results &lt;- map_df(fs::dir_ls("data/fgem_m_results"), qs::qread) %&gt;%</span>


  <span style="color: #5D6A70;">##     </span><span style="color: #5D6A70;">inner_join(select(cancer_null,-Intercept)) %&gt;%</span>
  <span style="color: #5D6A70;">##     </span><span style="color: #5D6A70;">mutate(pval=stats::pchisq(-2 * (null_lik - (lik)), df=1, lower.tail=F)) %&gt;%</span>
  <span style="color: #5D6A70;">##     </span><span style="color: #5D6A70;">group_by(cancer) %&gt;%</span>
  <span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">mutate(qval = p.adjust(dplyr::if_else(convergence == 0, pval, 1), method = "fdr")) %&gt;%</span>
  <span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">select(Beta,pval,qval,cancer)</span>


  fgem_results_df <span style="color: #C04040;">&lt;-</span> fgem_results <span style="color: #C04040;">%&gt;%</span>
    mutate(Beta=map(Beta,~dplyr::select(.x,Beta,feature_name))) <span style="color: #C04040;">%&gt;%</span>
    ungroup() <span style="color: #C04040;">%&gt;%</span> 
    mutate(tid = 1:n()) <span style="color: #C04040;">%&gt;%</span>
    unnest(Beta) <span style="color: #C04040;">%&gt;%</span>
    group_by(tid) <span style="color: #C04040;">%&gt;%</span>
    mutate(trait=feature_name[feature_name!=<span style="color: #FFABAB;">"Intercept"</span>]) <span style="color: #C04040;">%&gt;%</span>
    ungroup() <span style="color: #C04040;">%&gt;%</span> 
    mutate(feature_name = dplyr::if_else(feature_name == <span style="color: #FFABAB;">"Intercept"</span>, <span style="color: #FFABAB;">"Intercept"</span>, <span style="color: #FFABAB;">"estimate_fgem"</span>)) <span style="color: #C04040;">%&gt;%</span>
    spread(key = <span style="color: #FFABAB;">"feature_name"</span>, value = <span style="color: #FFABAB;">"Beta"</span>) <span style="color: #C04040;">%&gt;%</span>
    select(feature_name=trait,pval_fgem = pval, qval_fgem = qval,cancer,estimate_fgem,Intercept)


  fisher_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_single_fisher_cutoffs.qs"</span>) <span style="color: #C04040;">%&gt;%</span>
      dplyr::select(cancer,
                    feature_name,
                    pval = p.value,cutoff) <span style="color: #C04040;">%&gt;%</span>
    mutate(cutoff=paste0(<span style="color: #FFABAB;">"pval_fisher_"</span>,stringr::str_replace(cutoff,<span style="color: #FFABAB;">"\\."</span>,<span style="color: #FFABAB;">"_"</span>)))<span style="color: #C04040;">%&gt;%</span> spread(key=<span style="color: #FFABAB;">"cutoff"</span>,value=<span style="color: #FFABAB;">"pval"</span>)

  single_df <span style="color: #C04040;">&lt;-</span> inner_join(fisher_df, fgem_results_df, by = c(<span style="color: #FFABAB;">"cancer"</span>, <span style="color: #FFABAB;">"feature_name"</span>))
  qs::qsave(single_df,<span style="color: #FFABAB;">"data/single_df.qs"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(forcats)
<span style="color: #C04040;">library</span>(ggsci)
<span style="color: #C04040;">library</span>(tidyverse)

go_df <span style="color: #C04040;">&lt;-</span> select(BPGOdf, Gene, feature_name = feature) <span style="color: #C04040;">%&gt;%</span> 
  mutate(Gene=as.character(Gene))

intogen_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/intogen_df.qs"</span>) <span style="color: #C04040;">%&gt;%</span>
  unnest(intogen_l) <span style="color: #C04040;">%&gt;%</span> mutate(is_intogen=<span style="color: #99D6FF;">TRUE</span>)

single_df <span style="color: #C04040;">&lt;-</span>     qs::qread(<span style="color: #FFABAB;">"data/single_df.qs"</span>)
GO_def <span style="color: #C04040;">&lt;-</span> readRDS(<span style="color: #FFABAB;">"data/GO_Definitions.RDS"</span>) <span style="color: #C04040;">%&gt;%</span>
      select(feature_name,description=Term)
sdf <span style="color: #C04040;">&lt;-</span> select(single_df,
              -qval_fgem,
              -estimate_fgem,
              -Intercept) <span style="color: #C04040;">%&gt;%</span>
  gather(key = <span style="color: #FFABAB;">"method"</span>,
         value = <span style="color: #FFABAB;">"pval"</span>,
         -cancer,
         -feature_name) <span style="color: #C04040;">%&gt;%</span>
  mutate(method = stringr::str_remove(method, <span style="color: #FFABAB;">"pval_"</span>),
         is_fisher = dplyr::if_else(stringr::str_starts(method, <span style="color: #FFABAB;">"fisher"</span>),
                                    <span style="color: #FFABAB;">"fisher"</span>,
                                    <span style="color: #FFABAB;">"fgem"</span>)) <span style="color: #C04040;">%&gt;%</span>
  group_by(cancer, method) <span style="color: #C04040;">%&gt;%</span>
  mutate(qval = p.adjust(pval, method = <span style="color: #FFABAB;">"fdr"</span>)) <span style="color: #C04040;">%&gt;%</span>
  ungroup() <span style="color: #C04040;">%&gt;%</span>
  filter((is_fisher == <span style="color: #FFABAB;">"fisher"</span> &amp; (method == <span style="color: #FFABAB;">"fisher_0_1"</span>)) | is_fisher == <span style="color: #FFABAB;">"fgem"</span>)


weird_fishers <span style="color: #C04040;">&lt;-</span> select(single_df,cancer,feature_name,fisher=pval_fisher_0_05,fgem=qval_fgem) <span style="color: #C04040;">%&gt;%</span> group_by(cancer) <span style="color: #C04040;">%&gt;%</span> mutate(fisher=p.adjust(fisher,method=<span style="color: #FFABAB;">"fdr"</span>)) <span style="color: #C04040;">%&gt;%</span> ungroup() <span style="color: #C04040;">%&gt;%</span> filter(fisher&lt;0.05) <span style="color: #C04040;">%&gt;%</span> arrange(desc(fgem)) <span style="color: #C04040;">%&gt;%</span> head() <span style="color: #C04040;">%&gt;%</span> inner_join(GO_def)

weird_fgem <span style="color: #C04040;">&lt;-</span> select(single_df,cancer,feature_name,fisher=pval_fisher_0_05,fgem=qval_fgem) <span style="color: #C04040;">%&gt;%</span>
  group_by(cancer) <span style="color: #C04040;">%&gt;%</span>
  mutate(fisher=p.adjust(fisher,method=<span style="color: #FFABAB;">"fdr"</span>)) <span style="color: #C04040;">%&gt;%</span>
  ungroup() <span style="color: #C04040;">%&gt;%</span>
  filter(fgem&lt;0.05) <span style="color: #C04040;">%&gt;%</span>
  arrange(desc(fisher)) <span style="color: #C04040;">%&gt;%</span>
  inner_join(GO_def)

wf_fisher <span style="color: #C04040;">&lt;-</span> slice(weird_fishers,2)
wf_fgem <span style="color: #C04040;">&lt;-</span> filter(weird_fgem, fisher&lt;1) <span style="color: #C04040;">%&gt;%</span>
  slice(2)
gsea_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/gsea.qs"</span>)
single_gsea_df <span style="color: #C04040;">&lt;-</span> inner_join(gsea_df, single_df)

gene_sets <span style="color: #C04040;">&lt;-</span> split(go_df$Gene,go_df$feature_name)

<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">tcancer &lt;- filter(cancer_df,cancer==cancer[1])</span>

<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">library(furrr)</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">library(progressr)</span>

<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">interruptor = function(FUN,args, time.limit, ALTFUN){</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">results &lt;- NULL</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">results &lt;- evalWithTimeout({FUN(args)},timeout=time.limit,onTimeout="silent")</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">if(is.null(results)){</span>
<span style="color: #5D6A70;">##     </span><span style="color: #5D6A70;">results &lt;- ALTFUN(args)</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">}</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">return(results)</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">}</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">plan(multiprocess)</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">sub_fun &lt;- function(cancer,data){</span>
<span style="color: #5D6A70;">##     </span><span style="color: #5D6A70;">cancer_rank &lt;- set_names(data$BF,data$Gene)</span>
<span style="color: #5D6A70;">##     </span><span style="color: #5D6A70;">fgr &lt;- fgsea::fgsea(gene_sets,cancer_rank,nproc=1)</span>
<span style="color: #5D6A70;">##     </span><span style="color: #5D6A70;">progress(amount=1)</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">as_tibble(fgr) %&gt;% select(feature_name=pathway,pval_gsea=pval,qval_gsea=padj,gsea_estimate=ES) %&gt;% mutate(cancer=cancer)</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">}</span>

<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">cdfl &lt;- nest(cancer_df,data=-cancer)</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">with_progress({</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">progress &lt;- progressor(steps=nrow(cdfl))</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">fgr_f  &lt;- pmap(cdfl,function(cancer,data){</span>
<span style="color: #5D6A70;">##     </span><span style="color: #5D6A70;">future(sub_fun(cancer,data))</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">})</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">})</span>

<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">fgr_f &lt;- fgr_f[map_lgl(fgr_f,resolved)]</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">fgr_df &lt;- map_df(fgr_f,value)</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">qs::qsave(fgr_df,"data/gsea.qs")</span>

<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">cdfl_l &lt;- pmap(cdfl, function(cancer, data) {</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">set_names(data$BF, data$Gene)</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">})</span>

<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">cdfl_l &lt;- set_names(cdfl_l,cdfl$cancer)</span>

<span style="color: #FFE203;">generate_dist_plot</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(wf,nc=1){
  plotdf <span style="color: #C04040;">&lt;-</span> left_join(
    semi_join(cancer_df, wf),
    (left_join(wf, go_df))) <span style="color: #C04040;">%&gt;%</span>
    arrange(BF) <span style="color: #C04040;">%&gt;%</span>
    mutate(feature = if_else(is.na(feature_name), <span style="color: #FFABAB;">"Background"</span>, feature_name),
           is_sig_gene = if_else(FDR&lt;0.05, <span style="color: #FFABAB;">"FDR&lt;0.05"</span>, <span style="color: #FFABAB;">"FDR&gt;=0.05"</span>),
           idx = 1:n(),
           category = factor(interaction(feature,is_sig_gene)),
           sig_cat=gl(nc,ceiling(n()/nc),n())) <span style="color: #C04040;">%&gt;%</span>
    mutate(is_sig_gene = fct_reorder(factor(is_sig_gene),BF),
           category = fct_reorder2(category,feature!=<span style="color: #FFABAB;">"Background"</span>,-BF),
           feature=factor(feature))
  isp_df <span style="color: #C04040;">&lt;-</span> filter(plotdf, feature != <span style="color: #FFABAB;">"Background"</span>) <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">%&gt;% mutate(sh=124)</span>

  plt <span style="color: #C04040;">&lt;-</span> plotdf <span style="color: #C04040;">%&gt;%</span>
    ggplot(aes(x=idx, y=BF, col=category, size=feature)) + geom_point() +
    xlab(<span style="color: #FFABAB;">"Index"</span>) +
    ylab(<span style="color: #FFABAB;">"LBF"</span>) +
    ggtitle(glue::glue_data(wf,<span style="color: #FFABAB;">"{cancer} {feature_name}: {description}"</span>),
            glue::glue_data(wf,<span style="color: #FFABAB;">"fisher q-value: {fisher}\nFGEM q-value: {fgem}"</span>)) +
    scale_size_manual(values=c(1,2)) +
    geom_point(data=isp_df,aes(x=idx,y=BF),shape=124,size=9)+scale_color_uchicago()
  <span style="color: #C8FF03;">if</span>(nc&gt;1)
    plt <span style="color: #C04040;">&lt;-</span> plt+facet_wrap(~sig_cat,scales=<span style="color: #FFABAB;">"free"</span>,nrow=1)
  <span style="color: #C8FF03;">return</span>(plt)
}

swfg <span style="color: #C04040;">&lt;-</span> semi_join(single_df,wf_fgem) <span style="color: #C04040;">%&gt;%</span> as.data.frame()
new_prior <span style="color: #C04040;">&lt;-</span> rep(stats::plogis(swfg$Intercept+swfg$estimate_fgem,log.p=<span style="color: #99D6FF;">TRUE</span>),nrow(plotdf))

trng <span style="color: #C04040;">&lt;-</span> range(plotdf$BF)
rangesq <span style="color: #C04040;">&lt;-</span> seq(trng[1],trng[2],length.out=nrow(plotdf))
all_with_model <span style="color: #C04040;">&lt;-</span> mutate(plotdf,
                         post_feature = c(fgem::BF2posterior(BF, Gene, new_prior, log_BF = <span style="color: #99D6FF;">TRUE</span>)),
                         post_nf = c(fgem::BF2posterior(BF, Gene, fgem:::predict_uniform_prior(BF, log_BF = <span style="color: #99D6FF;">TRUE</span>), log_BF = <span style="color: #99D6FF;">TRUE</span>))) <span style="color: #C04040;">%&gt;%</span>
  select(Gene, BF, functional=post_feature,uniform=post_nf,idx,is_sig_gene,feature) <span style="color: #C04040;">%&gt;%</span>
  gather(<span style="color: #FFABAB;">"model"</span>,<span style="color: #FFABAB;">"posterior"</span>,functional,uniform)
awm <span style="color: #C04040;">&lt;-</span> filter(all_with_model,feature!=<span style="color: #FFABAB;">"Background"</span>)
ggplot(all_with_model,aes(x=idx,y=posterior,col=model))+geom_point()+geom_point(data=awm,aes(x=idx,y=posterior,col=model),shape=124,size=9)

plot_fisher <span style="color: #C04040;">&lt;-</span> generate_dist_plot(wf_fisher,3)
plot_fgem <span style="color: #C04040;">&lt;-</span> generate_dist_plot(wf_fgem,5)


sdf_sig <span style="color: #C04040;">&lt;-</span> group_by(sdf, cancer, feature_name, method) <span style="color: #C04040;">%&gt;%</span>
  summarise(sig = all(qval &lt; 0.05)) <span style="color: #C04040;">%&gt;%</span>
  spread(key = method, value = sig) <span style="color: #C04040;">%&gt;%</span>
  ungroup() <span style="color: #C04040;">%&gt;%</span>
  rename(fisher = fisher_0_1) <span style="color: #C04040;">%&gt;%</span>
  filter(fgem | fisher) <span style="color: #C04040;">%&gt;%</span>
  inner_join(GO_def)

sdf_b  <span style="color: #C04040;">&lt;-</span> select(sdf, -is_fisher, -qval)
sdfc <span style="color: #C04040;">&lt;-</span>  sdf <span style="color: #C04040;">%&gt;%</span>
  summarise(proportion_significant=mean(qval&lt;0.05)) <span style="color: #C04040;">%&gt;%</span>
  ungroup()


group_by(sdf_sig,feature_name,method) <span style="color: #C04040;">%&gt;%</span>
  summarise(p_shared=mean(sig),n=n()) <span style="color: #C04040;">%&gt;%</span>
  arrange(desc(p_shared)) <span style="color: #C04040;">%&gt;%</span>
  group_by(method) <span style="color: #C04040;">%&gt;%</span>
  summarise(p_share=sum(p_shared&gt;0),n=n())
  ggplot(aes(x=method,y=p_shared,fill=method)) + geom_boxplot()+scale_y_log10()

cancer_it <span style="color: #C04040;">&lt;-</span> left_join(cancer_df,intogen_df) <span style="color: #C04040;">%&gt;%</span>
  replace_na(list(is_TCGA=<span style="color: #99D6FF;">FALSE</span>,is_intogen=<span style="color: #99D6FF;">FALSE</span>))
sovdf <span style="color: #C04040;">&lt;-</span> inner_join(filter(sdf_sig,sig),go_df) <span style="color: #C04040;">%&gt;%</span> inner_join(cancer_it)
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">fgem_not_fisher &lt;- filter(sdf_sig,fgem,!fisher) %&gt;%</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">inner_join(go_df) %&gt;%</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">left_join(cancer_it)</span>
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">fisher_not_fgem &lt;- filter(sdf_sig,!fgem,fisher) %&gt;% inner_join(go_df) %&gt;% left_join(cancer_it)</span>
sovdf <span style="color: #C04040;">&lt;-</span> group_by(ovdf,cancer,feature_name) <span style="color: #C04040;">%&gt;%</span> filter(sum(sig)&lt;2) <span style="color: #C04040;">%&gt;%</span> ungroup() 

group_by(sovdf,cancer,feature_name,method) <span style="color: #C04040;">%&gt;%</span>
  summarise(p_intogen=mean(is_intogen),
            p_tcga=mean(is_TCGA),
            p_external=mean((is_intogen &amp; !is_TCGA)),
            mean_LBF=mean(BF)) <span style="color: #C04040;">%&gt;%</span> mutate(cancer = fct_reorder(cancer, -mean_LBF)) <span style="color: #C04040;">%&gt;%</span> 
  ggplot(aes(x=cancer,y=mean_LBF,index=method,fill=method)) + geom_boxplot()+scale_fill_uchicago() 

fgem_not_fisher_v <span style="color: #C04040;">&lt;-</span> group_by(sdf_sig,
                              cancer,
                              feature_name) <span style="color: #C04040;">%&gt;%</span>

  ungroup() <span style="color: #C04040;">%&gt;%</span>
  mutate(class=<span style="color: #FFABAB;">"fgem_not_fisher"</span>)

fisher_not_fgem_v <span style="color: #C04040;">&lt;-</span> group_by(fisher_not_fgem,
                              cancer,
                              feature_name) <span style="color: #C04040;">%&gt;%</span>
  summarise(p_intogen=mean(is_intogen),
            p_tcga=mean(is_TCGA),
            p_external=mean((is_intogen &amp; !is_TCGA)),
            mean_LBF=mean(BF)) <span style="color: #C04040;">%&gt;%</span>
  ungroup()  <span style="color: #C04040;">%&gt;%</span>
  mutate(class=<span style="color: #FFABAB;">"fisher_not_fgem"</span>)

ovdf <span style="color: #C04040;">&lt;-</span> bind_rows(fgem_not_fisher_v,fisher_not_fgem_v) <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">%&gt;% group_by(cancer,feature_name,</span>
group_by(ovdf,class) <span style="color: #C04040;">%&gt;%</span>
  summarise(pt_intogen=mean(p_intogen&gt;0),
            pt_tcga=mean(p_tcga&gt;0),
            pt_external=mean(p_external&gt;0),
            tot_feat=n()) <span style="color: #C04040;">%&gt;%</span>
  ungroup() 

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">fisher_fgem_dat <span style="color: #C04040;">&lt;-</span> select(single_df,cancer,feature_name,contains(<span style="color: #FFABAB;">"pval"</span>)) <span style="color: #C04040;">%&gt;%</span> 
  gather(key=<span style="color: #FFABAB;">"method"</span>,value=<span style="color: #FFABAB;">"pval"</span>,contains(<span style="color: #FFABAB;">"pval"</span>))  <span style="color: #C04040;">%&gt;%</span> distinct()  <span style="color: #C04040;">%&gt;%</span>  group_by(cancer,method) <span style="color: #C04040;">%&gt;%</span>
  mutate(qval=p.adjust(pval,method=<span style="color: #FFABAB;">"fdr"</span>)) <span style="color: #C04040;">%&gt;%</span> summarise(n_sig=sum(qval&lt;0.01))  <span style="color: #C04040;">%&gt;%</span> group_by(cancer) <span style="color: #C04040;">%&gt;%</span>
  filter(all(n_sig&gt;0)) <span style="color: #C04040;">%&gt;%</span>
  ungroup() <span style="color: #C04040;">%&gt;%</span> mutate(is_fgem=stringr::str_detect(method,<span style="color: #FFABAB;">"fgem"</span>),method=stringr::str_remove(method,<span style="color: #FFABAB;">"pval_"</span>))
fisher_plt <span style="color: #C04040;">&lt;-</span>  fisher_fgem_dat<span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=cancer,y=n_sig,fill=method))+geom_bar(stat=<span style="color: #FFABAB;">"identity"</span>,position=<span style="color: #FFABAB;">"dodge"</span>)+ggtitle(<span style="color: #FFABAB;">"Number of significant (qval&lt;0.01) features"</span>,<span style="color: #FFABAB;">"Fisher at various FDR thresholds"</span>) 
ggsave(<span style="color: #FFABAB;">"org/fgem_fisher.png"</span>,plot=fisher_plt)

wgdf <span style="color: #C04040;">&lt;-</span> select(single_df,cancer,feature_name,fisher=pval_fisher,fgem=pval_fgem) <span style="color: #C04040;">%&gt;%</span> 
  gather(key=<span style="color: #FFABAB;">"method"</span>,value=<span style="color: #FFABAB;">"pval"</span>,fisher,fgem)  <span style="color: #C04040;">%&gt;%</span> distinct() <span style="color: #C04040;">%&gt;%</span> group_by(cancer,method) <span style="color: #C04040;">%&gt;%</span>
  mutate(qval=p.adjust(pval,method=<span style="color: #FFABAB;">"fdr"</span>)) <span style="color: #C04040;">%&gt;%</span> filter(cancer==<span style="color: #FFABAB;">"LIHC"</span>) <span style="color: #C04040;">%&gt;%</span>
  ungroup() <span style="color: #C04040;">%&gt;%</span> select(-pval) <span style="color: #C04040;">%&gt;%</span> 
  spread(method,qval) <span style="color: #C04040;">%&gt;%</span>
  filter(fisher&lt;0.01,fgem&gt;=0.01)


filter(bp_name,feature_name== <span style="color: #FFABAB;">"GO:0000122"</span>) <span style="color: #C04040;">%&gt;%</span> unnest(Synonyms)


BPGOdf <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/GO_df.qs"</span>)
min_cancer_df <span style="color: #C04040;">&lt;-</span> cancer_df <span style="color: #C04040;">%&gt;%</span>
  select(Gene, BF, cancer) <span style="color: #C04040;">%&gt;%</span>
  mutate(BF = exp(BF))

  go_df <span style="color: #C04040;">&lt;-</span> mutate(BPGOdf,Gene=as.character(Gene)) <span style="color: #C04040;">%&gt;%</span>
    semi_join(distinct(cancer_df,Gene))

  go_df <span style="color: #C04040;">&lt;-</span> group_by(go_df,feature_name) <span style="color: #C04040;">%&gt;%</span>
    summarise(n_gt=n()) <span style="color: #C04040;">%&gt;%</span>
    filter(n_gt&gt;=10) <span style="color: #C04040;">%&gt;%</span>
    select(feature_name) <span style="color: #C04040;">%&gt;%</span>
    inner_join(go_df)
go_df <span style="color: #C04040;">&lt;-</span> mutate(go_df,value=1.0)

wcdf <span style="color: #C04040;">&lt;-</span> filter(cancer_df,cancer==<span style="color: #FFABAB;">"LIHC"</span>)

ixdf <span style="color: #C04040;">&lt;-</span> semi_join(go_df, wgdf)

cX <span style="color: #C04040;">&lt;-</span> fgem::trip2sparseMatrix(rowname_vals = as.character(ixdf$Gene),
                                   colname_vals = ixdf$feature_name,
                                   values = ixdf$value,
                                   total_rownames = wcdf$Gene,
                                   total_colnames = unique(ixdf$feature_name),
                              add_intercept = <span style="color: #99D6FF;">FALSE</span>)
BF <span style="color: #C04040;">&lt;-</span> wcdf$BF
fgmr <span style="color: #C04040;">&lt;-</span> fgem_marginal(cX,BF,log_BF=<span style="color: #99D6FF;">TRUE</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">ggplot(single_df,aes(x=pval_fisher,y=pval_fgem))+geom_point()+geom_abline(slope=1)+facet_wrap(~cancer)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">ggs <span style="color: #C04040;">&lt;-</span> filter(single_df,1-pval_fisher&gt;.Machine$double.eps) <span style="color: #C04040;">%&gt;%</span> ggplot(aes(x=pval_fisher,y=pval_fgem))+geom_point()+facet_wrap(~cancer,scales=<span style="color: #FFABAB;">"free"</span>)+scale_x_log10()+scale_y_log10()+geom_smooth(method=<span style="color: #FFABAB;">"lm"</span>)+geom_abline(slope=1)+ggtitle(<span style="color: #FFABAB;">"Fisher's Exact Test vs FGEM p-values"</span>)
ggsave(<span style="color: #FFABAB;">"org/fisher_fgem.png"</span>,plot=ggs)
</pre>
</div>
</div>
</li>
