org/fgem.org
**** Fitting Multivariate models


***** GO only



#+BEGIN_SRC R :session *shell* 
library(dplyr)
library(purrr)
library(fgem)
library(tidyr)
library(dplyr)
library(progressr)
library(future.apply)
#+END_SRC

#+BEGIN_SRC R :session *shell* :dir /ssh:gardner2:/home/nwknoblauch/xm
  library(future.batchtools)
  plan(list(
    tweak(batchtools_torque,
          template  = "/home/t.cri.nknoblauch/torque_batchtools.tmpl",
          resources = list(ncpus=10,mem=29000L,walltime=3600L*3)),multiprocess))
#+END_SRC



#+BEGIN_SRC R :session fitmult :dir /ssh:gardner2:/home/nwknoblauch/xm

  #plan(multisession)
  plan(list(tweak(multisession,workers=4),multicore))
#+END_SRC

#+BEGIN_SRC R :session fitmult :dir /ssh:gardner2:/home/nwknoblauch/xm
  out_d <- fs::path("data/new_cv_gobp_models_conservative_relaxed/")
  fs::dir_create(out_d)
  fs::dir_delete(out_d)
  fs::dir_create(out_d)

  ody <- fs::path("data/new_conservative_y_models")
  odx <- fs::path("data/new_conservative_x_models")
  ct <- fs::path_ext_remove(fs::path_file(fs::dir_ls(odx)))
  opf <- purrr::map_chr(ct,~fs::path(out_d,.x, ext="qs"))
  ct <- ct[!file.exists(opf)]
  iseq <- seq_along(ct)

  sub_fun <- function(tf, cancerf, od){
    cancer <- cancerf[tf]
    #p(sprintf("i=%g", tf))
    op <- fs::path(od,cancer, ext="qs")
    if(!file.exists(op)){
      ym <- qs::qread(fs::path(ody, cancer, ext = "qs"))
      X <- qs::qread(fs::path(odx, cancer, ext = "qs"))
  #    with_progress({
      cv_df <- dplyr::mutate(fgem:::cv_relax_fgem(X, ym$BF, alpha=0.95, stratify_BF = FALSE, grad=TRUE, hess=TRUE, log_BF = TRUE), cancer = cancer)
                                          #   })
      ## with_progress({
      ##   ccv_df <- dplyr::mutate(cv_fgem(X,ym,alpha=0.8,stratify_BF=FALSE),cancer=cancer)
      ## })                                      
      qs::qsave(cv_df, op)
      return(cv_df)
    }else{
      return(qs::qread(op))
    }
  }
#+END_SRC

#+BEGIN_SRC R :session fitmult :dir /ssh:trcc:/home/nwknoblauch/xm

  with_progress({
    p <- progressor(along = iseq)  
    ret_df <- future.apply::future_lapply(iseq,sub_fun,cancerf=ct,od=out_d)
  })
  ret_df <- dplyr::bind_rows(ret_df)

#+END_SRC


**** Plotting multivariate models

     
