docs/fgem.html

<li><a id="org870bcd5"></a>Fitting Multivariate models<br>
<ul class="org-ul">
<li><a id="org450514e"></a>GO only<br>
<div class="outline-text-6" id="text-org450514e">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(fgem)
<span style="color: #C04040;">library</span>(tidyr)
<span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(progressr)
<span style="color: #C04040;">library</span>(future.apply)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(future.batchtools)
plan(list(
  tweak(batchtools_torque,
        template  = <span style="color: #FFABAB;">"/home/t.cri.nknoblauch/torque_batchtools.tmpl"</span>,
        resources = list(ncpus=10,mem=29000L,walltime=3600L*3)),multiprocess))
</pre>
</div>



<div class="org-src-container">
<pre class="src src-R">
<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">plan(multisession)</span>
plan(list(tweak(multisession,workers=4),multicore))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">out_d <span style="color: #C04040;">&lt;-</span> fs::path(<span style="color: #FFABAB;">"data/new_cv_gobp_models_conservative_relaxed/"</span>)
fs::dir_create(out_d)
fs::dir_delete(out_d)
fs::dir_create(out_d)

ody <span style="color: #C04040;">&lt;-</span> fs::path(<span style="color: #FFABAB;">"data/new_conservative_y_models"</span>)
odx <span style="color: #C04040;">&lt;-</span> fs::path(<span style="color: #FFABAB;">"data/new_conservative_x_models"</span>)
ct <span style="color: #C04040;">&lt;-</span> fs::path_ext_remove(fs::path_file(fs::dir_ls(odx)))
opf <span style="color: #C04040;">&lt;-</span> purrr::map_chr(ct,~fs::path(out_d,.x, ext=<span style="color: #FFABAB;">"qs"</span>))
ct <span style="color: #C04040;">&lt;-</span> ct[!file.exists(opf)]
iseq <span style="color: #C04040;">&lt;-</span> seq_along(ct)

<span style="color: #FFE203;">sub_fun</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(tf, cancerf, od){
  cancer <span style="color: #C04040;">&lt;-</span> cancerf[tf]
  <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">p(sprintf("i=%g", tf))</span>
  op <span style="color: #C04040;">&lt;-</span> fs::path(od,cancer, ext=<span style="color: #FFABAB;">"qs"</span>)
  <span style="color: #C8FF03;">if</span>(!file.exists(op)){
    ym <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(ody, cancer, ext = <span style="color: #FFABAB;">"qs"</span>))
    X <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(odx, cancer, ext = <span style="color: #FFABAB;">"qs"</span>))
<span style="color: #5D6A70;">#    </span><span style="color: #5D6A70;">with_progress({</span>
    cv_df <span style="color: #C04040;">&lt;-</span> dplyr::mutate(fgem:::cv_relax_fgem(X, ym$BF, alpha=0.95, stratify_BF = <span style="color: #99D6FF;">FALSE</span>, grad=<span style="color: #99D6FF;">TRUE</span>, hess=<span style="color: #99D6FF;">TRUE</span>, log_BF = <span style="color: #99D6FF;">TRUE</span>), cancer = cancer)
                                        <span style="color: #5D6A70;">#   </span><span style="color: #5D6A70;">})</span>
    <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">with_progress({</span>
    <span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">ccv_df &lt;- dplyr::mutate(cv_fgem(X,ym,alpha=0.8,stratify_BF=FALSE),cancer=cancer)</span>
    <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">})                                      </span>
    qs::qsave(cv_df, op)
    <span style="color: #C8FF03;">return</span>(cv_df)
  }<span style="color: #C8FF03;">else</span>{
    <span style="color: #C8FF03;">return</span>(qs::qread(op))
  }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
with_progress({
  p <span style="color: #C04040;">&lt;-</span> progressor(along = iseq)  
  ret_df <span style="color: #C04040;">&lt;-</span> future.apply::future_lapply(iseq,sub_fun,cancerf=ct,od=out_d)
})
ret_df <span style="color: #C04040;">&lt;-</span> dplyr::bind_rows(ret_df)

</pre>
</div>
</div>
</li>
</ul>
</li>


<li><a id="org5fc73b3"></a>Plotting multivariate models<br></li>
</ul>
</div>
