org/fgem.org
** COSMIC census

From [[https://cancer.sanger.ac.uk/census][Cosmic:]]
#+BEGIN_QUOTE
The Cancer Gene Census (CGC) is an ongoing effort to catalogue those genes which contain mutations that have been causally implicated in cancer and explain how dysfunction of these genes drives cancer. The content, the structure, and the curation process of the Cancer Gene Census was described and published in Nature Reviews Cancer.

The census is not static, instead it is updated when new evidence comes to light. In particular we are grateful to Felix Mitelman and his colleagues in providing information on more genes involved in uncommon translocations in leukaemias and lymphomas. Currently, more than 1% of all human genes are implicated via mutation in cancer. Of these, approximately 90% contain somatic mutations in cancer, 20% bear germline mutations that predispose an individual to cancer and 10% show both somatic and germline mutations.
Census tiers

Genes in the Cancer Gene Census are divided into two groups, or tiers.
Tier 1

To be classified into Tier 1, a gene must possess a documented activity relevant to cancer, along with evidence of mutations in cancer which change the activity of the gene product in a way that promotes oncogenic transformation. We also consider the existence of somatic mutation patterns across cancer samples gathered in COSMIC. For instance, tumour suppressor genes often show a broad range of inactivating mutations and dominant oncogenes usually demonstrate well defined hotspots of missense mutations. Genes involved in oncogenic fusions are included in Tier 1 when changes to their function caused by the fusion drives oncogenic transformation, or in cases when they provide regulatory elements to their partners (e.g. active promoter or dimerisation domain).
Tier 2

A new section of the Census, which consists of genes with strong indications of a role in cancer but with less extensive available evidence. These are generally more recent targets, where the body of evidence supporting their role is still emerging.
Hallmarks

New overviews of cancer gene function focused on hallmarks of cancer pull together manually curated information on the function of proteins coded by cancer genes and summarise the data in simple graphical form. They present a condensed overview of most relevant facts with quick access to the literature source, and define whether a gene has a stimulating or suppressive effect via individual cancer hallmarks. Genes with the hallmark descriptions available are marked with the hallmark icon, that when clicked, opens the hallmark page. Hallmark descriptions will be expanded to encompass more genes and updated on regular basis. 

#+END_QUOTE

#+BEGIN_SRC R :session drivermaps :colnames yes :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :colnames yes
  library(broom)
  ccols <- cols(
    Gene = col_character(),
    Name = col_skip(),
    `Entrez GeneId` = col_skip(),
    `Genome Location` = col_skip(),
    Tier = col_integer(),
    Hallmark = col_character(),
    `Chr Band` = col_skip(),
    Somatic = col_factor(levels="yes"),
    Germline = col_factor(levels="yes"),
    SomaticTypes = col_character(),
    GermlineTypes = col_character(),
    `Cancer Syndrome` = col_skip(),
    `Tissue Type` = col_skip(),
    `Molecular Genetics` = col_skip(),
    `Role in Cancer` = col_skip(),
    `Mutation Types` = col_skip(),
    `Translocation Partner` = col_skip(),
    `Other Germline Mut` = col_skip(),
    `Other Syndrome` = col_skip(),
    Synonyms = col_skip()
  )
  cancer_census <- readr::read_csv("data/cancer_gene_census.csv",col_names=names(ccols$cols),col_types=ccols,skip=1L) %>% 
  mutate(is_census=TRUE)

  GO_def <- readRDS("data/GO_Definitions.RDS") %>% select(feature_name,Term)
  GO_def <- bind_rows(GO_def,tibble(feature_name="Intercept",Term="")) %>% distinct()
  out_d <- fs::path("data/fdr_models/")

  all_results <- map_df(fs::dir_ls(out_d),qs::qread) %>%
      select(-term)

  all_results_df <- all_results  %>%
      unnest(data)  %>%
      inner_join(GO_def) %>%
      mutate(label=paste0(feature_name,":\n",Term))




  gen_go_mat <- function(datadl,cancer,cancer_list){
    xm <- qs::qread(fs::path("data/x_models/",cancer,ext="qs"))
    stopifnot(all(datadl$feature_name %in% colnames(xm)))
    x <- xm[,datadl$feature_name,drop=FALSE]
    cancer_vec <- rownames(xm) %in% cancer_list
    odf <- as_tibble(x) %>% mutate(cl=as.integer(cancer_vec))
    broom::tidy(glm(cl~.+0,data=odf,family=binomial())) %>%
      rename(feature_name=term)
  }


logit_df <- map2_dfr(all_results$data,all_results$cancer,gen_go_mat,cancer_list=cancer_census$Gene) %>%
    select(cancer,feature_name,pval_fisher=p.value)

  fisher_df <- map2_dfr(all_results$data,all_results$cancer,gen_go_mat,cancer_list=cancer_census$Gene) %>%
    select(cancer,feature_name,pval_fisher=p.value)
  univ_assoc <- readRDS("data/fgem_data.RDS")  %>% select(cancer,feature_name=trait,pval_logit=pval) %>% 
    inner_join(select(fisher_df,cancer,feature_name,pval_fisher=p.value)) 


  filter(all_results_df,feature_name!="Intercept")
#+END_SRC

#+BEGIN_SRC R :session drivermaps :colnames yes :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :colnames yes
  library(fgem)
  library(tidyverse)

  log_pbinom <- function(lp,x){
      sum(x*lp+(1-x)*log(expm1(-lp)))
    }

  prior_post_plot <- function(datadl,cancer,log=TRUE,cancer_list){
    ym <- qs::qread(fs::path("data/y_models/",cancer,ext="qs"))
    xm <- qs::qread(fs::path("data/x_models/",cancer,ext="qs"))
    stopifnot(all(datadl$feature_name %in% colnames(xm)))
    x <- xm[,datadl$feature_name,drop=FALSE]
    unifp <- fgem:::gen_u(fgem:::fgem_null(ym),x[,"Intercept",drop=FALSE],ym,log=log)
                                          #unifp <- fgem:::prior_mean(BF,log=log)
    cancer_vec <- rownames(x) %in% cancer_list
    fp <- fgem:::gen_u(datadl$Beta,x,ym,log=log)
    tibble(cancer=cancer, cross_entropy_functional = -log_pbinom(fp,cancer_vec),
           cross_entropy_uniform = -log_pbinom(unifp,cancer_vec),
           cross_entropy_ratio=cross_entropy_functional-cross_entropy_uniform)
  }


#+END_SRC


