docs/fgem.html


<div id="outline-container-orgb5db8fb" class="outline-3">
<h3 id="orgb5db8fb">COSMIC census</h3>
<div class="outline-text-3" id="text-orgb5db8fb">
<p>
From <a href="https://cancer.sanger.ac.uk/census">Cosmic:</a>
</p>
<blockquote>
<p>
The Cancer Gene Census (CGC) is an ongoing effort to catalogue those genes which contain mutations that have been causally implicated in cancer and explain how dysfunction of these genes drives cancer. The content, the structure, and the curation process of the Cancer Gene Census was described and published in Nature Reviews Cancer.
</p>

<p>
The census is not static, instead it is updated when new evidence comes to light. In particular we are grateful to Felix Mitelman and his colleagues in providing information on more genes involved in uncommon translocations in leukaemias and lymphomas. Currently, more than 1% of all human genes are implicated via mutation in cancer. Of these, approximately 90% contain somatic mutations in cancer, 20% bear germline mutations that predispose an individual to cancer and 10% show both somatic and germline mutations.
Census tiers
</p>

<p>
Genes in the Cancer Gene Census are divided into two groups, or tiers.
Tier 1
</p>

<p>
To be classified into Tier 1, a gene must possess a documented activity relevant to cancer, along with evidence of mutations in cancer which change the activity of the gene product in a way that promotes oncogenic transformation. We also consider the existence of somatic mutation patterns across cancer samples gathered in COSMIC. For instance, tumour suppressor genes often show a broad range of inactivating mutations and dominant oncogenes usually demonstrate well defined hotspots of missense mutations. Genes involved in oncogenic fusions are included in Tier 1 when changes to their function caused by the fusion drives oncogenic transformation, or in cases when they provide regulatory elements to their partners (e.g. active promoter or dimerisation domain).
Tier 2
</p>

<p>
A new section of the Census, which consists of genes with strong indications of a role in cancer but with less extensive available evidence. These are generally more recent targets, where the body of evidence supporting their role is still emerging.
Hallmarks
</p>

<p>
New overviews of cancer gene function focused on hallmarks of cancer pull together manually curated information on the function of proteins coded by cancer genes and summarise the data in simple graphical form. They present a condensed overview of most relevant facts with quick access to the literature source, and define whether a gene has a stimulating or suppressive effect via individual cancer hallmarks. Genes with the hallmark descriptions available are marked with the hallmark icon, that when clicked, opens the hallmark page. Hallmark descriptions will be expanded to encompass more genes and updated on regular basis. 
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-R">  <span style="color: #C04040;">library</span>(broom)
  ccols <span style="color: #C04040;">&lt;-</span> cols(
    Gene = col_character(),
    Name = col_skip(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Entrez GeneId`</span> = col_skip(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Genome Location`</span> = col_skip(),
    Tier = col_integer(),
    Hallmark = col_character(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Chr Band`</span> = col_skip(),
    Somatic = col_factor(levels=<span style="color: #FFABAB;">"yes"</span>),
    Germline = col_factor(levels=<span style="color: #FFABAB;">"yes"</span>),
    SomaticTypes = col_character(),
    GermlineTypes = col_character(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Cancer Syndrome`</span> = col_skip(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Tissue Type`</span> = col_skip(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Molecular Genetics`</span> = col_skip(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Role in Cancer`</span> = col_skip(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Mutation Types`</span> = col_skip(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Translocation Partner`</span> = col_skip(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Other Germline Mut`</span> = col_skip(),
    <span style="color: #EDEDE1; background-color: #272C2E;">`Other Syndrome`</span> = col_skip(),
    Synonyms = col_skip()
  )
  cancer_census <span style="color: #C04040;">&lt;-</span> readr::read_csv(<span style="color: #FFABAB;">"data/cancer_gene_census.csv"</span>,col_names=names(ccols$cols),col_types=ccols,skip=1L) <span style="color: #C04040;">%&gt;%</span> 
  mutate(is_census=<span style="color: #99D6FF;">TRUE</span>)

  GO_def <span style="color: #C04040;">&lt;-</span> readRDS(<span style="color: #FFABAB;">"data/GO_Definitions.RDS"</span>) <span style="color: #C04040;">%&gt;%</span> select(feature_name,Term)
  GO_def <span style="color: #C04040;">&lt;-</span> bind_rows(GO_def,tibble(feature_name=<span style="color: #FFABAB;">"Intercept"</span>,Term=<span style="color: #FFABAB;">""</span>)) <span style="color: #C04040;">%&gt;%</span> distinct()
  out_d <span style="color: #C04040;">&lt;-</span> fs::path(<span style="color: #FFABAB;">"data/fdr_models/"</span>)

  all_results <span style="color: #C04040;">&lt;-</span> map_df(fs::dir_ls(out_d),qs::qread) <span style="color: #C04040;">%&gt;%</span>
      select(-term)

  all_results_df <span style="color: #C04040;">&lt;-</span> all_results  <span style="color: #C04040;">%&gt;%</span>
      unnest(data)  <span style="color: #C04040;">%&gt;%</span>
      inner_join(GO_def) <span style="color: #C04040;">%&gt;%</span>
      mutate(label=paste0(feature_name,<span style="color: #FFABAB;">":\n"</span>,Term))




  <span style="color: #FFE203;">gen_go_mat</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(datadl,cancer,cancer_list){
    xm <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(<span style="color: #FFABAB;">"data/x_models/"</span>,cancer,ext=<span style="color: #FFABAB;">"qs"</span>))
    stopifnot(all(datadl$feature_name <span style="color: #C04040;">%in%</span> colnames(xm)))
    x <span style="color: #C04040;">&lt;-</span> xm[,datadl$feature_name,drop=<span style="color: #99D6FF;">FALSE</span>]
    cancer_vec <span style="color: #C04040;">&lt;-</span> rownames(xm) <span style="color: #C04040;">%in%</span> cancer_list
    odf <span style="color: #C04040;">&lt;-</span> as_tibble(x) <span style="color: #C04040;">%&gt;%</span> mutate(cl=as.integer(cancer_vec))
    broom::tidy(glm(cl~.+0,data=odf,family=binomial())) <span style="color: #C04040;">%&gt;%</span>
      rename(feature_name=term)
  }


logit_df <span style="color: #C04040;">&lt;-</span> map2_dfr(all_results$data,all_results$cancer,gen_go_mat,cancer_list=cancer_census$Gene) <span style="color: #C04040;">%&gt;%</span>
    select(cancer,feature_name,pval_fisher=p.value)

  fisher_df <span style="color: #C04040;">&lt;-</span> map2_dfr(all_results$data,all_results$cancer,gen_go_mat,cancer_list=cancer_census$Gene) <span style="color: #C04040;">%&gt;%</span>
    select(cancer,feature_name,pval_fisher=p.value)
  univ_assoc <span style="color: #C04040;">&lt;-</span> readRDS(<span style="color: #FFABAB;">"data/fgem_data.RDS"</span>)  <span style="color: #C04040;">%&gt;%</span> select(cancer,feature_name=trait,pval_logit=pval) <span style="color: #C04040;">%&gt;%</span> 
    inner_join(select(fisher_df,cancer,feature_name,pval_fisher=p.value)) 


  filter(all_results_df,feature_name!=<span style="color: #FFABAB;">"Intercept"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(fgem)
<span style="color: #C04040;">library</span>(tidyverse)

<span style="color: #FFE203;">log_pbinom</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(lp,x){
    sum(x*lp+(1-x)*log(expm1(-lp)))
  }

<span style="color: #FFE203;">prior_post_plot</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(datadl,cancer,log=<span style="color: #99D6FF;">TRUE</span>,cancer_list){
  ym <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(<span style="color: #FFABAB;">"data/y_models/"</span>,cancer,ext=<span style="color: #FFABAB;">"qs"</span>))
  xm <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(<span style="color: #FFABAB;">"data/x_models/"</span>,cancer,ext=<span style="color: #FFABAB;">"qs"</span>))
  stopifnot(all(datadl$feature_name <span style="color: #C04040;">%in%</span> colnames(xm)))
  x <span style="color: #C04040;">&lt;-</span> xm[,datadl$feature_name,drop=<span style="color: #99D6FF;">FALSE</span>]
  unifp <span style="color: #C04040;">&lt;-</span> fgem:::gen_u(fgem:::fgem_null(ym),x[,<span style="color: #FFABAB;">"Intercept"</span>,drop=<span style="color: #99D6FF;">FALSE</span>],ym,log=log)
                                        <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">unifp &lt;- fgem:::prior_mean(BF,log=log)</span>
  cancer_vec <span style="color: #C04040;">&lt;-</span> rownames(x) <span style="color: #C04040;">%in%</span> cancer_list
  fp <span style="color: #C04040;">&lt;-</span> fgem:::gen_u(datadl$Beta,x,ym,log=log)
  tibble(cancer=cancer, cross_entropy_functional = -log_pbinom(fp,cancer_vec),
         cross_entropy_uniform = -log_pbinom(unifp,cancer_vec),
         cross_entropy_ratio=cross_entropy_functional-cross_entropy_uniform)
}


</pre>
</div>
</div>
</div>
