org/fgem.org
** cross-validation

#+BEGIN_SRC R :session fg :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  library(tidyverse)
  #rsync::rsynccli("gardner2:xm/data/new_cv_gobp_models_conservative_relaxed", "data")
#+END_SRC

#+RESULTS:
| x |
|---|
| 0 |



#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
library(tidyverse)
library(fgem)
  file_n <- fs::dir_ls("data/new_cv_gobp_models_conservative_relaxed/")
  safe_r <- safely(qs::qread)
  fit_l <- map(file_n,safe_r) 
  fit_df <- map(fit_l,"result") %>% compact() %>% bind_rows() %>% group_by(cancer)

  fit_df <- map_df(file_n, qs::qread) %>%
    group_by(cancer)

    sfit_df <- fgem:::summarise_cv_lik(fit_df)
    sfit_df <- filter(sfit_df,l2==0) %>% 
  transmute(cancer=cancer,cv_sum0=cv_sum,l0mean0=l0_mean,l1mean0=l1_mean,l2mean0=l2_mean) %>% inner_join(sfit_df)
  sfit_df <- sfit_df %>% mutate(is_max_cv=cv_sum==max(cv_sum),max_l2=l2[is_max_cv])

  GO_def <- readRDS("data/GO_Definitions.RDS") %>%
      select(feature_name, description=Term)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 


  filter(sfit_df,l2>0) %>% 
  ggplot(aes(x=l2_mean,y=cv_sum)) +
    geom_point(aes(col=is_max_cv)) +
    facet_wrap(~cancer, scales = "free") +
    scale_x_log10()

  filter(sfit_df) %>%
    ggplot(aes(x=l2,y=cv_sum)) +
    geom_point(aes(col=is_max_cv)) +
    facet_wrap(~cancer, scales = "free") +
    geom_hline(aes(yintercept=cv_sum0)) +
    scale_x_log10()

  unnest(sfit_df,Beta) %>%
    group_by(cancer, l2, is_max_cv) %>%
    filter(feature_name!="Intercept") %>%
    summarise(max_abs_Beta=max(abs(Beta))) %>% filter(l2>0) %>% 
    ggplot(aes(x=l2,y=max_abs_Beta))+geom_point(aes(col=is_max_cv))+facet_wrap(~cancer,scales="free")+scale_x_log10()

  unnest(sfit_df,Beta) %>%
    filter(feature_name!="Intercept")  %>%
    filter(l2>0 | is_max_cv) %>%
    ggplot(aes(x=l2,y=Beta,col=feature_name))+geom_line()+scale_x_log10()+facet_wrap(~cancer,scales="free")+theme(legend.position = "none")+geom_vline(aes(xintercept=max_l2))
#+END_SRC

#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

  sfit_df %>% 
    mutate(is_max_cv=cv_sum == max(cv_sum)) %>%
    filter(is_max_cv) %>%
    unnest(Beta)  %>%
    filter(Beta != 0) %>%
    filter(feature_name != "Intercept") %>% 
    filter(abs(Beta) == max(abs(Beta)))  %>%
    arrange(desc(abs(Beta)))  %>%
    inner_join(GO_def) %>%
    select(-is_max_cv) %>%
    as.data.frame()
#+END_SRC


*** Subsetting the best models


#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  library(tidyverse)
  library(fgem)
  library(ggrepel)
  library(patchwork)
  ocancer_df <- qs::qread("data/cleanest_driverMAPS_results_20TumorTypes.qs")
  tcancer_df <- ocancer_df %>%   select(Gene,cancer,BF) %>% filter(cancer==cancer[1])
  fgnf <- fgem:::fgem_null_fit(tcancer_df$BF,log_BF=TRUE)
  tpr <- fgem:::predict_fgem(fgnf,fgem:::empty_x(tcancer_df$BF,tcancer_df$Gene),log=TRUE)
  xb <- stats::qlogis(tpr,log.p=TRUE)
  tbf <- fgem:::log_BF2_logpost(tcancer_df$BF,xb)
  cancer_df <-  ocancer_df %>%
    select(Gene,cancer,BF) %>% 
    group_by(cancer) %>%
    mutate(uniform_posterior = c(BF2posterior(BF,Gene,prior=fgem:::predict_uniform_prior(BF,Gene,log_BF=TRUE),log_BF=TRUE)))

  all_genes <- unique(cancer_df$Gene)

  cancer_dfl  <-  group_nest(cancer_df,.key="data")



  go_df <- qs::qread("data/GO_df.qs")
  long_df <- bind_rows(go_df)
  blong_df <- bind_rows(
                        long_df,
                        tibble(Gene=all_genes,feature_name="Intercept"))
  all_def <- bind_rows(mutate(GO_def,category="GO",sub_category="BP"))
  xMS <- fgem:::df2sparse(long_df,total_rownames=all_genes)
#+END_SRC

#+RESULTS:


