docs/fgem.html


<div id="outline-container-orga962dfe" class="outline-3">
<h3 id="orga962dfe">cross-validation</h3>
<div class="outline-text-3" id="text-orga962dfe">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(tidyverse)
<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">rsync::rsynccli("gardner2:xm/data/new_cv_gobp_models_conservative_relaxed", "data")</span>
</pre>
</div>

<table>


<colgroup>
<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">x</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
</tr>
</tbody>
</table>



<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(tidyverse)
<span style="color: #C04040;">library</span>(fgem)
  file_n <span style="color: #C04040;">&lt;-</span> fs::dir_ls(<span style="color: #FFABAB;">"data/new_cv_gobp_models_conservative_relaxed/"</span>)
  safe_r <span style="color: #C04040;">&lt;-</span> safely(qs::qread)
  fit_l <span style="color: #C04040;">&lt;-</span> map(file_n,safe_r) 
  fit_df <span style="color: #C04040;">&lt;-</span> map(fit_l,<span style="color: #FFABAB;">"result"</span>) <span style="color: #C04040;">%&gt;%</span> compact() <span style="color: #C04040;">%&gt;%</span> bind_rows() <span style="color: #C04040;">%&gt;%</span> group_by(cancer)

  fit_df <span style="color: #C04040;">&lt;-</span> map_df(file_n, qs::qread) <span style="color: #C04040;">%&gt;%</span>
    group_by(cancer)

    sfit_df <span style="color: #C04040;">&lt;-</span> fgem:::summarise_cv_lik(fit_df)
    sfit_df <span style="color: #C04040;">&lt;-</span> filter(sfit_df,l2==0) <span style="color: #C04040;">%&gt;%</span> 
  transmute(cancer=cancer,cv_sum0=cv_sum,l0mean0=l0_mean,l1mean0=l1_mean,l2mean0=l2_mean) <span style="color: #C04040;">%&gt;%</span> inner_join(sfit_df)
  sfit_df <span style="color: #C04040;">&lt;-</span> sfit_df <span style="color: #C04040;">%&gt;%</span> mutate(is_max_cv=cv_sum==max(cv_sum),max_l2=l2[is_max_cv])

  GO_def <span style="color: #C04040;">&lt;-</span> readRDS(<span style="color: #FFABAB;">"data/GO_Definitions.RDS"</span>) <span style="color: #C04040;">%&gt;%</span>
      select(feature_name, description=Term)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">

filter(sfit_df,l2&gt;0) <span style="color: #C04040;">%&gt;%</span> 
ggplot(aes(x=l2_mean,y=cv_sum)) +
  geom_point(aes(col=is_max_cv)) +
  facet_wrap(~cancer, scales = <span style="color: #FFABAB;">"free"</span>) +
  scale_x_log10()

filter(sfit_df) <span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=l2,y=cv_sum)) +
  geom_point(aes(col=is_max_cv)) +
  facet_wrap(~cancer, scales = <span style="color: #FFABAB;">"free"</span>) +
  geom_hline(aes(yintercept=cv_sum0)) +
  scale_x_log10()

unnest(sfit_df,Beta) <span style="color: #C04040;">%&gt;%</span>
  group_by(cancer, l2, is_max_cv) <span style="color: #C04040;">%&gt;%</span>
  filter(feature_name!=<span style="color: #FFABAB;">"Intercept"</span>) <span style="color: #C04040;">%&gt;%</span>
  summarise(max_abs_Beta=max(abs(Beta))) <span style="color: #C04040;">%&gt;%</span> filter(l2&gt;0) <span style="color: #C04040;">%&gt;%</span> 
  ggplot(aes(x=l2,y=max_abs_Beta))+geom_point(aes(col=is_max_cv))+facet_wrap(~cancer,scales=<span style="color: #FFABAB;">"free"</span>)+scale_x_log10()

unnest(sfit_df,Beta) <span style="color: #C04040;">%&gt;%</span>
  filter(feature_name!=<span style="color: #FFABAB;">"Intercept"</span>)  <span style="color: #C04040;">%&gt;%</span>
  filter(l2&gt;0 | is_max_cv) <span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=l2,y=Beta,col=feature_name))+geom_line()+scale_x_log10()+facet_wrap(~cancer,scales=<span style="color: #FFABAB;">"free"</span>)+theme(legend.position = <span style="color: #FFABAB;">"none"</span>)+geom_vline(aes(xintercept=max_l2))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
sfit_df <span style="color: #C04040;">%&gt;%</span> 
  mutate(is_max_cv=cv_sum == max(cv_sum)) <span style="color: #C04040;">%&gt;%</span>
  filter(is_max_cv) <span style="color: #C04040;">%&gt;%</span>
  unnest(Beta)  <span style="color: #C04040;">%&gt;%</span>
  filter(Beta != 0) <span style="color: #C04040;">%&gt;%</span>
  filter(feature_name != <span style="color: #FFABAB;">"Intercept"</span>) <span style="color: #C04040;">%&gt;%</span> 
  filter(abs(Beta) == max(abs(Beta)))  <span style="color: #C04040;">%&gt;%</span>
  arrange(desc(abs(Beta)))  <span style="color: #C04040;">%&gt;%</span>
  inner_join(GO_def) <span style="color: #C04040;">%&gt;%</span>
  select(-is_max_cv) <span style="color: #C04040;">%&gt;%</span>
  as.data.frame()
</pre>
</div>
</div>


<div id="outline-container-org3b550bb" class="outline-4">
<h4 id="org3b550bb">Subsetting the best models</h4>
<div class="outline-text-4" id="text-org3b550bb">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(tidyverse)
<span style="color: #C04040;">library</span>(fgem)
<span style="color: #C04040;">library</span>(ggrepel)
<span style="color: #C04040;">library</span>(patchwork)
ocancer_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>)
tcancer_df <span style="color: #C04040;">&lt;-</span> ocancer_df <span style="color: #C04040;">%&gt;%</span>   select(Gene,cancer,BF) <span style="color: #C04040;">%&gt;%</span> filter(cancer==cancer[1])
fgnf <span style="color: #C04040;">&lt;-</span> fgem:::fgem_null_fit(tcancer_df$BF,log_BF=<span style="color: #99D6FF;">TRUE</span>)
tpr <span style="color: #C04040;">&lt;-</span> fgem:::predict_fgem(fgnf,fgem:::empty_x(tcancer_df$BF,tcancer_df$Gene),log=<span style="color: #99D6FF;">TRUE</span>)
xb <span style="color: #C04040;">&lt;-</span> stats::qlogis(tpr,log.p=<span style="color: #99D6FF;">TRUE</span>)
tbf <span style="color: #C04040;">&lt;-</span> fgem:::log_BF2_logpost(tcancer_df$BF,xb)
cancer_df <span style="color: #C04040;">&lt;-</span>  ocancer_df <span style="color: #C04040;">%&gt;%</span>
  select(Gene,cancer,BF) <span style="color: #C04040;">%&gt;%</span> 
  group_by(cancer) <span style="color: #C04040;">%&gt;%</span>
  mutate(uniform_posterior = c(BF2posterior(BF,Gene,prior=fgem:::predict_uniform_prior(BF,Gene,log_BF=<span style="color: #99D6FF;">TRUE</span>),log_BF=<span style="color: #99D6FF;">TRUE</span>)))

all_genes <span style="color: #C04040;">&lt;-</span> unique(cancer_df$Gene)

cancer_dfl  <span style="color: #C04040;">&lt;-</span>  group_nest(cancer_df,.key=<span style="color: #FFABAB;">"data"</span>)



go_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/GO_df.qs"</span>)
long_df <span style="color: #C04040;">&lt;-</span> bind_rows(go_df)
blong_df <span style="color: #C04040;">&lt;-</span> bind_rows(
                      long_df,
                      tibble(Gene=all_genes,feature_name=<span style="color: #FFABAB;">"Intercept"</span>))
all_def <span style="color: #C04040;">&lt;-</span> bind_rows(mutate(GO_def,category=<span style="color: #FFABAB;">"GO"</span>,sub_category=<span style="color: #FFABAB;">"BP"</span>))
xMS <span style="color: #C04040;">&lt;-</span> fgem:::df2sparse(long_df,total_rownames=all_genes)
</pre>
</div>
</div>
</div>
</div>
