org/fgem.org
** IntOGen validation

An alternative source of validation is cite: cite:gonzalez-perez13_intog_mutat_ident_cancer_driver


#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

  comp_df <- read_tsv("data/2020-02-02_IntOGen-Drivers-20200213/Compendium_Cancer_Genes.tsv") 
  cohort_df <- read_tsv("data/2020-02-02_IntOGen-Cohorts-20200213/cohorts.tsv") %>% mutate(is_TCGA=SOURCE=="TCGA")

  is_tcga <- select(cohort_df,cohort=COHORT,is_TCGA) %>% distinct()

  cohort_tcga <- filter(cohort_df,is_TCGA) %>%
    rename(cohort=COHORT) %>%
    mutate(cancer=str_remove(cohort,"TCGA_W.S_")) %>%
    select(intogen_cancer=CANCER_TYPE,cancer)
  #cohort_notcga <- filter(cohort_df,SOURCE!="TCGA") %>% rename(cohort=COHORT)

  sub_comp_df <- select(comp_df,Gene=SYMBOL,cohort=COHORT,intogen_cancer=CANCER_TYPE,qval_cons=QVALUE_COMBINATION) %>%
    inner_join(is_tcga) %>% 
    left_join(cohort_tcga) %>%
    mutate(cancer=if_else(is.na(cancer),intogen_cancer,cancer)) %>%
    select(-intogen_cancer)  %>%
    distinct(cancer,Gene,is_TCGA)


  intogen_l <- nest(sub_comp_df,intogen_l=-cancer)
qs::qsave(intogen_l,"data/intogen_df.qs")

#+END_SRC

#+RESULTS:


#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

  assign_intogen <-  function(data,cancer,include_tcga=TRUE){
    if("intogen_gene" %in% colnames(data)){
      return(data)
      }
        if(!include_tcga){
          scdf <- filter(sub_comp_df,!is_TCGA)
        }else{
          scdf  <- sub_comp_df
        }
        intogen_l <- mutate(scdf,intogen_gene = if_else(cancer == {{cancer}},
                                                               if_else(is_TCGA, 2L, 1L),
                                                               if_else(is_TCGA, 4L, 3L))) %>%
            group_by(Gene) %>%
            summarise(intogen_gene=min(intogen_gene), .groups = "drop")
          rdf <- left_join(data, intogen_l, by="Gene") %>%
            replace_na(list(intogen_gene = 5L))  %>%
            group_by(Gene) %>%
            filter(intogen_gene==min(intogen_gene)) %>%
            slice(1) %>% 
            ungroup()
  return(rdf)
      }

      kt <- c("Known Type-Specific Cancer Gene (Non-TCGA)",
              "Known Type-Specific Cancer Gene (TCGA)",
              "Known Cancer Gene (Non-TCGA)",
              "Known Cancer Gene (TCGA)",
              "Unknown Cancer Gene")

      skt <- c("Type-Specific(Non-TCGA)",
              "Type-Specific(TCGA)",
              "Generic(Non-TCGA)",
              "Generic(TCGA)",
              "Unknown")
  igdf <- tibble(intogen_gene=1:5,
                 IntogenClass=skt) %>% mutate(
                                         TypeSpecific=str_detect(IntogenClass,"Type-Specific"),
                                         isCancer=intogen_gene<5,
                                         is_non_tcga=intogen_gene %in% c(1L,3L))


      group_mapn <- function(.x,.f,...){
        gv <- group_vars(.x)
        .x <- ungroup(.x)
        split(.x,.x[[gv]]) %>% map(.f=.f,...=...)
      }

    cancer_dfl <- nest(cancer_df,data=-cancer) %>% mutate(data=map2(data,cancer,assign_intogen,include_tcga=TRUE))
#+END_SRC

#+RESULTS:


