docs/fgem.html


<div id="outline-container-orgb79c3ee" class="outline-3">
<h3 id="orgb79c3ee">IntOGen validation</h3>
<div class="outline-text-3" id="text-orgb79c3ee">
<p>
An alternative source of validation is cite: (<a href="#citeproc_bib_item_2">Gonzalez-Perez et al. 2013</a>)
</p>


<div class="org-src-container">
<pre class="src src-R">
  comp_df <span style="color: #C04040;">&lt;-</span> read_tsv(<span style="color: #FFABAB;">"data/2020-02-02_IntOGen-Drivers-20200213/Compendium_Cancer_Genes.tsv"</span>) 
  cohort_df <span style="color: #C04040;">&lt;-</span> read_tsv(<span style="color: #FFABAB;">"data/2020-02-02_IntOGen-Cohorts-20200213/cohorts.tsv"</span>) <span style="color: #C04040;">%&gt;%</span> mutate(is_TCGA=SOURCE==<span style="color: #FFABAB;">"TCGA"</span>)

  is_tcga <span style="color: #C04040;">&lt;-</span> select(cohort_df,cohort=COHORT,is_TCGA) <span style="color: #C04040;">%&gt;%</span> distinct()

  cohort_tcga <span style="color: #C04040;">&lt;-</span> filter(cohort_df,is_TCGA) <span style="color: #C04040;">%&gt;%</span>
    rename(cohort=COHORT) <span style="color: #C04040;">%&gt;%</span>
    mutate(cancer=str_remove(cohort,<span style="color: #FFABAB;">"TCGA_W.S_"</span>)) <span style="color: #C04040;">%&gt;%</span>
    select(intogen_cancer=CANCER_TYPE,cancer)
  <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">cohort_notcga &lt;- filter(cohort_df,SOURCE!="TCGA") %&gt;% rename(cohort=COHORT)</span>

  sub_comp_df <span style="color: #C04040;">&lt;-</span> select(comp_df,Gene=SYMBOL,cohort=COHORT,intogen_cancer=CANCER_TYPE,qval_cons=QVALUE_COMBINATION) <span style="color: #C04040;">%&gt;%</span>
    inner_join(is_tcga) <span style="color: #C04040;">%&gt;%</span> 
    left_join(cohort_tcga) <span style="color: #C04040;">%&gt;%</span>
    mutate(cancer=if_else(is.na(cancer),intogen_cancer,cancer)) <span style="color: #C04040;">%&gt;%</span>
    select(-intogen_cancer)  <span style="color: #C04040;">%&gt;%</span>
    distinct(cancer,Gene,is_TCGA)


  intogen_l <span style="color: #C04040;">&lt;-</span> nest(sub_comp_df,intogen_l=-cancer)
qs::qsave(intogen_l,<span style="color: #FFABAB;">"data/intogen_df.qs"</span>)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
<span style="color: #FFE203;">assign_intogen</span> <span style="color: #C04040;">&lt;-</span>  <span style="color: #C8FF03;">function</span>(data,cancer,include_tcga=<span style="color: #99D6FF;">TRUE</span>){
  <span style="color: #C8FF03;">if</span>(<span style="color: #FFABAB;">"intogen_gene"</span> <span style="color: #C04040;">%in%</span> colnames(data)){
    <span style="color: #C8FF03;">return</span>(data)
    }
      <span style="color: #C8FF03;">if</span>(!include_tcga){
        scdf <span style="color: #C04040;">&lt;-</span> filter(sub_comp_df,!is_TCGA)
      }<span style="color: #C8FF03;">else</span>{
        scdf  <span style="color: #C04040;">&lt;-</span> sub_comp_df
      }
      intogen_l <span style="color: #C04040;">&lt;-</span> mutate(scdf,intogen_gene = if_else(cancer == {{cancer}},
                                                             if_else(is_TCGA, 2L, 1L),
                                                             if_else(is_TCGA, 4L, 3L))) <span style="color: #C04040;">%&gt;%</span>
          group_by(Gene) <span style="color: #C04040;">%&gt;%</span>
          summarise(intogen_gene=min(intogen_gene), .groups = <span style="color: #FFABAB;">"drop"</span>)
        rdf <span style="color: #C04040;">&lt;-</span> left_join(data, intogen_l, by=<span style="color: #FFABAB;">"Gene"</span>) <span style="color: #C04040;">%&gt;%</span>
          replace_na(list(intogen_gene = 5L))  <span style="color: #C04040;">%&gt;%</span>
          group_by(Gene) <span style="color: #C04040;">%&gt;%</span>
          filter(intogen_gene==min(intogen_gene)) <span style="color: #C04040;">%&gt;%</span>
          slice(1) <span style="color: #C04040;">%&gt;%</span> 
          ungroup()
<span style="color: #C8FF03;">return</span>(rdf)
    }

    kt <span style="color: #C04040;">&lt;-</span> c(<span style="color: #FFABAB;">"Known Type-Specific Cancer Gene (Non-TCGA)"</span>,
            <span style="color: #FFABAB;">"Known Type-Specific Cancer Gene (TCGA)"</span>,
            <span style="color: #FFABAB;">"Known Cancer Gene (Non-TCGA)"</span>,
            <span style="color: #FFABAB;">"Known Cancer Gene (TCGA)"</span>,
            <span style="color: #FFABAB;">"Unknown Cancer Gene"</span>)

    skt <span style="color: #C04040;">&lt;-</span> c(<span style="color: #FFABAB;">"Type-Specific(Non-TCGA)"</span>,
            <span style="color: #FFABAB;">"Type-Specific(TCGA)"</span>,
            <span style="color: #FFABAB;">"Generic(Non-TCGA)"</span>,
            <span style="color: #FFABAB;">"Generic(TCGA)"</span>,
            <span style="color: #FFABAB;">"Unknown"</span>)
igdf <span style="color: #C04040;">&lt;-</span> tibble(intogen_gene=1:5,
               IntogenClass=skt) <span style="color: #C04040;">%&gt;%</span> mutate(
                                       TypeSpecific=str_detect(IntogenClass,<span style="color: #FFABAB;">"Type-Specific"</span>),
                                       isCancer=intogen_gene&lt;5,
                                       is_non_tcga=intogen_gene <span style="color: #C04040;">%in%</span> c(1L,3L))


    <span style="color: #FFE203;">group_mapn</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(.x,.f,...){
      gv <span style="color: #C04040;">&lt;-</span> group_vars(.x)
      .x <span style="color: #C04040;">&lt;-</span> ungroup(.x)
      split(.x,.x[[gv]]) <span style="color: #C04040;">%&gt;%</span> map(.f=.f,...=...)
    }

  cancer_dfl <span style="color: #C04040;">&lt;-</span> nest(cancer_df,data=-cancer) <span style="color: #C04040;">%&gt;%</span> mutate(data=map2(data,cancer,assign_intogen,include_tcga=<span style="color: #99D6FF;">TRUE</span>))
</pre>
</div>
</div>
