org/fgem.org
*** Predictions from the best models

#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  add_pred <- function(beta_df,cancer_df,log=FALSE){
    ret_df <- mutate(cancer_df, functional_prior = c(fgem:::predict_long_df(beta_df, xMS[cancer_df$Gene,],log=log)),
                     functional_posterior=c(fgem:::BF2posterior(BF, Gene, functional_prior,log_BF=log)))
  }

  log_pbinom <- function(lp,x){
    lp <-   pmin(lp,-.Machine$double.eps)
    sum(x*lp+(1-x)*log(expm1(-lp)))
  }



#+END_SRC



#+RESULTS:



#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  library(firatheme)
    plot_post <- function(data,log=TRUE){

      pdata <-   filter(data
                       ) %>% arrange(desc(functional_posterior-uniform_posterior)) %>%
        mutate(idn=1:n(),
               `intOGen Validation Status`=factor(kt[intogen_gene],levels=kt))

      if(!log){
        pdata <- mutate(pdata,functional_posterior=exp(functional_posterior),
                        uniform_posterior=exp(uniform_posterior))
        fpc <- 1e-05
        fp <- 0.99
        sfp <- 0.9
      }else{
        fpc <- log(1e-05)
        fp <- log(0.99)
        sfp <- log(0.9)
      }
      
      top_diff <- filter(pdata,
                         functional_posterior>fpc) %>% slice(1:25)
      top_g <- filter(pdata, idn>=15, functional_posterior > fp | uniform_posterior > fp) %>%
        group_by(`intOGen Validation Status`) %>% arrange(desc(pmax(functional_posterior,uniform_posterior))) %>% slice(1:15) %>% ungroup()
      ttg <- filter(pdata,intogen_gene==5,functional_posterior > sfp)
      top_g <- bind_rows(top_g,ttg) %>% distinct()

      rp <- pdata %>%
        ggplot(aes(x=uniform_posterior,
                      y=functional_posterior,
                      col = `intOGen Validation Status`,
                      label=Gene)) + 
         geom_point() +
        geom_label_repel(data=top_diff,max.overlaps=10) +
        geom_label_repel(data=top_g,max.overlaps=10) +
        geom_abline(slope=1)


      return(rp)
    }


    plot_beta <- function(Beta, cancer){
      k <- 22
      tBeta <- filter(Beta, feature_name != "Intercept", Beta != 0)
      nr <- ceiling(nrow(tBeta)/k)
      BR <- range(tBeta$Beta)
      l <- nrow(tBeta)
      Beta_p <- tBeta %>% arrange(abs(Beta)) %>%
        mutate(label=str_wrap(paste0(feature_name,":\n",description),width=50),
               label=factor(label,levels=label),Beta_ct=gl(n=nr,k=k,length=l),
               feature_name=factor(feature_name,levels=feature_name),
               idx=1:n())
      ggplot(tail(Beta_p, k),
             aes(y = label, x = Beta)) +
        geom_point() +
        ggtitle(cancer)
    }


  plt_fun <- function(Beta, data, cancer, l0_mean,...){
    l0n <- l0_mean
    pta <- proc.time()
    out_png_e <- fs::path(paste0("org/conservative_","gobp","_enrichment"))
    fs::dir_create(out_png_e)
    out_png_p <- fs::path(paste0("org/conservative_","gobp","_posterior"))
    fs::dir_create(out_png_p)
    lout_png_p <- fs::path(out_png_p,paste0(cancer,"_log"),ext="png")
    out_png_p <- fs::path(out_png_p,cancer,ext="png")
  
    out_png_e <- fs::path(out_png_e,cancer,ext="png")
  
    pa <- plot_beta(Beta,cancer) + theme_fira() + plot_annotation(title=cancer,subtitle=paste0("L0: ",as.integer(l0n)))
    ggsave(out_png_e,pa,dpi=320,width=13.33,height=7.5)
  
    pb <- plot_post(data,log=FALSE) + theme_fira()+ plot_annotation(title=cancer,subtitle=paste0("L0: ",as.integer(l0n)))
    ggsave(out_png_p,pb,dpi=320,width=13.33,height=7.5)
    lpb <- plot_post(data,log=TRUE) + theme_fira()+ plot_annotation(title=cancer,subtitle=paste0("L0: ",as.integer(l0n)))
    ggsave(lout_png_p,lpb,dpi=320,width=13.33,height=7.5)
    return(proc.time()-pta)
  }
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  bf <- filter(sfit_df,is_max_cv) %>% 
    inner_join(cancer_dfl) %>%
    mutate(data=map2(Beta, data,add_pred,log=TRUE),
           Beta=map(Beta,inner_join,y=all_def,by="feature_name")) %>% 
    dplyr::mutate(data = map2(data, cancer, assign_intogen, include_tcga = TRUE))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
library(furrr)
plan(multisession)
future_pmap(bf,plt_fun)

#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  cancer_null <-  group_by(cancer_df,cancer) %>% summarise(null_lik=fgem:::fgem_null_lik(BF,log_BF=TRUE),Intercept=fgem:::fgem_null(BF,log_BF=TRUE))

  feat_df <- qs::qread("data/single_df.qs") %>% select(feature_name,
                                                       cancer,
                                                       univariate_p = pval_fgem,
                                                       fisher_p = pval_fisher_0_1,
                                                       univariate_q = qval_fgem)

  bfdf <- select(feat_df,cancer,feature_name,contains("fisher")) %>% gather(key="cutoff",value="pval",-cancer,-feature_name)

  group_by(bfdf,cancer,cutoff) %>% mutate(pa=p.adjust(pval,"fdr")) %>% group_by(cutoff) %>% summarise(n_sig=mean(pa<0.05)) %>% arrange(desc(n_sig))

  ## feat_df <- map_df(fs::dir_ls("data/fgem_m_results"), qs::qread) %>%
  ##   inner_join(select(cancer_null,-Intercept)) %>%
  ##   mutate(pval=stats::pchisq(-2 * (null_lik - (lik)), df=1, lower.tail=F)) %>%
  ##   group_by(cancer) %>%
  ##   mutate(qval = p.adjust(dplyr::if_else(convergence == 0, pval, 1), method = "fdr")) %>%
  ##   unnest(Beta) %>%
  ##   filter(feature_name != "Intercept") %>%
  ##   

#+END_SRC

#+RESULTS:
| cutoff   |              n_sig |
|----------+--------------------|
| fisher_p | 0.0125872956132648 |

#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/  :colnames yes
head(feature_odf)
#+END_SRC


#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

    post_df <- unnest(select(bf,cancer,data),data) %>%
      mutate(functional_posterior=exp(functional_posterior),
             uniform_posterior=exp(uniform_posterior),
             post_ratio=functional_posterior/uniform_posterior,
             post_diff=functional_posterior-uniform_posterior,
             rank_diff=rank(functional_posterior)-rank(uniform_posterior)) %>% inner_join(igdf)
    pda <- post_df %>% group_by(cancer) %>% summarise(ave_diff_overall=mean(functional_posterior-uniform_posterior))
    ggplot(post_df,aes(x=cancer,y=rank_diff,col=cancer,fill=cancer))+
      facet_wrap(~IntogenClass,scales="free_y")+geom_violin()
    filter(post_df,is_non_tcga | !isCancer) %>% mutate(is_ooc=IntogenClass=="Type-Specific(Non-TCGA)") %>% 
      mutate(rank_unif = rank(uniform_posterior),
             rank_func = rank(functional_posterior),
             rank_diff = rank_func-rank_unif) %>%
      group_by(cancer,is_ooc) %>% 
      summarise(ave_diff=mean()) %>%
      spread(key="is_ooc",value="ave_diff") %>% arrange(desc(`TRUE`-`FALSE`)) 
      spread(key="intogen_gene",value="ave_diff") %>%
      write_tsv("data/posterior_diff.tsv")

    huge_bf <- unnest(select(bf,-data),Beta) %>%
      filter(Beta != 0) %>% 
      inner_join(blong_df) %>%
      inner_join(unnest(select(filter(bf), -Beta), data)) %>%
      mutate(intogen_gene=kt[intogen_gene])

  feature_odf <- unnest(select(bf, -data), Beta)  %>%
    filter(Beta != 0) %>%
      select(cancer, feature_name, Beta, category, sub_category, description) %>%
      inner_join(feat_df) %>%
      arrange(cancer, desc(abs(Beta)))
  BPGOdf <- select(BPGOdf,Gene,feature_name=feature)


  feature_odf <- inner_join(select(feature_odf, cancer, feature_name), BPGOdf) %>% 
    inner_join(cancer_df) %>%
    mutate(uniform_posterior = exp(uniform_posterior)) %>%
    group_by(cancer, feature_name) %>%
    summarise(num_genes = n_distinct(Gene),
              n_sig = sum(uniform_posterior > 0.9)) %>%
    inner_join(feature_odf)

  feature_odf %>%
    write_tsv("data/all_conservative_features.tsv")
#+END_SRC

#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  filter(huge_bf, Beta != 0) %>%
    filter(Beta < 0)

  w_bf <- distinct(huge_bf,Gene,cancer,BF,functional_prior,functional_posterior,uniform_posterior,intogen_gene) %>%
    mutate(uniform_posterior=exp(uniform_posterior),
           functional_posterior=exp(functional_posterior),
           functional_prior=exp(functional_prior)) %>%                                                             
    inner_join(
      filter(huge_bf,Beta!=0) %>% 
      group_by(cancer, Gene,intogen_gene) %>%
      summarise(features=paste0(feature_name,collapse=";"))) %>%
    arrange(cancer,desc(functional_posterior)) %>% 
    write_tsv("data/all_conservative_genes.tsv")

#+END_SRC

#+RESULTS:


