docs/fgem.html


<div id="outline-container-org3f5b869" class="outline-4">
<h4 id="org3f5b869">Predictions from the best models</h4>
<div class="outline-text-4" id="text-org3f5b869">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #FFE203;">add_pred</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(beta_df,cancer_df,log=<span style="color: #99D6FF;">FALSE</span>){
  ret_df <span style="color: #C04040;">&lt;-</span> mutate(cancer_df, functional_prior = c(fgem:::predict_long_df(beta_df, xMS[cancer_df$Gene,],log=log)),
                   functional_posterior=c(fgem:::BF2posterior(BF, Gene, functional_prior,log_BF=log)))
}

<span style="color: #FFE203;">log_pbinom</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(lp,x){
  lp <span style="color: #C04040;">&lt;-</span>   pmin(lp,-.Machine$double.eps)
  sum(x*lp+(1-x)*log(expm1(-lp)))
}



</pre>
</div>



<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(firatheme)
  <span style="color: #FFE203;">plot_post</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(data,log=<span style="color: #99D6FF;">TRUE</span>){

    pdata <span style="color: #C04040;">&lt;-</span>   filter(data
                     ) <span style="color: #C04040;">%&gt;%</span> arrange(desc(functional_posterior-uniform_posterior)) <span style="color: #C04040;">%&gt;%</span>
      mutate(idn=1:n(),
             <span style="color: #EDEDE1; background-color: #272C2E;">`intOGen Validation Status`</span>=factor(kt[intogen_gene],levels=kt))

    <span style="color: #C8FF03;">if</span>(!log){
      pdata <span style="color: #C04040;">&lt;-</span> mutate(pdata,functional_posterior=exp(functional_posterior),
                      uniform_posterior=exp(uniform_posterior))
      fpc <span style="color: #C04040;">&lt;-</span> 1e-05
      fp <span style="color: #C04040;">&lt;-</span> 0.99
      sfp <span style="color: #C04040;">&lt;-</span> 0.9
    }<span style="color: #C8FF03;">else</span>{
      fpc <span style="color: #C04040;">&lt;-</span> log(1e-05)
      fp <span style="color: #C04040;">&lt;-</span> log(0.99)
      sfp <span style="color: #C04040;">&lt;-</span> log(0.9)
    }

    top_diff <span style="color: #C04040;">&lt;-</span> filter(pdata,
                       functional_posterior&gt;fpc) <span style="color: #C04040;">%&gt;%</span> slice(1:25)
    top_g <span style="color: #C04040;">&lt;-</span> filter(pdata, idn&gt;=15, functional_posterior &gt; fp | uniform_posterior &gt; fp) <span style="color: #C04040;">%&gt;%</span>
      group_by(<span style="color: #EDEDE1; background-color: #272C2E;">`intOGen Validation Status`</span>) <span style="color: #C04040;">%&gt;%</span> arrange(desc(pmax(functional_posterior,uniform_posterior))) <span style="color: #C04040;">%&gt;%</span> slice(1:15) <span style="color: #C04040;">%&gt;%</span> ungroup()
    ttg <span style="color: #C04040;">&lt;-</span> filter(pdata,intogen_gene==5,functional_posterior &gt; sfp)
    top_g <span style="color: #C04040;">&lt;-</span> bind_rows(top_g,ttg) <span style="color: #C04040;">%&gt;%</span> distinct()

    rp <span style="color: #C04040;">&lt;-</span> pdata <span style="color: #C04040;">%&gt;%</span>
      ggplot(aes(x=uniform_posterior,
                    y=functional_posterior,
                    col = <span style="color: #EDEDE1; background-color: #272C2E;">`intOGen Validation Status`</span>,
                    label=Gene)) + 
       geom_point() +
      geom_label_repel(data=top_diff,max.overlaps=10) +
      geom_label_repel(data=top_g,max.overlaps=10) +
      geom_abline(slope=1)


    <span style="color: #C8FF03;">return</span>(rp)
  }


  <span style="color: #FFE203;">plot_beta</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(Beta, cancer){
    k <span style="color: #C04040;">&lt;-</span> 22
    tBeta <span style="color: #C04040;">&lt;-</span> filter(Beta, feature_name != <span style="color: #FFABAB;">"Intercept"</span>, Beta != 0)
    nr <span style="color: #C04040;">&lt;-</span> ceiling(nrow(tBeta)/k)
    BR <span style="color: #C04040;">&lt;-</span> range(tBeta$Beta)
    l <span style="color: #C04040;">&lt;-</span> nrow(tBeta)
    Beta_p <span style="color: #C04040;">&lt;-</span> tBeta <span style="color: #C04040;">%&gt;%</span> arrange(abs(Beta)) <span style="color: #C04040;">%&gt;%</span>
      mutate(label=str_wrap(paste0(feature_name,<span style="color: #FFABAB;">":\n"</span>,description),width=50),
             label=factor(label,levels=label),Beta_ct=gl(n=nr,k=k,length=l),
             feature_name=factor(feature_name,levels=feature_name),
             idx=1:n())
    ggplot(tail(Beta_p, k),
           aes(y = label, x = Beta)) +
      geom_point() +
      ggtitle(cancer)
  }


<span style="color: #FFE203;">plt_fun</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(Beta, data, cancer, l0_mean,...){
  l0n <span style="color: #C04040;">&lt;-</span> l0_mean
  pta <span style="color: #C04040;">&lt;-</span> proc.time()
  out_png_e <span style="color: #C04040;">&lt;-</span> fs::path(paste0(<span style="color: #FFABAB;">"org/conservative_"</span>,<span style="color: #FFABAB;">"gobp"</span>,<span style="color: #FFABAB;">"_enrichment"</span>))
  fs::dir_create(out_png_e)
  out_png_p <span style="color: #C04040;">&lt;-</span> fs::path(paste0(<span style="color: #FFABAB;">"org/conservative_"</span>,<span style="color: #FFABAB;">"gobp"</span>,<span style="color: #FFABAB;">"_posterior"</span>))
  fs::dir_create(out_png_p)
  lout_png_p <span style="color: #C04040;">&lt;-</span> fs::path(out_png_p,paste0(cancer,<span style="color: #FFABAB;">"_log"</span>),ext=<span style="color: #FFABAB;">"png"</span>)
  out_png_p <span style="color: #C04040;">&lt;-</span> fs::path(out_png_p,cancer,ext=<span style="color: #FFABAB;">"png"</span>)

  out_png_e <span style="color: #C04040;">&lt;-</span> fs::path(out_png_e,cancer,ext=<span style="color: #FFABAB;">"png"</span>)

  pa <span style="color: #C04040;">&lt;-</span> plot_beta(Beta,cancer) + theme_fira() + plot_annotation(title=cancer,subtitle=paste0(<span style="color: #FFABAB;">"L0: "</span>,as.integer(l0n)))
  ggsave(out_png_e,pa,dpi=320,width=13.33,height=7.5)

  pb <span style="color: #C04040;">&lt;-</span> plot_post(data,log=<span style="color: #99D6FF;">FALSE</span>) + theme_fira()+ plot_annotation(title=cancer,subtitle=paste0(<span style="color: #FFABAB;">"L0: "</span>,as.integer(l0n)))
  ggsave(out_png_p,pb,dpi=320,width=13.33,height=7.5)
  lpb <span style="color: #C04040;">&lt;-</span> plot_post(data,log=<span style="color: #99D6FF;">TRUE</span>) + theme_fira()+ plot_annotation(title=cancer,subtitle=paste0(<span style="color: #FFABAB;">"L0: "</span>,as.integer(l0n)))
  ggsave(lout_png_p,lpb,dpi=320,width=13.33,height=7.5)
  <span style="color: #C8FF03;">return</span>(proc.time()-pta)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">bf <span style="color: #C04040;">&lt;-</span> filter(sfit_df,is_max_cv) <span style="color: #C04040;">%&gt;%</span> 
  inner_join(cancer_dfl) <span style="color: #C04040;">%&gt;%</span>
  mutate(data=map2(Beta, data,add_pred,log=<span style="color: #99D6FF;">TRUE</span>),
         Beta=map(Beta,inner_join,y=all_def,by=<span style="color: #FFABAB;">"feature_name"</span>)) <span style="color: #C04040;">%&gt;%</span> 
  dplyr::mutate(data = map2(data, cancer, assign_intogen, include_tcga = <span style="color: #99D6FF;">TRUE</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(furrr)
plan(multisession)
future_pmap(bf,plt_fun)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">cancer_null <span style="color: #C04040;">&lt;-</span>  group_by(cancer_df,cancer) <span style="color: #C04040;">%&gt;%</span> summarise(null_lik=fgem:::fgem_null_lik(BF,log_BF=<span style="color: #99D6FF;">TRUE</span>),Intercept=fgem:::fgem_null(BF,log_BF=<span style="color: #99D6FF;">TRUE</span>))

feat_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/single_df.qs"</span>) <span style="color: #C04040;">%&gt;%</span> select(feature_name,
                                                     cancer,
                                                     univariate_p = pval_fgem,
                                                     fisher_p = pval_fisher_0_1,
                                                     univariate_q = qval_fgem)

bfdf <span style="color: #C04040;">&lt;-</span> select(feat_df,cancer,feature_name,contains(<span style="color: #FFABAB;">"fisher"</span>)) <span style="color: #C04040;">%&gt;%</span> gather(key=<span style="color: #FFABAB;">"cutoff"</span>,value=<span style="color: #FFABAB;">"pval"</span>,-cancer,-feature_name)

group_by(bfdf,cancer,cutoff) <span style="color: #C04040;">%&gt;%</span> mutate(pa=p.adjust(pval,<span style="color: #FFABAB;">"fdr"</span>)) <span style="color: #C04040;">%&gt;%</span> group_by(cutoff) <span style="color: #C04040;">%&gt;%</span> summarise(n_sig=mean(pa&lt;0.05)) <span style="color: #C04040;">%&gt;%</span> arrange(desc(n_sig))

<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">feat_df &lt;- map_df(fs::dir_ls("data/fgem_m_results"), qs::qread) %&gt;%</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">inner_join(select(cancer_null,-Intercept)) %&gt;%</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">mutate(pval=stats::pchisq(-2 * (null_lik - (lik)), df=1, lower.tail=F)) %&gt;%</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">group_by(cancer) %&gt;%</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">mutate(qval = p.adjust(dplyr::if_else(convergence == 0, pval, 1), method = "fdr")) %&gt;%</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">unnest(Beta) %&gt;%</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">filter(feature_name != "Intercept") %&gt;%</span>
<span style="color: #5D6A70;">##   </span>

</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">cutoff</th>
<th scope="col" class="org-right">n<sub>sig</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">fisher<sub>p</sub></td>
<td class="org-right">0.0125872956132648</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-R">head(feature_odf)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-R">
  post_df <span style="color: #C04040;">&lt;-</span> unnest(select(bf,cancer,data),data) <span style="color: #C04040;">%&gt;%</span>
    mutate(functional_posterior=exp(functional_posterior),
           uniform_posterior=exp(uniform_posterior),
           post_ratio=functional_posterior/uniform_posterior,
           post_diff=functional_posterior-uniform_posterior,
           rank_diff=rank(functional_posterior)-rank(uniform_posterior)) <span style="color: #C04040;">%&gt;%</span> inner_join(igdf)
  pda <span style="color: #C04040;">&lt;-</span> post_df <span style="color: #C04040;">%&gt;%</span> group_by(cancer) <span style="color: #C04040;">%&gt;%</span> summarise(ave_diff_overall=mean(functional_posterior-uniform_posterior))
  ggplot(post_df,aes(x=cancer,y=rank_diff,col=cancer,fill=cancer))+
    facet_wrap(~IntogenClass,scales=<span style="color: #FFABAB;">"free_y"</span>)+geom_violin()
  filter(post_df,is_non_tcga | !isCancer) <span style="color: #C04040;">%&gt;%</span> mutate(is_ooc=IntogenClass==<span style="color: #FFABAB;">"Type-Specific(Non-TCGA)"</span>) <span style="color: #C04040;">%&gt;%</span> 
    mutate(rank_unif = rank(uniform_posterior),
           rank_func = rank(functional_posterior),
           rank_diff = rank_func-rank_unif) <span style="color: #C04040;">%&gt;%</span>
    group_by(cancer,is_ooc) <span style="color: #C04040;">%&gt;%</span> 
    summarise(ave_diff=mean()) <span style="color: #C04040;">%&gt;%</span>
    spread(key=<span style="color: #FFABAB;">"is_ooc"</span>,value=<span style="color: #FFABAB;">"ave_diff"</span>) <span style="color: #C04040;">%&gt;%</span> arrange(desc(<span style="color: #EDEDE1; background-color: #272C2E;">`TRUE`</span>-<span style="color: #EDEDE1; background-color: #272C2E;">`FALSE`</span>)) 
    spread(key=<span style="color: #FFABAB;">"intogen_gene"</span>,value=<span style="color: #FFABAB;">"ave_diff"</span>) <span style="color: #C04040;">%&gt;%</span>
    write_tsv(<span style="color: #FFABAB;">"data/posterior_diff.tsv"</span>)

  huge_bf <span style="color: #C04040;">&lt;-</span> unnest(select(bf,-data),Beta) <span style="color: #C04040;">%&gt;%</span>
    filter(Beta != 0) <span style="color: #C04040;">%&gt;%</span> 
    inner_join(blong_df) <span style="color: #C04040;">%&gt;%</span>
    inner_join(unnest(select(filter(bf), -Beta), data)) <span style="color: #C04040;">%&gt;%</span>
    mutate(intogen_gene=kt[intogen_gene])

feature_odf <span style="color: #C04040;">&lt;-</span> unnest(select(bf, -data), Beta)  <span style="color: #C04040;">%&gt;%</span>
  filter(Beta != 0) <span style="color: #C04040;">%&gt;%</span>
    select(cancer, feature_name, Beta, category, sub_category, description) <span style="color: #C04040;">%&gt;%</span>
    inner_join(feat_df) <span style="color: #C04040;">%&gt;%</span>
    arrange(cancer, desc(abs(Beta)))
BPGOdf <span style="color: #C04040;">&lt;-</span> select(BPGOdf,Gene,feature_name=feature)


feature_odf <span style="color: #C04040;">&lt;-</span> inner_join(select(feature_odf, cancer, feature_name), BPGOdf) <span style="color: #C04040;">%&gt;%</span> 
  inner_join(cancer_df) <span style="color: #C04040;">%&gt;%</span>
  mutate(uniform_posterior = exp(uniform_posterior)) <span style="color: #C04040;">%&gt;%</span>
  group_by(cancer, feature_name) <span style="color: #C04040;">%&gt;%</span>
  summarise(num_genes = n_distinct(Gene),
            n_sig = sum(uniform_posterior &gt; 0.9)) <span style="color: #C04040;">%&gt;%</span>
  inner_join(feature_odf)

feature_odf <span style="color: #C04040;">%&gt;%</span>
  write_tsv(<span style="color: #FFABAB;">"data/all_conservative_features.tsv"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">filter(huge_bf, Beta != 0) <span style="color: #C04040;">%&gt;%</span>
  filter(Beta &lt; 0)

w_bf <span style="color: #C04040;">&lt;-</span> distinct(huge_bf,Gene,cancer,BF,functional_prior,functional_posterior,uniform_posterior,intogen_gene) <span style="color: #C04040;">%&gt;%</span>
  mutate(uniform_posterior=exp(uniform_posterior),
         functional_posterior=exp(functional_posterior),
         functional_prior=exp(functional_prior)) <span style="color: #C04040;">%&gt;%</span>                                                             
  inner_join(
    filter(huge_bf,Beta!=0) <span style="color: #C04040;">%&gt;%</span> 
    group_by(cancer, Gene,intogen_gene) <span style="color: #C04040;">%&gt;%</span>
    summarise(features=paste0(feature_name,collapse=<span style="color: #FFABAB;">";"</span>))) <span style="color: #C04040;">%&gt;%</span>
  arrange(cancer,desc(functional_posterior)) <span style="color: #C04040;">%&gt;%</span> 
  write_tsv(<span style="color: #FFABAB;">"data/all_conservative_genes.tsv"</span>)

</pre>
</div>
</div>
</div>
</div>
