org/fgem.org
** The case of GBM

GBM has a feature with a very high value of $\beta$.  Let's take a closer look
#+BEGIN_SRC R :session gbm :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  library(tidyverse)
  library(fgem)
  ogbm_cv_df <- qs::qread("data/cv_elasticnet_models/GBM.qs")
  ## filter(ogbm_cv_df,lambda>0,l1n>1) %>%
  ##   ggplot(aes(x=lambda,y=cv_lik)) +
  ##   geom_point() +
  ##   facet_wrap(~cv_i, scales = "free_y") +
  ##   scale_x_log10()
  gbm_cv_df <- fgem:::summarise_cv_lik(ogbm_cv_df)
  cancer <- "GBM"
  ocancer_df <- qs::qread("data/cleanest_driverMAPS_results_20TumorTypes.qs")  %>% filter(cancer=={{cancer}})
  all_genes <- unique(ocancer_df$Gene)
  go_df <- qs::qread("data/GO_df.qs")
  long_df <- go_df
  blong_df <- bind_rows(
    long_df,
    tibble(Gene=all_genes,feature_name="Intercept"))
    GO_def <- readRDS("data/GO_Definitions.RDS") %>%
      select(feature_name,description=Term)


    all_def <- bind_rows(mutate(GO_def,category="GO",sub_category="BP")
                         )
  xGO <- fgem:::df2sparse(long_df,total_rownames=all_genes)
  xGO <- xGO[ocancer_df$Gene,]
  ym <- ocancer_df$BF

  nX <- nrow(xGO)
#+END_SRC

#+RESULTS:
: 20038

#+BEGIN_SRC R :session gbm :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

  grad_relaxf <- function(Bdf,l2){
    bf <- Bdf$feature_name[Bdf$feature_name!="Intercept"]
    ix <- xGO[,bf]
    pr <- l2*length(ym)

    progressr::with_progress({
      cv_rfit <- cv_fgem(ix,ym,log_BF=TRUE,stratify_BF=FALSE,alpha=0)
    })


    rrfitt <- fgem:::fgem_elasticnet(ix,ym,log_BF=TRUE,alpha=0,lambda=0,verbose=TRUE)
    rfs <- fgem:::summarise_cv_lik(cv_rfit)

    tgr <- fgem:::fgem_grad.dgCMatrix(rrfitt$Beta,ix,ym,prec=0,log_BF=TRUE)
    gr <- fgem:::fgem_grad.dgCMatrix(Bdf$Beta,ix,ym,prec=l2*nX,log_BF=TRUE)
    mutate(Bdf,grad=gr)
  }

  tight_Beta <- filter(gbm_cv_df,cv_sum==max(cv_sum)) %>% unnest(Beta) %>% filter(Beta!=0) %>% arrange(desc(abs(Beta)))

 
    ## fisher_df <- qs::qread("data/cleanest_single_fisher_cutoffs.qs") %>%
    ##     dplyr::select(cancer,
    ##                   feature_name,
    ##                   pval = p.value,cutoff) %>%
    ##   mutate(cutoff=paste0("pval_fisher_",stringr::str_replace(cutoff,"\\.","_")))%>% spread(key="cutoff",value="pval")

med_BF <- apply(xGO,2,function(x){
  median(eym[x==1])
})
mean_BF <- apply(xGO,2,function(x){
  mean(eym[x==1])
})
min_BF <- apply(xGO,2,function(x){
  min(eym[x==1])
})

max_BF <- apply(xGO,2,function(x){
  max(eym[x==1])
})

perc_p <- apply(xGO,2,function(x){
  mean(ym[x==1]>0)
})



med_lBF <- apply(xGO,2,function(x){
  median(ym[x==1])
})
mean_lBF <- apply(xGO,2,function(x){
  mean(ym[x==1])
})


mean_plBF <- apply(xGO,2,function(x){
  ty <- ym[x==1]
  mean(ty[ty>0])
})
mean_nlBF <- apply(xGO,2,function(x){
  ty <- ym[x==1]
  mean(ty[ty<0])
})


mean_pBF <- apply(xGO,2,function(x){
  ty <- eym[x==1]
  mean(ty[ty>1])
})
mean_nBF <- apply(xGO,2,function(x){
  ty <- eym[x==1]
  mean(ty[ty<1])
})



min_lBF <- apply(xGO,2,function(x){
  min(ym[x==1])
})

max_lBF <- apply(xGO,2,function(x){
  max(ym[x==1])
})


x_df <- tibble(feature_name=names(med_BF),
               med_BF,
               mean_BF,
               min_BF,
               max_BF,
               med_lBF,
               mean_lBF,
               min_lBF,
               max_lBF,
               perc_p,
               mean_plBF,
               mean_nlBF,
               mean_pBF,
               mean_nBF,
               sum_X=apply(xGO,2,sum)
               ) %>% inner_join(select(fgem_results, feature_name, estimate_fgem, Intercept, pval_fgem, qval_fgem, lik), by = "feature_name") %>%
  arrange(desc(estimate_fgem))


#+END_SRC

#+BEGIN_SRC R :session gbm :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 



  fgem_results <- qs::qread("data/alt_new_fgem_marginal_results.qs") %>%
    mutate(trait = map_chr(Beta, ~.x$feature_name[2])) %>%
    unnest(Beta) %>% 
    mutate(feature_name = dplyr::if_else(feature_name == "Intercept", "Intercept", "estimate_fgem")) %>%
    spread(key = "feature_name", value = "Beta") %>%
    rename(feature_name=trait, pval_fgem = pval, qval_fgem = qval) %>%
    filter(cancer=="GBM")

   bad_feat <- filter(fgem_results,estimate_fgem>10) %>% pull(feature_name)
   tX <- as.matrix(xGO[ocancer_df$Gene,bad_feat,drop=FALSE])

  tpfun <- function(B,x,b){
    xb <- b[1] +  x%*%b[-1]
    exp
    B + (1 - B)/(1 + exp()
  }


  marr <- fgem:::fgem_marginal(tX,ym,log_BF=TRUE,max_iter=150,grad=TRUE,hess=TRUE)

  marr_h <- map(marr$Beta,~.x$hessian)
  dets <- map_dbl(marr_h,det)

  mardf <- marr %>%
    mutate(trait = map_chr(Beta, ~.x$feature_name[2])) %>%
    mutate(det= map_dbl(Beta,~det(.x$hessian))) %>% 
    unnest(Beta) %>% select(-hessian) %>% 
    mutate(feature_name = dplyr::if_else(feature_name == "Intercept", "Intercept", "fgem")) %>%
    pivot_wider(names_from = "feature_name", values_from = c("Beta","gradient")) %>%
    rename(feature_name=trait) %>%
    select(feature_name,lik,Beta=Beta_fgem,Intercept=Beta_Intercept,grad_fgem=gradient_fgem,grad_int=gradient_Intercept,time,pval,sum_X,l2n,sum_X,det) %>% arrange(feature_name)

   univr <- unnest(rrfitt,Beta)
   tpI <- rnorm(3500,mean=univr$Beta[1],sd=0)
   tpB <- rnorm(3500,mean=univr$Beta[2],sd=1)

   eym <- exp(ym)
   lik <- map2_dbl(tpI,tpB,function(x,y){
     fgem:::fgem_lik_stan(c(x,y),tX,exp(ym),log_BF=FALSE)
   })
   prior_mat <- mapply(function(x,y){
     stats::plogis(c(y*tX)+x)
   },tpI,tpB)

   lik_mat <- apply(prior_mat,2,function(x){
     log(x*eym+(1-x))
   })

   rownames(lik_mat) <- rownames(tX)
   names(eym) <- rownames(tX)
   lik_df <- as_tibble(lik_mat,rownames="Gene") %>%
     gather(key="Beta",value="Lik",-Gene) %>%
     mutate(Beta=tpB[as.integer(stringr::str_remove(Beta,"V"))],
            )
   lik_df <- mutate(lik_df,BF=eym[Gene])
   lik_df <- mutate(lik_df,has_feat=tX[Gene,1]==1)
   hc <- topo.colors(20, alpha = 1, rev = FALSE)
   hl_df <- filter(lik_df,has_feat)  %>% group_by(Gene) %>% mutate(grad=(Lik-lead(Lik))/(Beta-lead(Beta))) %>% ungroup() %>%
     mutate(BF_bin=hc[as.integer(cut_interval(log10(BF), n=20))])
            grad_bin=hc[as.integer(cut_number(grad, n=20))])
   with(hl_df,plot3d(Beta,log10(BF),lik,col=grad_bin))

   feat_df <- distinct(lik_df,Gene,BF,has_feat)
   group_by(lik_df,has_feat,Beta) %>% summarise(Lik=sum(Lik)) %>% ggplot(aes(x=Beta,y=Lik,col=has_feat))+geom_point()+facet_wrap(~has_feat,scales="free_y")+ggtitle("Likelihood with varying Beta","With or without feature")
   filter(lik_df,has_feat)  %>%
     mutate(pos_BF=BF>1) %>%
     group_by(Beta) %>%
     summarise(mean_lik=mean(Lik),min_lik=min(Lik),max_lik=max(Lik)) %>%
     ggplot(aes(x=Beta,y=mean_lik))+geom_point()
   +geom_ribbon(aes(x=Beta,ymin=min_lik,ymax=max_lik,col=pos_BF,fill=pos_BF),alpha=0.2) +
     ggtitle(paste0("Per-Gene Likelihood for ",tf," Genes"),"Stratified by whether BF>1")
   ggsave("~/tmp/per_gene.png")
   diff_mat <- (cbind(lik_mat[,-1],0)-lik_mat)[,-ncol(lik_mat)]
   diff_mat_g <- diff_mat[tX==1,]
   diff_mat_neg <- diff_mat_g[wmd[,1],]

   fgrad <- mapply(function(x,y){
     fgem:::fgem_grad_stan(c(x,y),tX,exp(ym),log_BF=FALSE)
   },x=tpI,y=tpB)

   grad_df <- tibble(Beta=tpB,Intercept=tpI,Intercept_grad=fgrad[1,],Beta_grad=fgrad[2,],lik=lik) %>%
     mutate(lik_bin=hc[as.integer(cut_number(lik, n=20))],
            beta_grad_bin=hc[as.integer(cut_interval(Beta_grad, n=20))])
   ## #mutate(grad_df, Beta_bin=cut_number(Beta, n=20)) %>%  ggplot(aes(x=Beta_bin,y=lik,group=Beta_bin))+geom_violin()
   ## #ggplot(grad_df,aes(x=Intercept,y=lik))+geom_point()

   ## of <- optim(par=runif(2),gr=fgem:::fgem_grad_stan,fgem:::fgem_lik_stan,X=tX,BF=exp(ym),log_BF=FALSE,prec=0,neg=TRUE)
   ## theta=0 
   ## phi=20
   ## ggplot(grad_df,aes(x=Beta,y=Intercept,z=lik))+theme_void()+axes_3D(theta=theta, phi=phi) +
   ##   stat_3D(theta=theta, phi=phi)
   grad_df <- arrange(grad_df,Beta)
   tgrad_df <- filter(grad_df,Beta<20)
   with(tgrad_df,plot3d(Beta,Intercept,lik,col=beta_grad_bin))

   ggplot(tgrad_df,aes(x=Beta,y=lik,col=Beta_grad))+scale_color_gradient2(trans="log")+geom_point()+ggtitle("Beta vs Likelihood for GO:0050911","Colored by gradient wrt Beta")+ylab("Marginalized Log-Likelihood")
   ggsave(filename="~/tmp/llk.png")
   tr <- mutate(gbm_cv_df,Beta=purrr::map2(Beta,group_l2,grad_f))

#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session gbm :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 



  g
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session gbm :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  with_progress({
    cv_df <- dplyr::mutate(cv_fgem(X,ym,alpha=0.8,stratify_BF=TRUE),cancer=cancer)
  })
  filter(cv_df,lambda>0,l1n>1) %>%
    ggplot(aes(x=lambda,y=cv_lik)) +
    geom_point() +
    facet_wrap(~cv_i,scales="free_y") +
    scale_x_log10()


  scv_df <- fgem:::summarise_cv_lik(cv_df)
  with_progress({
    ccv_df <- dplyr::mutate(cv_fgem(X,ym,alpha=0.8,stratify_BF=FALSE),cancer=cancer)
  })

  with_progress({
    lcv_df <- dplyr::mutate(cv_fgem(X,log(ym),alpha=0.8,stratify_BF=FALSE,log_BF=TRUE),cancer=cancer)
  })
  slcv_df <- fgem:::summarise_cv_lik(lcv_df)
  filter(ccv_df,lambda>0,l1n>1) %>%
    ggplot(aes(x=lambda,y=cv_lik)) +
    geom_point() +
    facet_wrap(~cv_i,scales="free_y") +
    scale_x_log10()

  sccv_df <- fgem:::summarise_cv_lik(ccv_df)
  sccv_df <- inner_join(mutate(sccv_df,ia=NA),
                        filter(sccv_df,cv_sum==max(cv_sum)) %>% transmute(ia=NA,best_group_l1=group_l1,best_group_l2=group_l2,best_cv=cv_sum)) %>% select(-ia)

  filter(sccv_df,group_l1>0) %>%
    ggplot(aes(x=group_l1, y=cv_sum, col=cv_sum==max(cv_sum)))+geom_point()+scale_x_log10()+geom_vline(aes(xintercept=best_group_l1))

  best_gbm <- filter(sccv_df,cv_sum==max(cv_sum))

  qs::qsave(cv_df, op)



#+END_SRC



