docs/fgem.html


<div id="outline-container-orgfd2863e" class="outline-3">
<h3 id="orgfd2863e">The case of GBM</h3>
<div class="outline-text-3" id="text-orgfd2863e">
<p>
GBM has a feature with a very high value of \(\beta\).  Let's take a closer look
</p>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(tidyverse)
<span style="color: #C04040;">library</span>(fgem)
ogbm_cv_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cv_elasticnet_models/GBM.qs"</span>)
<span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">filter(ogbm_cv_df,lambda&gt;0,l1n&gt;1) %&gt;%</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">ggplot(aes(x=lambda,y=cv_lik)) +</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">geom_point() +</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">facet_wrap(~cv_i, scales = "free_y") +</span>
<span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">scale_x_log10()</span>
gbm_cv_df <span style="color: #C04040;">&lt;-</span> fgem:::summarise_cv_lik(ogbm_cv_df)
cancer <span style="color: #C04040;">&lt;-</span> <span style="color: #FFABAB;">"GBM"</span>
ocancer_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/cleanest_driverMAPS_results_20TumorTypes.qs"</span>)  <span style="color: #C04040;">%&gt;%</span> filter(cancer=={{cancer}})
all_genes <span style="color: #C04040;">&lt;-</span> unique(ocancer_df$Gene)
go_df <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/GO_df.qs"</span>)
long_df <span style="color: #C04040;">&lt;-</span> go_df
blong_df <span style="color: #C04040;">&lt;-</span> bind_rows(
  long_df,
  tibble(Gene=all_genes,feature_name=<span style="color: #FFABAB;">"Intercept"</span>))
  GO_def <span style="color: #C04040;">&lt;-</span> readRDS(<span style="color: #FFABAB;">"data/GO_Definitions.RDS"</span>) <span style="color: #C04040;">%&gt;%</span>
    select(feature_name,description=Term)


  all_def <span style="color: #C04040;">&lt;-</span> bind_rows(mutate(GO_def,category=<span style="color: #FFABAB;">"GO"</span>,sub_category=<span style="color: #FFABAB;">"BP"</span>)
                       )
xGO <span style="color: #C04040;">&lt;-</span> fgem:::df2sparse(long_df,total_rownames=all_genes)
xGO <span style="color: #C04040;">&lt;-</span> xGO[ocancer_df$Gene,]
ym <span style="color: #C04040;">&lt;-</span> ocancer_df$BF

nX <span style="color: #C04040;">&lt;-</span> nrow(xGO)
</pre>
</div>

<pre class="example">
20038

</pre>

<div class="org-src-container">
<pre class="src src-R">
  <span style="color: #FFE203;">grad_relaxf</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(Bdf,l2){
    bf <span style="color: #C04040;">&lt;-</span> Bdf$feature_name[Bdf$feature_name!=<span style="color: #FFABAB;">"Intercept"</span>]
    ix <span style="color: #C04040;">&lt;-</span> xGO[,bf]
    pr <span style="color: #C04040;">&lt;-</span> l2*length(ym)

    progressr::with_progress({
      cv_rfit <span style="color: #C04040;">&lt;-</span> cv_fgem(ix,ym,log_BF=<span style="color: #99D6FF;">TRUE</span>,stratify_BF=<span style="color: #99D6FF;">FALSE</span>,alpha=0)
    })


    rrfitt <span style="color: #C04040;">&lt;-</span> fgem:::fgem_elasticnet(ix,ym,log_BF=<span style="color: #99D6FF;">TRUE</span>,alpha=0,lambda=0,verbose=<span style="color: #99D6FF;">TRUE</span>)
    rfs <span style="color: #C04040;">&lt;-</span> fgem:::summarise_cv_lik(cv_rfit)

    tgr <span style="color: #C04040;">&lt;-</span> fgem:::fgem_grad.dgCMatrix(rrfitt$Beta,ix,ym,prec=0,log_BF=<span style="color: #99D6FF;">TRUE</span>)
    gr <span style="color: #C04040;">&lt;-</span> fgem:::fgem_grad.dgCMatrix(Bdf$Beta,ix,ym,prec=l2*nX,log_BF=<span style="color: #99D6FF;">TRUE</span>)
    mutate(Bdf,grad=gr)
  }

  tight_Beta <span style="color: #C04040;">&lt;-</span> filter(gbm_cv_df,cv_sum==max(cv_sum)) <span style="color: #C04040;">%&gt;%</span> unnest(Beta) <span style="color: #C04040;">%&gt;%</span> filter(Beta!=0) <span style="color: #C04040;">%&gt;%</span> arrange(desc(abs(Beta)))


    <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">fisher_df &lt;- qs::qread("data/cleanest_single_fisher_cutoffs.qs") %&gt;%</span>
    <span style="color: #5D6A70;">##     </span><span style="color: #5D6A70;">dplyr::select(cancer,</span>
    <span style="color: #5D6A70;">##                   </span><span style="color: #5D6A70;">feature_name,</span>
    <span style="color: #5D6A70;">##                   </span><span style="color: #5D6A70;">pval = p.value,cutoff) %&gt;%</span>
    <span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">mutate(cutoff=paste0("pval_fisher_",stringr::str_replace(cutoff,"\\.","_")))%&gt;% spread(key="cutoff",value="pval")</span>

med_BF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  median(eym[x==1])
})
mean_BF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  mean(eym[x==1])
})
min_BF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  min(eym[x==1])
})

max_BF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  max(eym[x==1])
})

perc_p <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  mean(ym[x==1]&gt;0)
})



med_lBF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  median(ym[x==1])
})
mean_lBF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  mean(ym[x==1])
})


mean_plBF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  ty <span style="color: #C04040;">&lt;-</span> ym[x==1]
  mean(ty[ty&gt;0])
})
mean_nlBF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  ty <span style="color: #C04040;">&lt;-</span> ym[x==1]
  mean(ty[ty&lt;0])
})


mean_pBF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  ty <span style="color: #C04040;">&lt;-</span> eym[x==1]
  mean(ty[ty&gt;1])
})
mean_nBF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  ty <span style="color: #C04040;">&lt;-</span> eym[x==1]
  mean(ty[ty&lt;1])
})



min_lBF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  min(ym[x==1])
})

max_lBF <span style="color: #C04040;">&lt;-</span> apply(xGO,2,<span style="color: #C8FF03;">function</span>(x){
  max(ym[x==1])
})


x_df <span style="color: #C04040;">&lt;-</span> tibble(feature_name=names(med_BF),
               med_BF,
               mean_BF,
               min_BF,
               max_BF,
               med_lBF,
               mean_lBF,
               min_lBF,
               max_lBF,
               perc_p,
               mean_plBF,
               mean_nlBF,
               mean_pBF,
               mean_nBF,
               sum_X=apply(xGO,2,sum)
               ) <span style="color: #C04040;">%&gt;%</span> inner_join(select(fgem_results, feature_name, estimate_fgem, Intercept, pval_fgem, qval_fgem, lik), by = <span style="color: #FFABAB;">"feature_name"</span>) <span style="color: #C04040;">%&gt;%</span>
  arrange(desc(estimate_fgem))


</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">


fgem_results <span style="color: #C04040;">&lt;-</span> qs::qread(<span style="color: #FFABAB;">"data/alt_new_fgem_marginal_results.qs"</span>) <span style="color: #C04040;">%&gt;%</span>
  mutate(trait = map_chr(Beta, ~.x$feature_name[2])) <span style="color: #C04040;">%&gt;%</span>
  unnest(Beta) <span style="color: #C04040;">%&gt;%</span> 
  mutate(feature_name = dplyr::if_else(feature_name == <span style="color: #FFABAB;">"Intercept"</span>, <span style="color: #FFABAB;">"Intercept"</span>, <span style="color: #FFABAB;">"estimate_fgem"</span>)) <span style="color: #C04040;">%&gt;%</span>
  spread(key = <span style="color: #FFABAB;">"feature_name"</span>, value = <span style="color: #FFABAB;">"Beta"</span>) <span style="color: #C04040;">%&gt;%</span>
  rename(feature_name=trait, pval_fgem = pval, qval_fgem = qval) <span style="color: #C04040;">%&gt;%</span>
  filter(cancer==<span style="color: #FFABAB;">"GBM"</span>)

 bad_feat <span style="color: #C04040;">&lt;-</span> filter(fgem_results,estimate_fgem&gt;10) <span style="color: #C04040;">%&gt;%</span> pull(feature_name)
 tX <span style="color: #C04040;">&lt;-</span> as.matrix(xGO[ocancer_df$Gene,bad_feat,drop=<span style="color: #99D6FF;">FALSE</span>])

<span style="color: #FFE203;">tpfun</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(B,x,b){
  xb <span style="color: #C04040;">&lt;-</span> b[1] +  x<span style="color: #C04040;">%*%</span>b[-1]
  exp
  B + (1 - B)/(1 + exp()
}


marr <span style="color: #C04040;">&lt;-</span> fgem:::fgem_marginal(tX,ym,log_BF=<span style="color: #99D6FF;">TRUE</span>,max_iter=150,grad=<span style="color: #99D6FF;">TRUE</span>,hess=<span style="color: #99D6FF;">TRUE</span>)

marr_h <span style="color: #C04040;">&lt;-</span> map(marr$Beta,~.x$hessian)
dets <span style="color: #C04040;">&lt;-</span> map_dbl(marr_h,det)

mardf <span style="color: #C04040;">&lt;-</span> marr <span style="color: #C04040;">%&gt;%</span>
  mutate(trait = map_chr(Beta, ~.x$feature_name[2])) <span style="color: #C04040;">%&gt;%</span>
  mutate(det= map_dbl(Beta,~det(.x$hessian))) <span style="color: #C04040;">%&gt;%</span> 
  unnest(Beta) <span style="color: #C04040;">%&gt;%</span> select(-hessian) <span style="color: #C04040;">%&gt;%</span> 
  mutate(feature_name = dplyr::if_else(feature_name == <span style="color: #FFABAB;">"Intercept"</span>, <span style="color: #FFABAB;">"Intercept"</span>, <span style="color: #FFABAB;">"fgem"</span>)) <span style="color: #C04040;">%&gt;%</span>
  pivot_wider(names_from = <span style="color: #FFABAB;">"feature_name"</span>, values_from = c(<span style="color: #FFABAB;">"Beta"</span>,<span style="color: #FFABAB;">"gradient"</span>)) <span style="color: #C04040;">%&gt;%</span>
  rename(feature_name=trait) <span style="color: #C04040;">%&gt;%</span>
  select(feature_name,lik,Beta=Beta_fgem,Intercept=Beta_Intercept,grad_fgem=gradient_fgem,grad_int=gradient_Intercept,time,pval,sum_X,l2n,sum_X,det) <span style="color: #C04040;">%&gt;%</span> arrange(feature_name)

 univr <span style="color: #C04040;">&lt;-</span> unnest(rrfitt,Beta)
 tpI <span style="color: #C04040;">&lt;-</span> rnorm(3500,mean=univr$Beta[1],sd=0)
 tpB <span style="color: #C04040;">&lt;-</span> rnorm(3500,mean=univr$Beta[2],sd=1)

 eym <span style="color: #C04040;">&lt;-</span> exp(ym)
 lik <span style="color: #C04040;">&lt;-</span> map2_dbl(tpI,tpB,<span style="color: #C8FF03;">function</span>(x,y){
   fgem:::fgem_lik_stan(c(x,y),tX,exp(ym),log_BF=<span style="color: #99D6FF;">FALSE</span>)
 })
 prior_mat <span style="color: #C04040;">&lt;-</span> mapply(<span style="color: #C8FF03;">function</span>(x,y){
   stats::plogis(c(y*tX)+x)
 },tpI,tpB)

 lik_mat <span style="color: #C04040;">&lt;-</span> apply(prior_mat,2,<span style="color: #C8FF03;">function</span>(x){
   log(x*eym+(1-x))
 })

 rownames(lik_mat) <span style="color: #C04040;">&lt;-</span> rownames(tX)
 names(eym) <span style="color: #C04040;">&lt;-</span> rownames(tX)
 lik_df <span style="color: #C04040;">&lt;-</span> as_tibble(lik_mat,rownames=<span style="color: #FFABAB;">"Gene"</span>) <span style="color: #C04040;">%&gt;%</span>
   gather(key=<span style="color: #FFABAB;">"Beta"</span>,value=<span style="color: #FFABAB;">"Lik"</span>,-Gene) <span style="color: #C04040;">%&gt;%</span>
   mutate(Beta=tpB[as.integer(stringr::str_remove(Beta,<span style="color: #FFABAB;">"V"</span>))],
          )
 lik_df <span style="color: #C04040;">&lt;-</span> mutate(lik_df,BF=eym[Gene])
 lik_df <span style="color: #C04040;">&lt;-</span> mutate(lik_df,has_feat=tX[Gene,1]==1)
 hc <span style="color: #C04040;">&lt;-</span> topo.colors(20, alpha = 1, rev = <span style="color: #99D6FF;">FALSE</span>)
 hl_df <span style="color: #C04040;">&lt;-</span> filter(lik_df,has_feat)  <span style="color: #C04040;">%&gt;%</span> group_by(Gene) <span style="color: #C04040;">%&gt;%</span> mutate(grad=(Lik-lead(Lik))/(Beta-lead(Beta))) <span style="color: #C04040;">%&gt;%</span> ungroup() <span style="color: #C04040;">%&gt;%</span>
   mutate(BF_bin=hc[as.integer(cut_interval(log10(BF), n=20))])
          grad_bin=hc[as.integer(cut_number(grad, n=20))])
 with(hl_df,plot3d(Beta,log10(BF),lik,col=grad_bin))

 feat_df <span style="color: #C04040;">&lt;-</span> distinct(lik_df,Gene,BF,has_feat)
 group_by(lik_df,has_feat,Beta) <span style="color: #C04040;">%&gt;%</span> summarise(Lik=sum(Lik)) <span style="color: #C04040;">%&gt;%</span> ggplot(aes(x=Beta,y=Lik,col=has_feat))+geom_point()+facet_wrap(~has_feat,scales=<span style="color: #FFABAB;">"free_y"</span>)+ggtitle(<span style="color: #FFABAB;">"Likelihood with varying Beta"</span>,<span style="color: #FFABAB;">"With or without feature"</span>)
 filter(lik_df,has_feat)  <span style="color: #C04040;">%&gt;%</span>
   mutate(pos_BF=BF&gt;1) <span style="color: #C04040;">%&gt;%</span>
   group_by(Beta) <span style="color: #C04040;">%&gt;%</span>
   summarise(mean_lik=mean(Lik),min_lik=min(Lik),max_lik=max(Lik)) <span style="color: #C04040;">%&gt;%</span>
   ggplot(aes(x=Beta,y=mean_lik))+geom_point()
 +geom_ribbon(aes(x=Beta,ymin=min_lik,ymax=max_lik,col=pos_BF,fill=pos_BF),alpha=0.2) +
   ggtitle(paste0(<span style="color: #FFABAB;">"Per-Gene Likelihood for "</span>,tf,<span style="color: #FFABAB;">" Genes"</span>),<span style="color: #FFABAB;">"Stratified by whether BF&gt;1"</span>)
 ggsave(<span style="color: #FFABAB;">"~/tmp/per_gene.png"</span>)
 diff_mat <span style="color: #C04040;">&lt;-</span> (cbind(lik_mat[,-1],0)-lik_mat)[,-ncol(lik_mat)]
 diff_mat_g <span style="color: #C04040;">&lt;-</span> diff_mat[tX==1,]
 diff_mat_neg <span style="color: #C04040;">&lt;-</span> diff_mat_g[wmd[,1],]

 fgrad <span style="color: #C04040;">&lt;-</span> mapply(<span style="color: #C8FF03;">function</span>(x,y){
   fgem:::fgem_grad_stan(c(x,y),tX,exp(ym),log_BF=<span style="color: #99D6FF;">FALSE</span>)
 },x=tpI,y=tpB)

 grad_df <span style="color: #C04040;">&lt;-</span> tibble(Beta=tpB,Intercept=tpI,Intercept_grad=fgrad[1,],Beta_grad=fgrad[2,],lik=lik) <span style="color: #C04040;">%&gt;%</span>
   mutate(lik_bin=hc[as.integer(cut_number(lik, n=20))],
          beta_grad_bin=hc[as.integer(cut_interval(Beta_grad, n=20))])
 <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">#mutate(grad_df, Beta_bin=cut_number(Beta, n=20)) %&gt;%  ggplot(aes(x=Beta_bin,y=lik,group=Beta_bin))+geom_violin()</span>
 <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">#ggplot(grad_df,aes(x=Intercept,y=lik))+geom_point()</span>

 <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">of &lt;- optim(par=runif(2),gr=fgem:::fgem_grad_stan,fgem:::fgem_lik_stan,X=tX,BF=exp(ym),log_BF=FALSE,prec=0,neg=TRUE)</span>
 <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">theta=0 </span>
 <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">phi=20</span>
 <span style="color: #5D6A70;">## </span><span style="color: #5D6A70;">ggplot(grad_df,aes(x=Beta,y=Intercept,z=lik))+theme_void()+axes_3D(theta=theta, phi=phi) +</span>
 <span style="color: #5D6A70;">##   </span><span style="color: #5D6A70;">stat_3D(theta=theta, phi=phi)</span>
 grad_df <span style="color: #C04040;">&lt;-</span> arrange(grad_df,Beta)
 tgrad_df <span style="color: #C04040;">&lt;-</span> filter(grad_df,Beta&lt;20)
 with(tgrad_df,plot3d(Beta,Intercept,lik,col=beta_grad_bin))

 ggplot(tgrad_df,aes(x=Beta,y=lik,col=Beta_grad))+scale_color_gradient2(trans=<span style="color: #FFABAB;">"log"</span>)+geom_point()+ggtitle(<span style="color: #FFABAB;">"Beta vs Likelihood for GO:0050911"</span>,<span style="color: #FFABAB;">"Colored by gradient wrt Beta"</span>)+ylab(<span style="color: #FFABAB;">"Marginalized Log-Likelihood"</span>)
 ggsave(filename=<span style="color: #FFABAB;">"~/tmp/llk.png"</span>)
 tr <span style="color: #C04040;">&lt;-</span> mutate(gbm_cv_df,Beta=purrr::map2(Beta,group_l2,grad_f))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">


g
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">with_progress({
  cv_df <span style="color: #C04040;">&lt;-</span> dplyr::mutate(cv_fgem(X,ym,alpha=0.8,stratify_BF=<span style="color: #99D6FF;">TRUE</span>),cancer=cancer)
})
filter(cv_df,lambda&gt;0,l1n&gt;1) <span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=lambda,y=cv_lik)) +
  geom_point() +
  facet_wrap(~cv_i,scales=<span style="color: #FFABAB;">"free_y"</span>) +
  scale_x_log10()


scv_df <span style="color: #C04040;">&lt;-</span> fgem:::summarise_cv_lik(cv_df)
with_progress({
  ccv_df <span style="color: #C04040;">&lt;-</span> dplyr::mutate(cv_fgem(X,ym,alpha=0.8,stratify_BF=<span style="color: #99D6FF;">FALSE</span>),cancer=cancer)
})

with_progress({
  lcv_df <span style="color: #C04040;">&lt;-</span> dplyr::mutate(cv_fgem(X,log(ym),alpha=0.8,stratify_BF=<span style="color: #99D6FF;">FALSE</span>,log_BF=<span style="color: #99D6FF;">TRUE</span>),cancer=cancer)
})
slcv_df <span style="color: #C04040;">&lt;-</span> fgem:::summarise_cv_lik(lcv_df)
filter(ccv_df,lambda&gt;0,l1n&gt;1) <span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=lambda,y=cv_lik)) +
  geom_point() +
  facet_wrap(~cv_i,scales=<span style="color: #FFABAB;">"free_y"</span>) +
  scale_x_log10()

sccv_df <span style="color: #C04040;">&lt;-</span> fgem:::summarise_cv_lik(ccv_df)
sccv_df <span style="color: #C04040;">&lt;-</span> inner_join(mutate(sccv_df,ia=<span style="color: #99D6FF;">NA</span>),
                      filter(sccv_df,cv_sum==max(cv_sum)) <span style="color: #C04040;">%&gt;%</span> transmute(ia=<span style="color: #99D6FF;">NA</span>,best_group_l1=group_l1,best_group_l2=group_l2,best_cv=cv_sum)) <span style="color: #C04040;">%&gt;%</span> select(-ia)

filter(sccv_df,group_l1&gt;0) <span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=group_l1, y=cv_sum, col=cv_sum==max(cv_sum)))+geom_point()+scale_x_log10()+geom_vline(aes(xintercept=best_group_l1))

best_gbm <span style="color: #C04040;">&lt;-</span> filter(sccv_df,cv_sum==max(cv_sum))

qs::qsave(cv_df, op)



</pre>
</div>
</div>
</div>
