org/fgem.org
** IntOGen validation

An alternative source of validation is cite: cite:gonzalez-perez13_intog_mutat_ident_cancer_driver

#+BEGIN_SRC R :session fg :tangle ../scripts/fg.R :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 

  comp_df <- read_tsv("data/2020-02-02_IntOGen-Drivers-20200213/Compendium_Cancer_Genes.tsv")
  cohort_df <- read_tsv("data/2020-02-02_IntOGen-Cohorts-20200213/cohorts.tsv")

  cohort_notcga <- filter(cohort_df,SOURCE!="TCGA") %>% rename(cohort=COHORT)

  sub_comp_df <- select(comp_df,Gene=SYMBOL,cohort=COHORT,cancer=CANCER_TYPE,qval_cons=QVALUE_COMBINATION) %>%
    semi_join(cohort_notcga)

  tcomp_df <- select(comp_df,Gene=SYMBOL,cohort=COHORT,cancer=CANCER_TYPE,qval_cons=QVALUE_COMBINATION) %>%
    semi_join(cohort_notcga) %>% 
    distinct(cancer,Gene) %>%
    mutate(value=1L)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session drivermaps :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  sub_comp_l <- nest(sub_comp_df,valid_data=c(Gene,qval_cons))
  all_results <- map_df(fs::dir_ls(out_d),function(x){
    N <- length(qs::qread(fs::path("data/y_models",fs::path_file(x))))
    idf <- qs::qread(x) %>% group_by(l1) %>% filter(abs(l1-(lambda*N)*alpha)==min(abs(l1-(lambda*N)*alpha))) %>% ungroup() %>% 
mutate(max_c=map_dbl(Beta,~max(.x$Beta[-1])))
    })


  pred_fun <- function(df,x,y,log=TRUE){
    tibble::tibble(Gene=rownames(x),post=fgem:::gen_u(Beta = df$Beta, x = x[, df$feature_name[-1],drop=FALSE], B = y, log = log))
  }
  cancer <- "BRCA"
  ardf <- filter(all_results,convergence==0) %>% nest(tresults=-cancer)
  log_pbinom <- function(lp,x){
    mean((x*lp)+(1-x)*log(-expm1(lp)))
  }
  post_fun <- function(tresults,cancer){
    ym <- qs::qread(fs::path("data/y_models", cancer, ext = "qs"))
    xm <- qs::qread(fs::path("data/x_models", cancer, ext = "qs"))
    Id <- matrix(0,nrow(xm),0,dimnames=list(rownames(xm),character()))
    intr <- fgem_bfgs(Id,ym)
    trdf <- pred_fun(intr$Beta[[1]],
                     x = Id,
                     y = ym,
                     log=TRUE) %>%
      rename(uniform_post = post)
    tresults <- filter(tresults) %>%
      mutate(pred=map(Beta,pred_fun,x=xm,y=ym))
    unnest(tresults,pred) %>%
      select(functional_post=post,lambda,Gene) %>%
      inner_join(trdf,by="Gene") %>%
      left_join(filter(tcomp_df,cancer=={{cancer}}),by=c("Gene")) %>%
      replace_na(list(value=0L,cancer=cancer))
  }


  post_results <- pmap_dfr(ardf,post_fun) 


  cv_results <- post_results %>% group_by(lambda,cancer) %>%
      summarise(lik_func=log_pbinom(functional_post,value),
                lik_unif=log_pbinom(uniform_post,value)) %>% ungroup() %>%
    inner_join(all_results)

#+END_SRC

#+RESULTS:



I've identified several cancer types where the FGEM model does a better job of predicting known cancer
genes (using the IntOGen database) than the baseline ~driverMAPS~ model.  


#+BEGIN_SRC R :session drivermaps :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ 
  library(ggrepel)
  library(patchwork)
  sup_mod <- filter(cv_results, l0n>1) %>%
    filter(lik_func > lik_unif) %>%
    group_by(cancer) %>%
    filter(lik_func==max(lik_func)) %>%
    ungroup()

  any_cg <- group_by(post_results,cancer) %>%
    summarise(has_cg=any(value==1)) %>% filter(has_cg)

  cvb <- semi_join(cv_results,any_cg) %>%
    group_by(lambda) %>%
    summarise(p_best=mean(lik_func>lik_unif,na.rm=TRUE),
              n_best=sum(lik_func>lik_unif,na.rm=TRUE),
              n=n()) %>%
    arrange(desc(n_best),desc(p_best))

  any_best <- semi_join(cv_results,any_cg) %>%group_by(cancer) %>%
    summarise(any_best=any(lik_func>lik_unif,na.rm=T)) %>% filter(any_best)
    group_by(lambda)


  bcvb <- filter(cvb, n_best == max(n_best,na.rm=TRUE),
                 ) %>% filter(lambda==min(lambda))

  cbd <- semi_join(cv_results,any_best) %>% group_by(cancer) %>% filter(lik_func==max(lik_func,na.rm=T)) %>% filter(l0n>1) %>% ungroup() 
  bcvbv <- bcvb$lambda

  cvr <- semi_join(cv_results,any_cg) %>% filter(lambda>0) %>% nest(res=-cancer)

  pwalk(cvr, function(res, cancer){
  plt_a <- res %>% ggplot(aes(x=lambda,y=l0n)) + geom_point(aes(col=lik_func>lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position ="none")+ylab("L0 Norm")
  plt_b <- res %>% ggplot(aes(x=lambda,y=l1n)) + geom_point(aes(col=lik_func>lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position ="none")+ylab("L1 Norm")
  plt_c <- res %>% ggplot(aes(x=lambda,y=l2n)) + geom_point(aes(col=lik_func>lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position = "none")+ylab("L2 Norm")
  plt_d <- res %>% ggplot(aes(x=lambda,y=max_c)) + geom_point(aes(col=lik_func>lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position = "none")+ylab(bquote(max(bgroup("|",beta,"|"))))

  plt <- ((plt_a+plt_b)/(plt_c +plt_d)& stat_smooth(geom='line',alpha=0.2) & xlab(bquote(lambda))) + plot_layout(guides = "collect")+plot_annotation(title=cancer)
  od <- fs::path("org/fgem_elastic_fits")
  fs::dir_create(od)
  ggsave(plt,filename=fs::path(od,cancer,ext="png"))
  })

  plt_a <-semi_join(cv_results,any_cg)  %>%
    filter(lambda>0) %>%
    ggplot(aes(x=lambda,y=l0n)) + geom_point(aes(col=lik_func>lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position ="none")+ylab("L0 Norm")
  plt_b <-semi_join(cv_results,any_cg)  %>%
    filter(lambda>0) %>%
    ggplot(aes(x=lambda,y=l1n)) + geom_point(aes(col=lik_func>lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position ="none")+ylab("L1 Norm")
  plt_c <-semi_join(cv_results,any_cg)  %>%
    filter(lambda>0) %>%
    ggplot(aes(x=lambda,y=l2n)) + geom_point(aes(col=lik_func>lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position = "none")+ylab("L2 Norm")
  plt_d <-semi_join(cv_results,any_cg)  %>%
    filter(lambda>0) %>%
    ggplot(aes(x=lambda,y=max_c)) + geom_point(aes(col=lik_func>lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position = "none")+ylab(bquote(max(bgroup("|",beta,"|"))))
  ((plt_a+plt_b)/(plt_c +plt_d) & stat_smooth(geom='line',alpha=0.2)) &xlab(bquote(lambda)) & facet_wrap(~cancer,scales="free_y")

  sup_post <- post_results %>%
    semi_join(any_cg) %>%
    mutate(isIntoGen = (value == 1))


  plot_post <- inner_join(post_results,cbd) %>%
    mutate(isIntoGen = (value == 1))
  iig <- filter(plot_post, isIntoGen)
  plot_post %>% 
    ggplot(aes(x=exp(uniform_post),y=exp(functional_post),col=isIntoGen))+
    geom_point() +
   geom_text_repel(
     data = iig,
     aes(label=Gene)) + 
    facet_wrap(~cancer) + 
    geom_abline(slope = 1)+
    xlab("Uniform Posterior")+ylab("Functional Posterior")

  GO_def <- readRDS("data/GO_Definitions.RDS") %>% select(feature_name,Term)
  GO_def <- bind_rows(GO_def,tibble(feature_name="Intercept",Term="")) %>% distinct()

  best_res <- unnest(cbd,Beta) %>%
    inner_join(GO_def)  %>%
    mutate(label=paste0(feature_name,":\n",Term)) %>% nest(Beta=c("Beta","feature_name","label","Term"))

  pp <- inner_join(post_results,best_res) %>%
    mutate(is_IntoGen = (value == 1)) %>% 
    nest(post=c("Gene","uniform_post","functional_post","value","is_IntoGen"))

  line_break <- function(x){
    stringr::str_replace_all(x,"([^,]+),([^,]+),([^,]+),","\\1,\\2,\\3,\n")
  }
  
  pp %>% pwalk(function(cancer,Beta,post,...){
    iig <- filter(post, is_IntoGen)
    post_diff <- mutate(post,pd=exp(functional_post)-exp(uniform_post)) %>% arrange(pd)
    top_diff <- bind_rows(slice(post_diff,(n()-2):n()),slice(post_diff,1:3))
  
    nBPGOdf <- bind_rows(select(BPGOdf,feature_name=feature,Gene),tibble(Gene=top_diff$Gene,feature_name="Intercept"))
    BP_assignment <- inner_join(top_diff,nBPGOdf) %>% semi_join(Beta) %>% nest(features=feature_name) %>% mutate(feature_list=map_chr(features,~paste0(.x$feature_name[.x$feature_name!="Intercept"],collapse=","))) %>%
      transmute(Gene=Gene,
                uniform_post=exp(uniform_post),
                functional_post=exp(functional_post),
                isIntoGen=is_IntoGen,
                GO_features=line_break(feature_list))
  
  
    post_plot <- post %>% 
      ggplot(aes(x=exp(uniform_post),y=exp(functional_post),col=is_IntoGen))+
      geom_point() +
      geom_text_repel(
        data = iig,
        aes(label=Gene),col="blue") + 
      geom_abline(slope = 1)+
      xlab("Uniform Posterior")+
      ylab("Functional Posterior")
    coeff_plot <- filter(Beta,Beta!=0) %>% ggplot(aes(x=Beta,y=label))+geom_point()+geom_vline(xintercept=0)
    plt <- (coeff_plot+post_plot+plot_layout(guides = "collect")+plot_annotation(title=cancer))
    od <- fs::path("org/fgem_post_plot")
    fs::dir_create(od)
    ggsave(plt, filename=fs::path(od, cancer, ext="png"),width=11,height=11/(1920/1080))
  })
#+END_SRC


#+BEGIN_SRC R :session drivermaps :colnames yes :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :colnames yes
    log_pbinom <- function(lp,x){
        mean((x*lp)+(1-x)*log(-expm1(lp)))
      }

    prior_post_plot <- function(data,cancer,valid_data,cohort,...){
      log<-TRUE
      cancer_list <- valid_data$Gene
      ym <- qs::qread(fs::path("data/y_models/",cancer,ext="qs"))
      xm <- qs::qread(fs::path("data/x_models/",cancer,ext="qs"))
      stopifnot(all(data$feature_name %in% colnames(xm)))
      x <- xm[,data$feature_name,drop=FALSE]
      unifp <- fgem:::gen_u(fgem:::fgem_null(ym),x[,"Intercept",drop=FALSE],ym,log=log)
                                            #unifp <- fgem:::prior_mean(BF,log=log)
      cancer_vec <- rownames(x) %in% cancer_list
      fp <- fgem:::gen_u(data$Beta,x,ym,log=log)
      tibble(cancer=cancer, cross_entropy_functional = -log_pbinom(fp,cancer_vec),
             cross_entropy_uniform = -log_pbinom(unifp,cancer_vec),
             cross_entropy_ratio=cross_entropy_functional-cross_entropy_uniform,
             cohort=cohort)
    }

  validation_df <- pmap_dfr(all_rc,prior_post_plot)
#+END_SRC


#+BEGIN_SRC R :session drivermaps :colnames yes :dir /home/nwknoblauch/Dropbox/Repos/dissertation/ :colnames yes
  log_pbinom <- function(lp,x){
    mean((x*lp)+(1-x)*log(-expm1(lp)))
  }

   prior_post_plot <- function(data,cancer,valid_data,...){
     log<-TRUE
     cancer_list <- unique(valid_data$Gene)
     ym <- qs::qread(fs::path("data/y_models/",cancer,ext="qs"))
     xm <- qs::qread(fs::path("data/x_models/",cancer,ext="qs"))
     stopifnot(all(data$feature_name %in% colnames(xm)))
     x <- xm[,data$feature_name,drop=FALSE]
   
     unifp <- fgem:::gen_u(fgem:::fgem_null(ym),x[,"Intercept",drop=FALSE],ym,log=log)
   
   
     fp <- fgem:::gen_u(data$Beta,x,ym,log=log)
     cancer_vec <- rownames(x) %in% cancer_list
   
     tibble(cancer=cancer,
            cross_entropy_functional = log_pbinom(fp,cancer_vec),
            mean_true_functional=mean(exp(fp)[cancer_vec]),
            mean_false_functional=mean(exp(fp)[!cancer_vec]),
            mean_true_uniform=mean(exp(unifp)[cancer_vec]),
            mean_false_uniform=mean(exp(unifp)[!cancer_vec]),
            cross_entropy_uniform = log_pbinom(unifp,cancer_vec),
            cross_entropy_ratio=cross_entropy_functional-cross_entropy_uniform)
   }



  sub_comp_df <- select(comp_df,Gene=SYMBOL,cohort=COHORT,cancer=CANCER_TYPE,qval_cons=QVALUE_COMBINATION) %>% semi_join(cohort_notcga)

  sub_comp_l <- nest(sub_comp_df,valid_data=c(Gene,qval_cons,cohort))
  all_results <- map_df(fs::dir_ls(out_d),qs::qread) %>%
          select(data,pval,qval,cancer)
  all_rc <- inner_join(all_results,sub_comp_l)

  cv_df <- pmap_df(all_rc,prior_post_plot)
#+END_SRC



