docs/fgem.html



<div id="outline-container-orgdfc34c1" class="outline-3">
<h3 id="orgdfc34c1">IntOGen validation</h3>
<div class="outline-text-3" id="text-orgdfc34c1">
<p>
An alternative source of validation is cite: (<a href="#citeproc_bib_item_2">Gonzalez-Perez et al. 2013</a>)
</p>

<div class="org-src-container">
<pre class="src src-R">
comp_df <span style="color: #C04040;">&lt;-</span> read_tsv(<span style="color: #FFABAB;">"data/2020-02-02_IntOGen-Drivers-20200213/Compendium_Cancer_Genes.tsv"</span>)
cohort_df <span style="color: #C04040;">&lt;-</span> read_tsv(<span style="color: #FFABAB;">"data/2020-02-02_IntOGen-Cohorts-20200213/cohorts.tsv"</span>)

cohort_notcga <span style="color: #C04040;">&lt;-</span> filter(cohort_df,SOURCE!=<span style="color: #FFABAB;">"TCGA"</span>) <span style="color: #C04040;">%&gt;%</span> rename(cohort=COHORT)

sub_comp_df <span style="color: #C04040;">&lt;-</span> select(comp_df,Gene=SYMBOL,cohort=COHORT,cancer=CANCER_TYPE,qval_cons=QVALUE_COMBINATION) <span style="color: #C04040;">%&gt;%</span>
  semi_join(cohort_notcga)

tcomp_df <span style="color: #C04040;">&lt;-</span> select(comp_df,Gene=SYMBOL,cohort=COHORT,cancer=CANCER_TYPE,qval_cons=QVALUE_COMBINATION) <span style="color: #C04040;">%&gt;%</span>
  semi_join(cohort_notcga) <span style="color: #C04040;">%&gt;%</span> 
  distinct(cancer,Gene) <span style="color: #C04040;">%&gt;%</span>
  mutate(value=1L)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">  sub_comp_l <span style="color: #C04040;">&lt;-</span> nest(sub_comp_df,valid_data=c(Gene,qval_cons))
  all_results <span style="color: #C04040;">&lt;-</span> map_df(fs::dir_ls(out_d),<span style="color: #C8FF03;">function</span>(x){
    N <span style="color: #C04040;">&lt;-</span> length(qs::qread(fs::path(<span style="color: #FFABAB;">"data/y_models"</span>,fs::path_file(x))))
    idf <span style="color: #C04040;">&lt;-</span> qs::qread(x) <span style="color: #C04040;">%&gt;%</span> group_by(l1) <span style="color: #C04040;">%&gt;%</span> filter(abs(l1-(lambda*N)*alpha)==min(abs(l1-(lambda*N)*alpha))) <span style="color: #C04040;">%&gt;%</span> ungroup() <span style="color: #C04040;">%&gt;%</span> 
mutate(max_c=map_dbl(Beta,~max(.x$Beta[-1])))
    })


  <span style="color: #FFE203;">pred_fun</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(df,x,y,log=<span style="color: #99D6FF;">TRUE</span>){
    tibble::tibble(Gene=rownames(x),post=fgem:::gen_u(Beta = df$Beta, x = x[, df$feature_name[-1],drop=<span style="color: #99D6FF;">FALSE</span>], B = y, log = log))
  }
  cancer <span style="color: #C04040;">&lt;-</span> <span style="color: #FFABAB;">"BRCA"</span>
  ardf <span style="color: #C04040;">&lt;-</span> filter(all_results,convergence==0) <span style="color: #C04040;">%&gt;%</span> nest(tresults=-cancer)
  <span style="color: #FFE203;">log_pbinom</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(lp,x){
    mean((x*lp)+(1-x)*log(-expm1(lp)))
  }
  <span style="color: #FFE203;">post_fun</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(tresults,cancer){
    ym <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(<span style="color: #FFABAB;">"data/y_models"</span>, cancer, ext = <span style="color: #FFABAB;">"qs"</span>))
    xm <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(<span style="color: #FFABAB;">"data/x_models"</span>, cancer, ext = <span style="color: #FFABAB;">"qs"</span>))
    Id <span style="color: #C04040;">&lt;-</span> matrix(0,nrow(xm),0,dimnames=list(rownames(xm),character()))
    intr <span style="color: #C04040;">&lt;-</span> fgem_bfgs(Id,ym)
    trdf <span style="color: #C04040;">&lt;-</span> pred_fun(intr$Beta[[1]],
                     x = Id,
                     y = ym,
                     log=<span style="color: #99D6FF;">TRUE</span>) <span style="color: #C04040;">%&gt;%</span>
      rename(uniform_post = post)
    tresults <span style="color: #C04040;">&lt;-</span> filter(tresults) <span style="color: #C04040;">%&gt;%</span>
      mutate(pred=map(Beta,pred_fun,x=xm,y=ym))
    unnest(tresults,pred) <span style="color: #C04040;">%&gt;%</span>
      select(functional_post=post,lambda,Gene) <span style="color: #C04040;">%&gt;%</span>
      inner_join(trdf,by=<span style="color: #FFABAB;">"Gene"</span>) <span style="color: #C04040;">%&gt;%</span>
      left_join(filter(tcomp_df,cancer=={{cancer}}),by=c(<span style="color: #FFABAB;">"Gene"</span>)) <span style="color: #C04040;">%&gt;%</span>
      replace_na(list(value=0L,cancer=cancer))
  }


  post_results <span style="color: #C04040;">&lt;-</span> pmap_dfr(ardf,post_fun) 


  cv_results <span style="color: #C04040;">&lt;-</span> post_results <span style="color: #C04040;">%&gt;%</span> group_by(lambda,cancer) <span style="color: #C04040;">%&gt;%</span>
      summarise(lik_func=log_pbinom(functional_post,value),
                lik_unif=log_pbinom(uniform_post,value)) <span style="color: #C04040;">%&gt;%</span> ungroup() <span style="color: #C04040;">%&gt;%</span>
    inner_join(all_results)

</pre>
</div>

<p>
I've identified several cancer types where the FGEM model does a better job of predicting known cancer
genes (using the IntOGen database) than the baseline <code>driverMAPS</code> model.  
</p>


<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(ggrepel)
<span style="color: #C04040;">library</span>(patchwork)
sup_mod <span style="color: #C04040;">&lt;-</span> filter(cv_results, l0n&gt;1) <span style="color: #C04040;">%&gt;%</span>
  filter(lik_func &gt; lik_unif) <span style="color: #C04040;">%&gt;%</span>
  group_by(cancer) <span style="color: #C04040;">%&gt;%</span>
  filter(lik_func==max(lik_func)) <span style="color: #C04040;">%&gt;%</span>
  ungroup()

any_cg <span style="color: #C04040;">&lt;-</span> group_by(post_results,cancer) <span style="color: #C04040;">%&gt;%</span>
  summarise(has_cg=any(value==1)) <span style="color: #C04040;">%&gt;%</span> filter(has_cg)

cvb <span style="color: #C04040;">&lt;-</span> semi_join(cv_results,any_cg) <span style="color: #C04040;">%&gt;%</span>
  group_by(lambda) <span style="color: #C04040;">%&gt;%</span>
  summarise(p_best=mean(lik_func&gt;lik_unif,na.rm=<span style="color: #99D6FF;">TRUE</span>),
            n_best=sum(lik_func&gt;lik_unif,na.rm=<span style="color: #99D6FF;">TRUE</span>),
            n=n()) <span style="color: #C04040;">%&gt;%</span>
  arrange(desc(n_best),desc(p_best))

any_best <span style="color: #C04040;">&lt;-</span> semi_join(cv_results,any_cg) <span style="color: #C04040;">%&gt;%</span>group_by(cancer) <span style="color: #C04040;">%&gt;%</span>
  summarise(any_best=any(lik_func&gt;lik_unif,na.rm=T)) <span style="color: #C04040;">%&gt;%</span> filter(any_best)
  group_by(lambda)


bcvb <span style="color: #C04040;">&lt;-</span> filter(cvb, n_best == max(n_best,na.rm=<span style="color: #99D6FF;">TRUE</span>),
               ) <span style="color: #C04040;">%&gt;%</span> filter(lambda==min(lambda))

cbd <span style="color: #C04040;">&lt;-</span> semi_join(cv_results,any_best) <span style="color: #C04040;">%&gt;%</span> group_by(cancer) <span style="color: #C04040;">%&gt;%</span> filter(lik_func==max(lik_func,na.rm=T)) <span style="color: #C04040;">%&gt;%</span> filter(l0n&gt;1) <span style="color: #C04040;">%&gt;%</span> ungroup() 
bcvbv <span style="color: #C04040;">&lt;-</span> bcvb$lambda

cvr <span style="color: #C04040;">&lt;-</span> semi_join(cv_results,any_cg) <span style="color: #C04040;">%&gt;%</span> filter(lambda&gt;0) <span style="color: #C04040;">%&gt;%</span> nest(res=-cancer)

pwalk(cvr, <span style="color: #C8FF03;">function</span>(res, cancer){
plt_a <span style="color: #C04040;">&lt;-</span> res <span style="color: #C04040;">%&gt;%</span> ggplot(aes(x=lambda,y=l0n)) + geom_point(aes(col=lik_func&gt;lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position =<span style="color: #FFABAB;">"none"</span>)+ylab(<span style="color: #FFABAB;">"L0 Norm"</span>)
plt_b <span style="color: #C04040;">&lt;-</span> res <span style="color: #C04040;">%&gt;%</span> ggplot(aes(x=lambda,y=l1n)) + geom_point(aes(col=lik_func&gt;lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position =<span style="color: #FFABAB;">"none"</span>)+ylab(<span style="color: #FFABAB;">"L1 Norm"</span>)
plt_c <span style="color: #C04040;">&lt;-</span> res <span style="color: #C04040;">%&gt;%</span> ggplot(aes(x=lambda,y=l2n)) + geom_point(aes(col=lik_func&gt;lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position = <span style="color: #FFABAB;">"none"</span>)+ylab(<span style="color: #FFABAB;">"L2 Norm"</span>)
plt_d <span style="color: #C04040;">&lt;-</span> res <span style="color: #C04040;">%&gt;%</span> ggplot(aes(x=lambda,y=max_c)) + geom_point(aes(col=lik_func&gt;lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position = <span style="color: #FFABAB;">"none"</span>)+ylab(bquote(max(bgroup(<span style="color: #FFABAB;">"|"</span>,beta,<span style="color: #FFABAB;">"|"</span>))))

plt <span style="color: #C04040;">&lt;-</span> ((plt_a+plt_b)/(plt_c +plt_d)&amp; stat_smooth(geom=<span style="color: #FFABAB;">'line'</span>,alpha=0.2) &amp; xlab(bquote(lambda))) + plot_layout(guides = <span style="color: #FFABAB;">"collect"</span>)+plot_annotation(title=cancer)
od <span style="color: #C04040;">&lt;-</span> fs::path(<span style="color: #FFABAB;">"org/fgem_elastic_fits"</span>)
fs::dir_create(od)
ggsave(plt,filename=fs::path(od,cancer,ext=<span style="color: #FFABAB;">"png"</span>))
})

plt_a <span style="color: #C04040;">&lt;-</span>semi_join(cv_results,any_cg)  <span style="color: #C04040;">%&gt;%</span>
  filter(lambda&gt;0) <span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=lambda,y=l0n)) + geom_point(aes(col=lik_func&gt;lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position =<span style="color: #FFABAB;">"none"</span>)+ylab(<span style="color: #FFABAB;">"L0 Norm"</span>)
plt_b <span style="color: #C04040;">&lt;-</span>semi_join(cv_results,any_cg)  <span style="color: #C04040;">%&gt;%</span>
  filter(lambda&gt;0) <span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=lambda,y=l1n)) + geom_point(aes(col=lik_func&gt;lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position =<span style="color: #FFABAB;">"none"</span>)+ylab(<span style="color: #FFABAB;">"L1 Norm"</span>)
plt_c <span style="color: #C04040;">&lt;-</span>semi_join(cv_results,any_cg)  <span style="color: #C04040;">%&gt;%</span>
  filter(lambda&gt;0) <span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=lambda,y=l2n)) + geom_point(aes(col=lik_func&gt;lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position = <span style="color: #FFABAB;">"none"</span>)+ylab(<span style="color: #FFABAB;">"L2 Norm"</span>)
plt_d <span style="color: #C04040;">&lt;-</span>semi_join(cv_results,any_cg)  <span style="color: #C04040;">%&gt;%</span>
  filter(lambda&gt;0) <span style="color: #C04040;">%&gt;%</span>
  ggplot(aes(x=lambda,y=max_c)) + geom_point(aes(col=lik_func&gt;lik_unif))+geom_vline(xintercept=bcvbv)+ theme(legend.position = <span style="color: #FFABAB;">"none"</span>)+ylab(bquote(max(bgroup(<span style="color: #FFABAB;">"|"</span>,beta,<span style="color: #FFABAB;">"|"</span>))))
((plt_a+plt_b)/(plt_c +plt_d) &amp; stat_smooth(geom=<span style="color: #FFABAB;">'line'</span>,alpha=0.2)) &amp;xlab(bquote(lambda)) &amp; facet_wrap(~cancer,scales=<span style="color: #FFABAB;">"free_y"</span>)

sup_post <span style="color: #C04040;">&lt;-</span> post_results <span style="color: #C04040;">%&gt;%</span>
  semi_join(any_cg) <span style="color: #C04040;">%&gt;%</span>
  mutate(isIntoGen = (value == 1))


plot_post <span style="color: #C04040;">&lt;-</span> inner_join(post_results,cbd) <span style="color: #C04040;">%&gt;%</span>
  mutate(isIntoGen = (value == 1))
iig <span style="color: #C04040;">&lt;-</span> filter(plot_post, isIntoGen)
plot_post <span style="color: #C04040;">%&gt;%</span> 
  ggplot(aes(x=exp(uniform_post),y=exp(functional_post),col=isIntoGen))+
  geom_point() +
 geom_text_repel(
   data = iig,
   aes(label=Gene)) + 
  facet_wrap(~cancer) + 
  geom_abline(slope = 1)+
  xlab(<span style="color: #FFABAB;">"Uniform Posterior"</span>)+ylab(<span style="color: #FFABAB;">"Functional Posterior"</span>)

GO_def <span style="color: #C04040;">&lt;-</span> readRDS(<span style="color: #FFABAB;">"data/GO_Definitions.RDS"</span>) <span style="color: #C04040;">%&gt;%</span> select(feature_name,Term)
GO_def <span style="color: #C04040;">&lt;-</span> bind_rows(GO_def,tibble(feature_name=<span style="color: #FFABAB;">"Intercept"</span>,Term=<span style="color: #FFABAB;">""</span>)) <span style="color: #C04040;">%&gt;%</span> distinct()

best_res <span style="color: #C04040;">&lt;-</span> unnest(cbd,Beta) <span style="color: #C04040;">%&gt;%</span>
  inner_join(GO_def)  <span style="color: #C04040;">%&gt;%</span>
  mutate(label=paste0(feature_name,<span style="color: #FFABAB;">":\n"</span>,Term)) <span style="color: #C04040;">%&gt;%</span> nest(Beta=c(<span style="color: #FFABAB;">"Beta"</span>,<span style="color: #FFABAB;">"feature_name"</span>,<span style="color: #FFABAB;">"label"</span>,<span style="color: #FFABAB;">"Term"</span>))

pp <span style="color: #C04040;">&lt;-</span> inner_join(post_results,best_res) <span style="color: #C04040;">%&gt;%</span>
  mutate(is_IntoGen = (value == 1)) <span style="color: #C04040;">%&gt;%</span> 
  nest(post=c(<span style="color: #FFABAB;">"Gene"</span>,<span style="color: #FFABAB;">"uniform_post"</span>,<span style="color: #FFABAB;">"functional_post"</span>,<span style="color: #FFABAB;">"value"</span>,<span style="color: #FFABAB;">"is_IntoGen"</span>))

<span style="color: #FFE203;">line_break</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(x){
  stringr::str_replace_all(x,<span style="color: #FFABAB;">"([^,]+),([^,]+),([^,]+),"</span>,<span style="color: #FFABAB;">"\\1,\\2,\\3,\n"</span>)
}

pp <span style="color: #C04040;">%&gt;%</span> pwalk(<span style="color: #C8FF03;">function</span>(cancer,Beta,post,...){
  iig <span style="color: #C04040;">&lt;-</span> filter(post, is_IntoGen)
  post_diff <span style="color: #C04040;">&lt;-</span> mutate(post,pd=exp(functional_post)-exp(uniform_post)) <span style="color: #C04040;">%&gt;%</span> arrange(pd)
  top_diff <span style="color: #C04040;">&lt;-</span> bind_rows(slice(post_diff,(n()-2):n()),slice(post_diff,1:3))

  nBPGOdf <span style="color: #C04040;">&lt;-</span> bind_rows(select(BPGOdf,feature_name=feature,Gene),tibble(Gene=top_diff$Gene,feature_name=<span style="color: #FFABAB;">"Intercept"</span>))
  BP_assignment <span style="color: #C04040;">&lt;-</span> inner_join(top_diff,nBPGOdf) <span style="color: #C04040;">%&gt;%</span> semi_join(Beta) <span style="color: #C04040;">%&gt;%</span> nest(features=feature_name) <span style="color: #C04040;">%&gt;%</span> mutate(feature_list=map_chr(features,~paste0(.x$feature_name[.x$feature_name!=<span style="color: #FFABAB;">"Intercept"</span>],collapse=<span style="color: #FFABAB;">","</span>))) <span style="color: #C04040;">%&gt;%</span>
    transmute(Gene=Gene,
              uniform_post=exp(uniform_post),
              functional_post=exp(functional_post),
              isIntoGen=is_IntoGen,
              GO_features=line_break(feature_list))


  post_plot <span style="color: #C04040;">&lt;-</span> post <span style="color: #C04040;">%&gt;%</span> 
    ggplot(aes(x=exp(uniform_post),y=exp(functional_post),col=is_IntoGen))+
    geom_point() +
    geom_text_repel(
      data = iig,
      aes(label=Gene),col=<span style="color: #FFABAB;">"blue"</span>) + 
    geom_abline(slope = 1)+
    xlab(<span style="color: #FFABAB;">"Uniform Posterior"</span>)+
    ylab(<span style="color: #FFABAB;">"Functional Posterior"</span>)
  coeff_plot <span style="color: #C04040;">&lt;-</span> filter(Beta,Beta!=0) <span style="color: #C04040;">%&gt;%</span> ggplot(aes(x=Beta,y=label))+geom_point()+geom_vline(xintercept=0)
  plt <span style="color: #C04040;">&lt;-</span> (coeff_plot+post_plot+plot_layout(guides = <span style="color: #FFABAB;">"collect"</span>)+plot_annotation(title=cancer))
  od <span style="color: #C04040;">&lt;-</span> fs::path(<span style="color: #FFABAB;">"org/fgem_post_plot"</span>)
  fs::dir_create(od)
  ggsave(plt, filename=fs::path(od, cancer, ext=<span style="color: #FFABAB;">"png"</span>),width=11,height=11/(1920/1080))
})
</pre>
</div>


<div class="org-src-container">
<pre class="src src-R">  <span style="color: #FFE203;">log_pbinom</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(lp,x){
      mean((x*lp)+(1-x)*log(-expm1(lp)))
    }

  <span style="color: #FFE203;">prior_post_plot</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(data,cancer,valid_data,cohort,...){
    log<span style="color: #C04040;">&lt;-</span><span style="color: #99D6FF;">TRUE</span>
    cancer_list <span style="color: #C04040;">&lt;-</span> valid_data$Gene
    ym <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(<span style="color: #FFABAB;">"data/y_models/"</span>,cancer,ext=<span style="color: #FFABAB;">"qs"</span>))
    xm <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(<span style="color: #FFABAB;">"data/x_models/"</span>,cancer,ext=<span style="color: #FFABAB;">"qs"</span>))
    stopifnot(all(data$feature_name <span style="color: #C04040;">%in%</span> colnames(xm)))
    x <span style="color: #C04040;">&lt;-</span> xm[,data$feature_name,drop=<span style="color: #99D6FF;">FALSE</span>]
    unifp <span style="color: #C04040;">&lt;-</span> fgem:::gen_u(fgem:::fgem_null(ym),x[,<span style="color: #FFABAB;">"Intercept"</span>,drop=<span style="color: #99D6FF;">FALSE</span>],ym,log=log)
                                          <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">unifp &lt;- fgem:::prior_mean(BF,log=log)</span>
    cancer_vec <span style="color: #C04040;">&lt;-</span> rownames(x) <span style="color: #C04040;">%in%</span> cancer_list
    fp <span style="color: #C04040;">&lt;-</span> fgem:::gen_u(data$Beta,x,ym,log=log)
    tibble(cancer=cancer, cross_entropy_functional = -log_pbinom(fp,cancer_vec),
           cross_entropy_uniform = -log_pbinom(unifp,cancer_vec),
           cross_entropy_ratio=cross_entropy_functional-cross_entropy_uniform,
           cohort=cohort)
  }

validation_df <span style="color: #C04040;">&lt;-</span> pmap_dfr(all_rc,prior_post_plot)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-R"><span style="color: #FFE203;">log_pbinom</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(lp,x){
  mean((x*lp)+(1-x)*log(-expm1(lp)))
}

 <span style="color: #FFE203;">prior_post_plot</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(data,cancer,valid_data,...){
   log<span style="color: #C04040;">&lt;-</span><span style="color: #99D6FF;">TRUE</span>
   cancer_list <span style="color: #C04040;">&lt;-</span> unique(valid_data$Gene)
   ym <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(<span style="color: #FFABAB;">"data/y_models/"</span>,cancer,ext=<span style="color: #FFABAB;">"qs"</span>))
   xm <span style="color: #C04040;">&lt;-</span> qs::qread(fs::path(<span style="color: #FFABAB;">"data/x_models/"</span>,cancer,ext=<span style="color: #FFABAB;">"qs"</span>))
   stopifnot(all(data$feature_name <span style="color: #C04040;">%in%</span> colnames(xm)))
   x <span style="color: #C04040;">&lt;-</span> xm[,data$feature_name,drop=<span style="color: #99D6FF;">FALSE</span>]

   unifp <span style="color: #C04040;">&lt;-</span> fgem:::gen_u(fgem:::fgem_null(ym),x[,<span style="color: #FFABAB;">"Intercept"</span>,drop=<span style="color: #99D6FF;">FALSE</span>],ym,log=log)


   fp <span style="color: #C04040;">&lt;-</span> fgem:::gen_u(data$Beta,x,ym,log=log)
   cancer_vec <span style="color: #C04040;">&lt;-</span> rownames(x) <span style="color: #C04040;">%in%</span> cancer_list

   tibble(cancer=cancer,
          cross_entropy_functional = log_pbinom(fp,cancer_vec),
          mean_true_functional=mean(exp(fp)[cancer_vec]),
          mean_false_functional=mean(exp(fp)[!cancer_vec]),
          mean_true_uniform=mean(exp(unifp)[cancer_vec]),
          mean_false_uniform=mean(exp(unifp)[!cancer_vec]),
          cross_entropy_uniform = log_pbinom(unifp,cancer_vec),
          cross_entropy_ratio=cross_entropy_functional-cross_entropy_uniform)
 }



sub_comp_df <span style="color: #C04040;">&lt;-</span> select(comp_df,Gene=SYMBOL,cohort=COHORT,cancer=CANCER_TYPE,qval_cons=QVALUE_COMBINATION) <span style="color: #C04040;">%&gt;%</span> semi_join(cohort_notcga)

sub_comp_l <span style="color: #C04040;">&lt;-</span> nest(sub_comp_df,valid_data=c(Gene,qval_cons,cohort))
all_results <span style="color: #C04040;">&lt;-</span> map_df(fs::dir_ls(out_d),qs::qread) <span style="color: #C04040;">%&gt;%</span>
        select(data,pval,qval,cancer)
all_rc <span style="color: #C04040;">&lt;-</span> inner_join(all_results,sub_comp_l)

cv_df <span style="color: #C04040;">&lt;-</span> pmap_df(all_rc,prior_post_plot)
</pre>
</div>
</div>
</div>
