org/fgem.org
** TODO Code [66%]
*** DONE Write Vignette
*** DONE Write R package
*** TODO Submit to CRAN (or Bioconductor)
    DEADLINE: <2020-05-16 Sat>


    
    
* Extras

** Trying GLM family function

#+BEGIN_SRC R


logexp <- function(days = 1)
{
    linkfun <- function(mu) qlogis(mu^(1/days))
    linkinv <- function(eta) plogis(eta)^days
    mu.eta  <- function(eta) days * plogis(eta)^(days-1) *
                  binomial()$mu.eta(eta)
    valideta <- function(eta) TRUE
    link <- paste0("logexp(", days, ")")
    structure(list(linkfun = linkfun, linkinv = linkinv,
                   mu.eta = mu.eta, valideta = valideta, name = link),
              class = "link-glm")
}
(bil3 <- binomial(logexp(3)))


#+END_SRC

** FGEM analyses

*** Run FGEM on new set of genes (ASD)
From cite:satterstrom
The Bayes Factors reported in this paper are not suitable for my method.
#+RESULTS:

** Cancer and ExAC 

To start out with we'll use the exac allele z scores and the Biological Process GO terms.
  To reduce multiple testing burden, 
I'll limit the GO terms to terms with 10 or more genes with that term

#+BEGIN_SRC R :session drivermaps :dir /home/nwknoblauch/Dropbox/Repos/dissertation/

z_df <- filter(exacdf,
                 stringr::str_detect(feature, "z$")) %>%
      spread(feature, value) %>%
      select(-class) %>%
      inner_join(min_cancer_df)
  tres_z <- group_by(z_df, cancer) %>%
    do(FGEM_marginal(select(., -cancer),
                     verbose = FALSE)) %>%
    ungroup()
#+END_SRC

#+RESULTS:



* Trying Stan


#+BEGIN_SRC stan :file simple_logistic_model.stan
  data {
    int<lower=1> G;  // number of data points
    int<lower=0> F;  // number of clusters
    vector[G] B;  // Bayes Factors
    matrix[G,F] A; //Annotation Matrix
  }
  parameters {
    vector[F] Beta; // Effect sizes
    real Beta0; //intercept
  }
  /* transformed parameters { */
  /* vector<lower=0,upper=1>[G] pvec=inv_logit(A * Beta + Beta0); */
  /* } */
  model {
    // likelihood
    Beta0 ~ normal(0,5);
    Beta ~ normal(0,4.5);
    for(n in 1:G){
      real pv=Beta0;
      for(k in 1:F){
        pv+=A[n,k]*Beta[k];
      }
      target+=log( inv_logit(pv) * B[n] + (1 - inv_logit(pv)));
    }
  }

#+END_SRC

#+RESULTS:
[[file:simple_logistic_model.stan]]


#+BEGIN_SRC stan :file logistic_model.stan
  data {
    int<lower=1> g;  // number of data points
    int<lower=0> n;  // number of clusters
    vector[g] B;  // Bayes Factors
    matrix[g,n] A; //Annotation Matrix
  }
  parameters {
    vector[n] Beta; // Effect sizes
    real Beta0; //intercept
  }
  /* transformed parameters { */
  /* vector<lower=0,upper=1>[G] pvec=inv_logit(A * Beta + Beta0); */
  /* } */
  model {
    // likelihood
    vector[g] pvec = inv_logit((A*Beta)+Beta0);
    Beta0 ~ normal(-1,4);
    Beta ~ normal(0,4);
    target+=sum(log( pvec .* B + (1 - pvec)));
  }
#+END_SRC

#+RESULTS:
[[file:logistic_model.stan]]

#+BEGIN_SRC stan :file sparse_logistic_model.stan
  data {
    int<lower=1> g;  // number of genes
    int<lower=0> n;  // number of features
    int<lower=0> nnz; //number of non-zero entries in the feature matrix
    vector[g] B;  // Bayes Factors
    vector[nnz] w; //non-zero entries in the feature matrix
    int v[nnz];//column indices
    int u[g+1];//row start indices
  }
  parameters {
    vector[n] Beta; // Effect sizes
    real Beta0; //intercept
  }
  /* transformed parameters { */
  /* vector<lower=0,upper=1>[G] pvec=inv_logit(A * Beta + Beta0); */
  /* } */
  model {
    // likelihood
    vector[g] pvec = inv_logit(csr_matrix_times_vector(g,n,w,v,u,Beta)+Beta0);
    Beta0 ~ normal(-1,4);
    Beta ~ normal(0,4);
    target+=sum(log( pvec .* B + (1 - pvec)));
  }
#+END_SRC

#+RESULTS:
[[file:sparse_logistic_model.stan]]

*** The horseshoe prior

Scale is a combination of scale for each component as well as a global scale  cite:pmlr-v5-carvalho09a


\begin{align*}
\beta_{m} &\sim \mathcal{N} (0, \tau \cdot \lambda_{m})
\\
\lambda_{m} &\sim \text{Half-}\mathcal{C} (0, 1)
\\
\tau &\sim \text{Half-}\mathcal{C} (0, \tau_{0}).
\end{align*}


