docs/fgem.html



<div id="outline-container-org3ccbfaa" class="outline-3">
<h3 id="org3ccbfaa"><span class="todo TODO">TODO</span> Code <code>[66%]</code></h3>
<div class="outline-text-3" id="text-org3ccbfaa">
</div>
<div id="outline-container-org46d0cdb" class="outline-4">
<h4 id="org46d0cdb"><span class="done DONE">DONE</span> Write Vignette</h4>
</div>
<div id="outline-container-orgaae5590" class="outline-4">
<h4 id="orgaae5590"><span class="done DONE">DONE</span> Write R package</h4>
</div>
<div id="outline-container-org2b0cc20" class="outline-4">
<h4 id="org2b0cc20"><span class="todo TODO">TODO</span> Submit to CRAN (or Bioconductor)</h4>
<div class="outline-text-4" id="text-org2b0cc20">
</div>
</div>
</div>
</div>




<div id="outline-container-org392c63b" class="outline-2">
<h2 id="org392c63b">Extras</h2>
<div class="outline-text-2" id="text-org392c63b">
</div>
<div id="outline-container-orgd8520f9" class="outline-3">
<h3 id="orgd8520f9">Trying GLM family function</h3>
<div class="outline-text-3" id="text-orgd8520f9">
<div class="org-src-container">
<pre class="src src-R">

<span style="color: #FFE203;">logexp</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(days = 1)
{
    <span style="color: #FFE203;">linkfun</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(mu) qlogis(mu^(1/days))
    <span style="color: #FFE203;">linkinv</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(eta) plogis(eta)^days
    <span style="color: #FFE203;">mu.eta</span>  <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(eta) days * plogis(eta)^(days-1) *
                  binomial()$mu.eta(eta)
    <span style="color: #FFE203;">valideta</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(eta) <span style="color: #99D6FF;">TRUE</span>
    link <span style="color: #C04040;">&lt;-</span> paste0(<span style="color: #FFABAB;">"logexp("</span>, days, <span style="color: #FFABAB;">")"</span>)
    structure(list(linkfun = linkfun, linkinv = linkinv,
                   mu.eta = mu.eta, valideta = valideta, name = link),
              class = <span style="color: #FFABAB;">"link-glm"</span>)
}
(bil3 <span style="color: #C04040;">&lt;-</span> binomial(logexp(3)))


</pre>
</div>
</div>
</div>

<div id="outline-container-org0b1890b" class="outline-3">
<h3 id="org0b1890b">FGEM analyses</h3>
<div class="outline-text-3" id="text-org0b1890b">
</div>
<div id="outline-container-orgd6b6f5a" class="outline-4">
<h4 id="orgd6b6f5a">Run FGEM on new set of genes (ASD)</h4>
<div class="outline-text-4" id="text-orgd6b6f5a">
<p>
From (<a href="#citeproc_bib_item_4">Satterstrom et al. 2020</a>)
The Bayes Factors reported in this paper are not suitable for my method.
</p>
</div>
</div>
</div>

<div id="outline-container-org592b59f" class="outline-3">
<h3 id="org592b59f">Cancer and ExAC</h3>
<div class="outline-text-3" id="text-org592b59f">
<p>
To start out with we'll use the exac allele z scores and the Biological Process GO terms.
  To reduce multiple testing burden, 
I'll limit the GO terms to terms with 10 or more genes with that term
</p>

<div class="org-src-container">
<pre class="src src-R">
z_df <span style="color: #C04040;">&lt;-</span> filter(exacdf,
                 stringr::str_detect(feature, <span style="color: #FFABAB;">"z$"</span>)) <span style="color: #C04040;">%&gt;%</span>
      spread(feature, value) <span style="color: #C04040;">%&gt;%</span>
      select(-class) <span style="color: #C04040;">%&gt;%</span>
      inner_join(min_cancer_df)
  tres_z <span style="color: #C04040;">&lt;-</span> group_by(z_df, cancer) <span style="color: #C04040;">%&gt;%</span>
    do(FGEM_marginal(select(., -cancer),
                     verbose = <span style="color: #99D6FF;">FALSE</span>)) <span style="color: #C04040;">%&gt;%</span>
    ungroup()
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org1206012" class="outline-2">
<h2 id="org1206012">Trying Stan</h2>
<div class="outline-text-2" id="text-org1206012">
<div class="org-src-container">
<pre class="src src-stan">data {
  int&lt;lower=1&gt; G;  // number of data points
  int&lt;lower=0&gt; F;  // number of clusters
  vector[G] B;  // Bayes Factors
  matrix[G,F] A; //Annotation Matrix
}
parameters {
  vector[F] Beta; // Effect sizes
  real Beta0; //intercept
}
/* transformed parameters { */
/* vector&lt;lower=0,upper=1&gt;[G] pvec=inv_logit(A * Beta + Beta0); */
/* } */
model {
  // likelihood
  Beta0 ~ normal(0,5);
  Beta ~ normal(0,4.5);
  for(n in 1:G){
    real pv=Beta0;
    for(k in 1:F){
      pv+=A[n,k]*Beta[k];
    }
    target+=log( inv_logit(pv) * B[n] + (1 - inv_logit(pv)));
  }
}

</pre>
</div>

<p>
<a href="simple_logistic_model.stan">simple_logistic_model.stan</a>
</p>


<div class="org-src-container">
<pre class="src src-stan">data {
  int&lt;lower=1&gt; g;  // number of data points
  int&lt;lower=0&gt; n;  // number of clusters
  vector[g] B;  // Bayes Factors
  matrix[g,n] A; //Annotation Matrix
}
parameters {
  vector[n] Beta; // Effect sizes
  real Beta0; //intercept
}
/* transformed parameters { */
/* vector&lt;lower=0,upper=1&gt;[G] pvec=inv_logit(A * Beta + Beta0); */
/* } */
model {
  // likelihood
  vector[g] pvec = inv_logit((A*Beta)+Beta0);
  Beta0 ~ normal(-1,4);
  Beta ~ normal(0,4);
  target+=sum(log( pvec .* B + (1 - pvec)));
}
</pre>
</div>

<p>
<a href="logistic_model.stan">logistic_model.stan</a>
</p>

<div class="org-src-container">
<pre class="src src-stan">data {
  int&lt;lower=1&gt; g;  // number of genes
  int&lt;lower=0&gt; n;  // number of features
  int&lt;lower=0&gt; nnz; //number of non-zero entries in the feature matrix
  vector[g] B;  // Bayes Factors
  vector[nnz] w; //non-zero entries in the feature matrix
  int v[nnz];//column indices
  int u[g+1];//row start indices
}
parameters {
  vector[n] Beta; // Effect sizes
  real Beta0; //intercept
}
/* transformed parameters { */
/* vector&lt;lower=0,upper=1&gt;[G] pvec=inv_logit(A * Beta + Beta0); */
/* } */
model {
  // likelihood
  vector[g] pvec = inv_logit(csr_matrix_times_vector(g,n,w,v,u,Beta)+Beta0);
  Beta0 ~ normal(-1,4);
  Beta ~ normal(0,4);
  target+=sum(log( pvec .* B + (1 - pvec)));
}
</pre>
</div>

<p>
<a href="sparse_logistic_model.stan">sparse_logistic_model.stan</a>
</p>
</div>

<div id="outline-container-org0a0afc1" class="outline-4">
<h4 id="org0a0afc1">The horseshoe prior</h4>
<div class="outline-text-4" id="text-org0a0afc1">
<p>
Scale is a combination of scale for each component as well as a global scale  (<a href="#citeproc_bib_item_1">Carvalho, Polson, and Scott 2009</a>)
</p>


\begin{align*}
\beta_{m} &\sim \mathcal{N} (0, \tau \cdot \lambda_{m})
\\
\lambda_{m} &\sim \text{Half-}\mathcal{C} (0, 1)
\\
\tau &\sim \text{Half-}\mathcal{C} (0, \tau_{0}).
\end{align*}
</div>
</div>
